{
  "answer_by": null, 
  "answers": [
    {
      "author": "Barbara DeLeon", 
      "score": "0", 
      "text": "\n\nWe follow a similar process for capital project prioritization in which the staff uses quantitative models to determine a multi-year list for facilities, streets, and utilities projects.  This information is then proposed to Council as part of the annual budget process.  Since the process starts in December and culminates in May there is plenty of time for input and discussion.\n\n\nWe follow a similar process for capital project prioritization in which the staff uses quantitative models to determine a multi-year list for facilities, streets, and utilities projects.  This information is then proposed to Council as part of the annual budget process.  Since the process starts in December and culminates in May there is plenty of time for input and discussion.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-09-2012"
    }, 
    {
      "author": "Jessica Roth", 
      "score": "0", 
      "text": "\n\nThe City of Suwanee uses a similar method where staff prioritizes the projects using certain criteria and presents to Council for final approval.  However, the Council is involved in a step prior to that process that is crucial to putting the CIP (and budget) together.  During the annual Council work retreat, the Council develops our Short Term Work Program, which is a five-year plan for capital projects and other important City initiatives.  We use that STWP to understand their priorities and put together the CIP.  I've attached a copy of our STWP.  These processes happen over the course of about five months so they have multiple opportunities for input.\n\n\nThe City of Suwanee uses a similar method where staff prioritizes the projects using certain criteria and presents to Council for final approval.  However, the Council is involved in a step prior to that process that is crucial to putting the CIP (and budget) together.  During the annual Council work retreat, the Council develops our Short Term Work Program, which is a five-year plan for capital projects and other important City initiatives.  We use that STWP to understand their priorities and put together the CIP.  I've attached a copy of our STWP.  These processes happen over the course of about five months so they have multiple opportunities for input.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-09-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Nickie Lee", 
  "id": 22153, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting", 
    "Elected Officials"
  ], 
  "text": "\n\nLast year we implemented a Capital Improvement Plan prioritization process, in which City Staff ranked projects based on certain criteria. The results were then presented to the City Manager who considered it when proposing the final Capital Improvement Plan to the City Council. This year the Manager would like to include the City Council more in the prioritization process. Does anyone involve their Council in capital project prioritization, and if so, to what extent? Thank you!\n\n", 
  "title": "City Council Participation in Capital Project Prioritzation", 
  "when": "14-09-2012"
}