{
  "answer_by": null, 
  "answers": [
    {
      "author": "Caitlyn Mitchell", 
      "score": "0", 
      "text": "\n\nI think your intuition about \"written policies\" is probably correct. Having now looked several times to find something that resembles a written preference, the best I could find was a development strategy for Madison, WI (attached below). Beyond this however, there is not much. There is quite about CDBG districts or TIFs or Urban Renewal Areas that specialize in downtown development, but it would not be politically astute to offically single out anyone district/parish/ward over others. Directing funds through urban renewal districts or TIFs would be the best way to keep money in the downtown area, since sales tax will go to the city at large regardless of where in the city that money was originally spent.\n\n\nI think your intuition about \"written policies\" is probably correct. Having now looked several times to find something that resembles a written preference, the best I could find was a development strategy for Madison, WI (attached below). Beyond this however, there is not much. There is quite about CDBG districts or TIFs or Urban Renewal Areas that specialize in downtown development, but it would not be politically astute to offically single out anyone district/parish/ward over others. Directing funds through urban renewal districts or TIFs would be the best way to keep money in the downtown area, since sales tax will go to the city at large regardless of where in the city that money was originally spent.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-03-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Phyllis Russell", 
  "id": 20809, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nHello All,\nMy City Manager wants to implement a downtown preference purchasing administrative policy for the city.  Does anyone know of any city that current has this?  I know it isn't uncommon for there to be a locally owned business preference but to confine it to the downtown area isn't something that I have heard of being a 'written' policy.  Common knowledge and common practice but not an actual policy.  If anyone has any leads please let me know.\nThanks - Phyllis\n\n", 
  "title": "Downtown Preference Purchasing Preference AP", 
  "when": "22-02-2011"
}