{
  "answer_by": null, 
  "answers": [
    {
      "author": "Lawrence Di Re", 
      "score": "2", 
      "text": "\n\nYou only can control what you can, and that does not include the actions and behaviors of others.  Be mindful of attempts to \"triangulate\" you into the gossip and conflicts that already exist between this \"inebriated public official\" and other elected officials, staff, the media, residents, etc. etc. etc.  Concentrate on your own professionalism and the importance of providing meaningful service to the community.  You are a public servant and should always keep the broadest obligations in mind.  At the same time be intellectually honest and respect your ethical beliefs.  It may be more of a dysfunctional situation than you either knew or could have imagined when you accepted the position appointment.  If that inner voice is telling you to separate yourself from a failing organization and situation, consider doing so sooner rather than later.\n\n\nYou only can control what you can, and that does not include the actions and behaviors of others.  Be mindful of attempts to \"triangulate\" you into the gossip and conflicts that already exist between this \"inebriated public official\" and other elected officials, staff, the media, residents, etc. etc. etc.  Concentrate on your own professionalism and the importance of providing meaningful service to the community.  You are a public servant and should always keep the broadest obligations in mind.  At the same time be intellectually honest and respect your ethical beliefs.  It may be more of a dysfunctional situation than you either knew or could have imagined when you accepted the position appointment.  If that inner voice is telling you to separate yourself from a failing organization and situation, consider doing so sooner rather than later.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-01-2013"
    }, 
    {
      "author": "Rodney Proffitt", 
      "score": "0", 
      "text": "\n\nThis sounds totally bizarre that a guy with a well-known drinking problem could win re-election. It's very possible this guy has recovered, in which case the problem is solved. If you try to do the steps you are talking about, those people will be making determinations about you - not the incoming elected official. Therefore, I would refrain from being pro-active, and let things take their course.\n\n\nThis sounds totally bizarre that a guy with a well-known drinking problem could win re-election. It's very possible this guy has recovered, in which case the problem is solved. If you try to do the steps you are talking about, those people will be making determinations about you - not the incoming elected official. Therefore, I would refrain from being pro-active, and let things take their course.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-01-2013"
    }, 
    {
      "author": "Jill Silverboard", 
      "score": "0", 
      "text": "\n\nI have worked in two separate cities where this was an issue for one or more elected officials.  As manager during one of those situtations, the City Attorney and I were cautious as to our involvement and allowed the Council to police itself and its members in that regard.  In one of the situtations it was largely resolved when the elected official was cited for DUI on the way to a City meeting.  In the second, the alcohol consumption before and even during the meeting was never disruptive to the conduct of business and the Council did not challange the member on the matter.  I agree with the comments of those who have suggested restraint until and if the situtation becomes a problem.\n\n\nI have worked in two separate cities where this was an issue for one or more elected officials.  As manager during one of those situtations, the City Attorney and I were cautious as to our involvement and allowed the Council to police itself and its members in that regard.  In one of the situtations it was largely resolved when the elected official was cited for DUI on the way to a City meeting.  In the second, the alcohol consumption before and even during the meeting was never disruptive to the conduct of business and the Council did not challange the member on the matter.  I agree with the comments of those who have suggested restraint until and if the situtation becomes a problem.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-01-2013"
    }, 
    {
      "author": "Lawrence Di Re", 
      "score": "0", 
      "text": "\n\nAny update, Anon?\n\n\nAny update, Anon?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-02-2013"
    }
  ], 
  "answers_count": 4, 
  "author": "[Anonymous]", 
  "id": 22387, 
  "score": "0", 
  "tags": [
    "Ethics", 
    "Performance Management and Analytics", 
    "Elected Officials", 
    "Codes of Ethics"
  ], 
  "text": "\n\nA certain candidate is running unopposed for mayor.  As the new city manager, I am unfamiliar with the individual but am told that during his previous tenure as mayor, he would often show up to meetings appearing to be intoxicated.  Some council members have expressed their concerns to me privately about this.  I personally find it hard to believe that such behavior was ever tolerated - or escaped the media. \nRegardless, my inclination is to: 1) seek advice from legal counsel, then; 2) discuss the issue with other council members individually for their support, then; 3) discuss the matter with the candidate before he is seated, as tactfully as possible; 4) explain the legal remedies available to the council should he ever show up to a meeting appearing to be impaired.\nHopefully, it won't be an issue.  But if it is, he is likely to sabotage his own political career.  I just worry about him damaging the integrity of the city.  I knew I would be confronted with plenty of strange situations along the way, but I never imagined one like this.  Anyone ever deal with anything similar?\n\n", 
  "title": "Inebriated Public Official at Meeting", 
  "when": "24-01-2013"
}