{
  "answer_by": "05-10-2010", 
  "answers": [], 
  "answers_count": 0, 
  "author": "Abigail Lundy", 
  "id": 20463, 
  "score": "1", 
  "tags": [
    "Social Media", 
    "Career Resources"
  ], 
  "text": "\n\nBeginning with the 2007 ICMA Annual Conference in Pittsburgh/Allegheny County, Pennsylvania, ICMA staff has organized a blog to provide both a glimpse into the event and additional content that enhances the conference experience. With each conference, the blog has grown to become more informative and substantial - last year, it replaced the printed newspaper typically provided to attendees onsite each morning. (You can check out the 2009 blog here: http://icmaconference.wordpress.com/.)\nThe blog will substitute for the newspaper again this year, which means ICMA staff will be writing posts about a lot of the events and content shared at the conference (taking place October 17-20 in San Jose). We know, however, that much of the blog's value comes from the conversation it generates among our members, onsite attendees, and virtual attendees. Having a handful of you all contribute to the blog by writing 5-7 posts immediately before, during, and after the event is essential to its success. \nLet me guess - you're interested, but thinking to yourself: \"I've never blogged before, plus there's no way I'll have enough time to do this while I'm in San Jose!\" \nI've got great news for you - you don't have to have any blogging experience to be really good at this, and posts don't have to be long! We really just want you all to share highlights of the conference from your perspective, and to provide insight into the great content you're exposed to in sessions. That way, non-attendees have an extra opportunity to tap into the conversations that are happening in the convention center.\nWhat do you think? If you're interested, please contact Abigail Lundy at alundy@icma.org for more information.\nIf you'd rather not write posts, but want to stay plugged-in to what's happening at the conference, we'll be posting the blog's web address soon - we hope you'll all chime in with comments, regardless of whether you're in San Jose!\n\n", 
  "title": "Want to blog your experience at the ICMA Conference?", 
  "when": "29-09-2010"
}