{
  "answer_by": null, 
  "answers": [
    {
      "author": "Thomas Wieczorek", 
      "score": "0", 
      "text": "\n\nIn order to calculate staffing for any of the desired shifts, the starting point is the number of hours that are required for coverage per year. If you have a minimum manning of five person and there are 24 hours in a day and 365 days in a year, there is a base requirement for coverage of 43,800 hours. \nThe next calculation is to determine how many hours per year (ideally) you will get from each position. A 12-hour shift normally provides 42 hours of work per week or 2,184 hours per year. A typical 8 hour day shift provides 2080 hours per year. Each of those shifts are usually staffed with a four-platoon system. The 24-hour shift with a 56 hour work week (allowable by FLSA) affords 2,912 hours on the job and is normally accomplished with 3 platoons versus 4 for the other staffing models. \nCritical to determining the numbers that you will need for staffing without overtime is calculating the hours that are NOT worked. In other words, how many hours will be given off for holidays (if any)? How many hours will be given off for vacation and sick? In this part of the calculation, contracts should specify hours, not days, especially if you are going from an 8 hour shift to a 12 or 24 hour shift. The reason is that if you have awarded leave time in days and convert the days to another time period, you may automatically triple the amount of time off given to your employees.  Another pitfall is that employees working 24 hour shifts like to negotiate \"Kelley Days.\" These are days off given in incremental pieces which lower the actual hours worked from 56 per week to something less. The Center for Public Safety Management has reviewed a number of contracts that lower the actual hours worked to 40 per pay period. This becomes a problem because of the 40, half are spent sleeping so actual hours worked may be 20 or less!\nSubtracting the hours NOT worked from the total hours scheduled is then divided into the hours that are needed. The result is the staffing required for coverage. Dividing that number by the shifts equals the personnel per shift. \nDon't forget -- because 24 hour schedules normally use 3 squads versus four, your overall staffing is reduced. Using the formula given, and allowing 10 vacation day-equivalents for 8, 12, and 24 hour shifts shows that all three need about 5.5 persons per squad to keep a minimum of 5 on duty. But the 8 and 12 scenarios would require a total of 21.2 to 21.8 in overall numbers while the 24 hour shift (without any Kelley days) would require only 16.4 total personnel.\n\n\nIn order to calculate staffing for any of the desired shifts, the starting point is the number of hours that are required for coverage per year. If you have a minimum manning of five person and there are 24 hours in a day and 365 days in a year, there is a base requirement for coverage of 43,800 hours. \n\nThe next calculation is to determine how many hours per year (ideally) you will get from each position. A 12-hour shift normally provides 42 hours of work per week or 2,184 hours per year. A typical 8 hour day shift provides 2080 hours per year. Each of those shifts are usually staffed with a four-platoon system. The 24-hour shift with a 56 hour work week (allowable by FLSA) affords 2,912 hours on the job and is normally accomplished with 3 platoons versus 4 for the other staffing models. \n\nCritical to determining the numbers that you will need for staffing without overtime is calculating the hours that are NOT worked. In other words, how many hours will be given off for holidays (if any)? How many hours will be given off for vacation and sick? In this part of the calculation, contracts should specify hours, not days, especially if you are going from an 8 hour shift to a 12 or 24 hour shift. The reason is that if you have awarded leave time in days and convert the days to another time period, you may automatically triple the amount of time off given to your employees.  Another pitfall is that employees working 24 hour shifts like to negotiate \"Kelley Days.\" These are days off given in incremental pieces which lower the actual hours worked from 56 per week to something less. The Center for Public Safety Management has reviewed a number of contracts that lower the actual hours worked to 40 per pay period. This becomes a problem because of the 40, half are spent sleeping so actual hours worked may be 20 or less!\n\nSubtracting the hours NOT worked from the total hours scheduled is then divided into the hours that are needed. The result is the staffing required for coverage. Dividing that number by the shifts equals the personnel per shift. \n\nDon't forget -- because 24 hour schedules normally use 3 squads versus four, your overall staffing is reduced. Using the formula given, and allowing 10 vacation day-equivalents for 8, 12, and 24 hour shifts shows that all three need about 5.5 persons per squad to keep a minimum of 5 on duty. But the 8 and 12 scenarios would require a total of 21.2 to 21.8 in overall numbers while the 24 hour shift (without any Kelley days) would require only 16.4 total personnel.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-11-2010"
    }, 
    {
      "author": "John Galt", 
      "score": "0", 
      "text": "\n\nFantastic information thank you!!\n\n\nFantastic information thank you!!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-11-2010"
    }, 
    {
      "author": "Leonard Matarese", 
      "score": "0", 
      "text": "\n\nRemember that EMS workers that are not firefighters do not fall under the FLSA 40 hour workweek exemption. Any time over 40 hour for these workers must be paid at overtime rates. Also some states have labor laws that are more stringent than the federal regulations. For example, Arizona requires police officers to recieve overtime pay for any work over 40 hours.\n\n\nRemember that EMS workers that are not firefighters do not fall under the FLSA 40 hour workweek exemption. Any time over 40 hour for these workers must be paid at overtime rates. Also some states have labor laws that are more stringent than the federal regulations. For example, Arizona requires police officers to recieve overtime pay for any work over 40 hours.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-12-2010"
    }
  ], 
  "answers_count": 3, 
  "author": "John Galt", 
  "id": 20593, 
  "score": "0", 
  "tags": [
    "Healthy Living"
  ], 
  "text": "\n\nI have used the following formula to staff a 24 hour position using 40 hour a week employees.   Staffing one 24 hour position, requires 4.2 FTEs to adequately account for vacation and other time off. These are typically 8 hour shifts.\nIs it any different if you have staff working 24 hour shifts.\nTo be more specific, if I have a minimum staffing level of 5, and I have three shifts of staff working 24 hours on and 48 hours off, How many people do I need most effectively staff. My formula would require 21 total employees or 7 per shift. is seems too high so I am wondering if the 56 hour work week vs 40 hour work week requires a different formula.\nIf there is such a formula can anyone give me a reference to it?\n\n", 
  "title": "Budgeting for 24 hour staffing using 56 hour work week for fire and ems workers", 
  "when": "13-11-2010"
}