{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "1", 
      "text": "\n\nAnn, if I can offer a couple of ways to determine how the number of officers are determined.   The first review you need to do is department operations.  By that, I mean unlike police departments, fire departments nearly always operate in group environments.   Group dynamics suggest that because of the amount and kind of decision-making required on emergency scenes, someone within the group needs to be given the responsibility and authority to make decisions, i.e. the officer.  So perspective #1 is, within department operations, how many staffed units could potentially be operating independently, either on separate incidents or separate functions within the same incident, and therefore requiring a supervisor?\nIn addition, as Jerrold said, the extent of the interaction between supervisor and subordinate generally dictates the officer:subordinate ratio.  The more interaction required, the lower the ratio.  Current emergency scene ICS protocols teach a maximum span of control of 5-7 however that does not mean that less than that does not require a supervisor, only that the span of control is the suggested maximum.\nSecond perspective is related to your platoon leaders who are most often initial emergency scene incident commanders on multi-unit incidents.  Again, 5-7 is what is taught as maximum span of control.   If an incident will have  multiple units engaged in various aspects of an emergency scene, an overall incident commander is required.  Taking this incident commander from first-line units tends to short-staff the operation and safety significantly. \nLastly, you can look also look at reducing the number of ranked officers and replacing them with \"acting up\" officers that rotate, volunteer, etc. however, the quality and efficiency of the operation and its leadership will never be as equal as with an individual who is formally assigned responsibility, authority, and accountability.   And then of course, there are other non-emergency scene requirements for organizational leaders such as personnel development and functional responsibilities.\nHope this helps,\nChris Truty, MS\nDeputy Fire Chief\nMount Prospect, IL\n\n\nAnn, if I can offer a couple of ways to determine how the number of officers are determined.   The first review you need to do is department operations.  By that, I mean unlike police departments, fire departments nearly always operate in group environments.   Group dynamics suggest that because of the amount and kind of decision-making required on emergency scenes, someone within the group needs to be given the responsibility and authority to make decisions, i.e. the officer.  So perspective #1 is, within department operations, how many staffed units could potentially be operating independently, either on separate incidents or separate functions within the same incident, and therefore requiring a supervisor?\n\nIn addition, as Jerrold said, the extent of the interaction between supervisor and subordinate generally dictates the officer:subordinate ratio.  The more interaction required, the lower the ratio.  Current emergency scene ICS protocols teach a maximum span of control of 5-7 however that does not mean that less than that does not require a supervisor, only that the span of control is the suggested maximum.\n\nSecond perspective is related to your platoon leaders who are most often initial emergency scene incident commanders on multi-unit incidents.  Again, 5-7 is what is taught as maximum span of control.   If an incident will have  multiple units engaged in various aspects of an emergency scene, an overall incident commander is required.  Taking this incident commander from first-line units tends to short-staff the operation and safety significantly. \n\nLastly, you can look also look at reducing the number of ranked officers and replacing them with \"acting up\" officers that rotate, volunteer, etc. however, the quality and efficiency of the operation and its leadership will never be as equal as with an individual who is formally assigned responsibility, authority, and accountability.   And then of course, there are other non-emergency scene requirements for organizational leaders such as personnel development and functional responsibilities.\n\nHope this helps,\n\nChris Truty, MS\nDeputy Fire Chief\nMount Prospect, IL\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-01-2013"
    }, 
    {
      "author": "Jerrold Prendergast MPA, EFO", 
      "score": "0", 
      "text": "\n\nGenerally, much of the literature states that there are several factors that determine span of control. This includes the ability of the supervisor and those of the subordinate, the task being performed, and the proximity of those being supervised. For example, a non- emergency operation covering a small area may allow a larger span of control where a high hazard operation over a large area would mandate a lesser amount. So to put it in certain terms, it is situational.\n\n\nGenerally, much of the literature states that there are several factors that determine span of control. This includes the ability of the supervisor and those of the subordinate, the task being performed, and the proximity of those being supervised. For example, a non- emergency operation covering a small area may allow a larger span of control where a high hazard operation over a large area would mandate a lesser amount. So to put it in certain terms, it is situational.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-01-2013"
    }, 
    {
      "author": "Jerrold Prendergast MPA, EFO", 
      "score": "0", 
      "text": "\n\nAs far as our Department, we have a one officer assigned to each apparatus and they supervise 2-4 firefighters, We have a 10 and 14 hours shift and, generally, there are 3-4 Captains assigned to each group, who, are assigned to those apparatus I discussed. Hope this helps.\n\n\nAs far as our Department, we have a one officer assigned to each apparatus and they supervise 2-4 firefighters, We have a 10 and 14 hours shift and, generally, there are 3-4 Captains assigned to each group, who, are assigned to those apparatus I discussed. Hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-01-2013"
    }
  ], 
  "answers_count": 3, 
  "author": "Ann Flynn", 
  "id": 22378, 
  "score": "0", 
  "tags": [
    "Water & Sanitation", 
    "Risk Management", 
    "Finance and Budgeting", 
    "Lean Government", 
    "Public Safety"
  ], 
  "text": "\n\nWe are currently studying our Officer to Fire Fighter ratio. On a platoon of 26 personnel, located in 4 stations and with the ability to respond with 7 apparatus ( 1 rescue, 2 quint and 4 tankers), we have 1 Platoon Captain, 5 Captains, 3 Lieutenants and  17 Firefighters assigned.  We require as a minimum 1 Platoon Captain, and one officer qualified to act as a captain at each of the 4 stations. We incurred over 900 hours of overtime due to officer shortage in 2012.\nOur theory is that we could successfully   provide emergency incident mitigation with fewer Officers assigned to each Platoon.  By assigning fewer Officers we would reduce salary costs and costs related to OT created by \"officer shortage\". \nWe are seeking information related to the correct ratio of Officers to Firefighters from other Fire Departments. What span of control do your officers have and what is your  ratio of Officers to Firefighters?  What is your ratio of Captains to Lieutenants? \nAny information you are able to provide would be helpful as we research these questions\n Sincerely\n Ann Flynn\nManager Improvement and Innovation \n City of Fredericton\n\n", 
  "title": "Span of Control for Officer in a Fire Department", 
  "when": "15-01-2013"
}