{
  "answer_by": "18-07-2014", 
  "answers": [
    {
      "author": "Tony Mazzucco", 
      "score": "0", 
      "text": "\n\nHi Vincent,\nWe have a basic physical fitness program for our PD that is incentive based.  They have two opportunities a year to show they can pass the Maine Criminal Justice Academy fitness standards for their age and if they do they receive a $500 stipend (they can try twice a year but only get one stipend).  I know other communities in Maine base similar incentives on passing to some degree (above or below the standard) of the MCJA fitness standards, with some doing a weekly or hourly pay increase if they continue to pass each year.  We kept ours simple-If you can pass the academy fitness standards for your age, you get a $500 bonus each year  Participation is not required, though at some point we would like to add that to the contract for our PD.  We are able to administer the test in house.  Hope this helps!\n\n\nHi Vincent,\n\nWe have a basic physical fitness program for our PD that is incentive based.  They have two opportunities a year to show they can pass the Maine Criminal Justice Academy fitness standards for their age and if they do they receive a $500 stipend (they can try twice a year but only get one stipend).  I know other communities in Maine base similar incentives on passing to some degree (above or below the standard) of the MCJA fitness standards, with some doing a weekly or hourly pay increase if they continue to pass each year.  We kept ours simple-If you can pass the academy fitness standards for your age, you get a $500 bonus each year  Participation is not required, though at some point we would like to add that to the contract for our PD.  We are able to administer the test in house.  Hope this helps!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-07-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Vincent Vega", 
  "id": 23218, 
  "score": "0", 
  "tags": [
    "Police"
  ], 
  "text": "\n\nGood Day,\nOur department is looking at implementing a phyical agility test as part of its merit pay program.  The Merit program is optional for officers to participate in and the phycial agility test would only be a voluntary component of the merit pay system.  \nThe question I have for the group is whether or not your departments have a physical fitness program, if so what does it look like.  Is it a required program or is it optional, and have you been challenged legally because of the program.\nI thank you, in advance, for any information you can share.\n\n", 
  "title": "Physical Standards for Police Officer", 
  "when": "10-07-2014"
}