{
  "answer_by": null, 
  "answers": [
    {
      "author": "Curt Loupe", 
      "score": "0", 
      "text": "\n\nThat's an unusual situation and one can see your dilemma.  If your Parks Superintendent is capable as you indicate, is there a way to get her/him the added experience or education to allow the person to perform the elements of the higher administrator's position?   Is there an Asst. City Manager who could partner with the Park Superintendent to cover the administrative needs?\nLacking that, would it be possible to contract with the YMCA for their Branch Executive or CEO's services for administrative functions that serve the City?\nYours is a unique situation, hope these suggestions might assist you.\n\n\nThat's an unusual situation and one can see your dilemma.  If your Parks Superintendent is capable as you indicate, is there a way to get her/him the added experience or education to allow the person to perform the elements of the higher administrator's position?   Is there an Asst. City Manager who could partner with the Park Superintendent to cover the administrative needs?\n\nLacking that, would it be possible to contract with the YMCA for their Branch Executive or CEO's services for administrative functions that serve the City?\n\nYours is a unique situation, hope these suggestions might assist you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-06-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Tom Homan", 
  "id": 21910, 
  "score": "0", 
  "tags": [
    "Housing & Community Development", 
    "Climate Change", 
    "Parks and Recreation", 
    "Planning"
  ], 
  "text": "\n\nMy city recently contracted with the YMCA to manage the city's recreation programs, largely as a result of a new community center/YMCA the city opened--as a result, the city did not fill its vacant Parks and Recreation Director postion.\nThis has left us with a void in the parks administration area--while we have a very capable Parks Superintendent, we're lacking the higher level parks administrator/planner postion.\nI'd be interested in learning about communities that have parks manager/administrator postion as opposed to the tradional parks and receration director positions.\n\n", 
  "title": "Parks Administration vs. Parks and Recreation Administration", 
  "when": "19-05-2012"
}