{
  "answer_by": null, 
  "answers": [
    {
      "author": "Trey Williams", 
      "score": "1", 
      "text": "\n\nJeff,\nAttached is a document that highlights the cooperation of four small to medium sized cities in New Zealand that began a creative approach for a multi-council collaboration program that centered on several facets of creating a regional planning policy in many areas. I'm not sure what the local governmental structure is in the surrounding towns but this can help you begin thinking in that vein as to how each town can collaborate for a more regional planning policy. There is more scholarly work available in this area but it centers more on academics than practical application. I hope this helps.\n\n\nJeff,\n\nAttached is a document that highlights the cooperation of four small to medium sized cities in New Zealand that began a creative approach for a multi-council collaboration program that centered on several facets of creating a regional planning policy in many areas. I'm not sure what the local governmental structure is in the surrounding towns but this can help you begin thinking in that vein as to how each town can collaborate for a more regional planning policy. There is more scholarly work available in this area but it centers more on academics than practical application. I hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-08-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Jeffrey Horne", 
  "id": 20358, 
  "score": "0", 
  "tags": [
    "Regionalism", 
    "Planning"
  ], 
  "text": "\n\nOur small city of 27,000 people has our planning position open currently, and rather than just fill it we are thinking that this might be the chance to think area wise in our little metro or as we call it micropolitan area. We have two adjoining cities of about 5,000 people each and another smaller town of 700 or so. Does anyone here have any experience transitioning from a stand alone planning department a metro or sub-regional form of planning. I realize that some larger cities may, but I am looking for smaller or mid size city examples more specifically.\n\n", 
  "title": "Looking for cities who went from city to metro or sub-regional planning", 
  "when": "29-08-2010"
}