{
  "answer_by": null, 
  "answers": [
    {
      "author": "Heidi Voorhees", 
      "score": "0", 
      "text": "\n\nI've worked with a number of candidates who have been unemployed for as long or longer than you have and they are now getting jobs.  A couple just secured positions in the last month.  So, stay positive and hopeful -- there are a lot of talented people who have been and still are out of work.   If you've had any consulting or volunteer work since your last job, be sure and include it on your resume.  You are right to network with colleagues with the hope of doing project work or interim work which often leads to a permanent position.  Be sure they are aware of your specific skill sets -- I know of unemployed professionals who have assisted with budget development or other \"crunch time\" projects.  I would be happy to review your resume if you think that might be helpful.  Best wishes to you.\n\n\nI've worked with a number of candidates who have been unemployed for as long or longer than you have and they are now getting jobs.  A couple just secured positions in the last month.  So, stay positive and hopeful -- there are a lot of talented people who have been and still are out of work.   If you've had any consulting or volunteer work since your last job, be sure and include it on your resume.  You are right to network with colleagues with the hope of doing project work or interim work which often leads to a permanent position.  Be sure they are aware of your specific skill sets -- I know of unemployed professionals who have assisted with budget development or other \"crunch time\" projects.  I would be happy to review your resume if you think that might be helpful.  Best wishes to you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "31-12-2013"
    }, 
    {
      "author": "Fred Sahakian", 
      "score": "0", 
      "text": "\n\nYou are not alone in your journey, as I am also unemployed seeking management work in the California non-profit or government sectors.  Try joining a \"job club\".  I joined a job club by my home and it is entirely driven by volunteers, it is free, and it works with the State employment department.  The club I am part of is for professionals and provides volunteer-led training on resumes, interviewing skills, social media, but most importantly, provides a network of people in the same situation.  We've had a fiance VP who was out of work for almost two years, so we are not alone.\n\n\nYou are not alone in your journey, as I am also unemployed seeking management work in the California non-profit or government sectors.  Try joining a \"job club\".  I joined a job club by my home and it is entirely driven by volunteers, it is free, and it works with the State employment department.  The club I am part of is for professionals and provides volunteer-led training on resumes, interviewing skills, social media, but most importantly, provides a network of people in the same situation.  We've had a fiance VP who was out of work for almost two years, so we are not alone.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "31-12-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 22872, 
  "score": "0", 
  "tags": [
    "Hiring", 
    "Career Resources", 
    "Next Generation of Managers"
  ], 
  "text": "\n\nI have been in transition/unemployed for over two years now.  At this point, I feel that my applications/résumés are just being trashed due primarily to the time I have been out of work.  I was  getting interviews consistently until I had been out of work for approximately  1.6 years, then they basically just shut off (and over the last few months I have even been sending out more);  I have even broadened my search to include lower-level positions, to no avail.  \nI of course am aware of all the places to seek positions (indeed, I feel I have become a pro at this, unfortunately), such as ICMA, all the municipal leagues/leagues of cities, and many other sources.\nI limited myself to applying to only municipal positions and other closely related public sector jobs for most  of my unemployed time and have thus now it seems shut myself out of much hope of getting into any other line of work.  (As I am sure most are aware, being unemployed for even a few months is anathema in the private sector, especially for a career changer.)  I still admire and thoroughly enjoy municipal work and public service in general--and feel I have so much more to offer.\nI have over nine years off municipal experience, about seven years of which was as a Town Manager/Administrator and have worked in all areas of government operations.   \nI am willing and able to relocate (and actually would like to) even for a temporary/interim position or project-based type set-up  (of course with some limitations, mainly depending upon duration of the job/project).  I feel that at this point I just need to get myself back doing something credible, and that networking is my only hope (even though I am still forcing myself to apply as diligently as I was on day-one).\nAny advice and/or leads are much needed and greatly appreciated!\n\n", 
  "title": "Advice/Leads for salvaging Career", 
  "when": "04-12-2013"
}