{
  "answer_by": null, 
  "answers": [
    {
      "author": "Christopher Klepper", 
      "score": "0", 
      "text": "\n\nThis is a responce from our Fire Marshal:\nThat's a tough sale, no one likes to receive a fine, for example,  if you're stopped for speeding and the trooper gives you a ticket but provides you with key points like \" you may not survive a crash at 80 MPH or you are endangering your life as well as others on the road, although this is true, I don't know of anyone driving away smiling and being happy about the experience.    We try to educate our business owners/occupants on the first visit when the violation is identified.  They are giving a time to correct the violation  provided information as to why they need to comply with the fire code and the liability they may face should they choose not to and what the next steps will be, that way they see they have a choice and know they will either comply or face court and a fine, and are not surprised.   This is working VERY well, violations are being corrected and we haven't been to court as of today.   One phase of the open for business program is to conduct feasibility studies for customers who are looking to open a business in an existing building and inform them of what would be required in the building, that way they know what to expect, should the building be required to have a sprinkler system, hood system or additional exits, and even ADA requirements, before moving forward to lease or purchase the property, this also allows them time to conduct their research as to the cost for these up grades.  This program is received pretty well.  We want our customers to contact us should they have questions or concerns, we are here to help them and provide them with code information.  Don't know if this helped, this is our program, we have great communication with our customers,  we maintain good customer service skills, the fire code is clear our reports are clear  so there is no surprise's.   We want our customers to have what ever business they choose to, however we want it to be safe and meet the fire code.   One thing I didn't mention is our inspections are surprise inspections, we don't notify them prior.  At the end of the day we hope our customers are satisfied and the buildings are safe.\n\n\nThis is a responce from our Fire Marshal:\n\nThat's a tough sale, no one likes to receive a fine, for example,  if you're stopped for speeding and the trooper gives you a ticket but provides you with key points like \" you may not survive a crash at 80 MPH or you are endangering your life as well as others on the road, although this is true, I don't know of anyone driving away smiling and being happy about the experience.    We try to educate our business owners/occupants on the first visit when the violation is identified.  They are giving a time to correct the violation  provided information as to why they need to comply with the fire code and the liability they may face should they choose not to and what the next steps will be, that way they see they have a choice and know they will either comply or face court and a fine, and are not surprised.   This is working VERY well, violations are being corrected and we haven't been to court as of today.   One phase of the open for business program is to conduct feasibility studies for customers who are looking to open a business in an existing building and inform them of what would be required in the building, that way they know what to expect, should the building be required to have a sprinkler system, hood system or additional exits, and even ADA requirements, before moving forward to lease or purchase the property, this also allows them time to conduct their research as to the cost for these up grades.  This program is received pretty well.  We want our customers to contact us should they have questions or concerns, we are here to help them and provide them with code information.  Don't know if this helped, this is our program, we have great communication with our customers,  we maintain good customer service skills, the fire code is clear our reports are clear  so there is no surprise's.   We want our customers to have what ever business they choose to, however we want it to be safe and meet the fire code.   One thing I didn't mention is our inspections are surprise inspections, we don't notify them prior.  At the end of the day we hope our customers are satisfied and the buildings are safe.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-05-2012"
    }, 
    {
      "author": "Robert Bacal", 
      "score": "0", 
      "text": "\n\nJust came across this, accidentally. I do training of staff for just these situations, and in fact, worked with municipalities in Colorado and Alberta with their staff, including various bylaw inspectors, who do the same work, in effect. You might want to take a look at my book, Defusing Hostile Customers Workbook For The Public Sector, as a source for learning, either on its own, or part of internal staff training, since it was created for government. I have an author page on amazon at: amazon.com/author/robertbacal\n\n\nJust came across this, accidentally. I do training of staff for just these situations, and in fact, worked with municipalities in Colorado and Alberta with their staff, including various bylaw inspectors, who do the same work, in effect. You might want to take a look at my book, Defusing Hostile Customers Workbook For The Public Sector, as a source for learning, either on its own, or part of internal staff training, since it was created for government. I have an author page on amazon at: amazon.com/author/robertbacal\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "27-02-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Karen Roland", 
  "id": 21870, 
  "score": "0", 
  "tags": [
    "Citizen Engagement", 
    "Planning"
  ], 
  "text": "\n\nWe are looking for best practices where although a customer may be sited and fined for a code violation, the department is still able to receive customer satisfaction.  In particular we are looking for a program that may assist our Fire Marshal, Fire Inspector department.  With a Fire Inspector doing a surprise visit, and leaving with the commerical business having to spend funds to fix violations, or to pay a fine, how do Fire Marshal departments still ensure the customers are happy and satisfied with the department and their tax money being used.\n\n", 
  "title": "Code Enforcement Customer Satisfaction", 
  "when": "03-05-2012"
}