{
  "answer_by": null, 
  "answers": [
    {
      "author": "Richard Brown", 
      "score": "2", 
      "text": "\n\nI agree that the initial response is to keep it low key.  Very often these activities occur because the council person is enthusiastic and may not clearly understand their role.  If informal discussions with the council member don't work, there needs to be a discussion with the entire governing body. Governing body support here is essential.    There have been times, when I've noticed that this sort of behavior occurs as a result of the council person feeling that they lack information to fully participate in the governing process.\nMake sure that all council members have the level of information they need to do their jobs and ensure that all members have the same information at the same time.\nUltimately it's up to the city council to set the standards for appropriate interaction between the city council members and the administration.  Council support is essential to maintain the balance within the organization.\n\n\nI agree that the initial response is to keep it low key.  Very often these activities occur because the council person is enthusiastic and may not clearly understand their role.  If informal discussions with the council member don't work, there needs to be a discussion with the entire governing body. Governing body support here is essential.    There have been times, when I've noticed that this sort of behavior occurs as a result of the council person feeling that they lack information to fully participate in the governing process.\n\nMake sure that all council members have the level of information they need to do their jobs and ensure that all members have the same information at the same time.\n\nUltimately it's up to the city council to set the standards for appropriate interaction between the city council members and the administration.  Council support is essential to maintain the balance within the organization.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-07-2010"
    }, 
    {
      "author": "William Horne", 
      "score": "1", 
      "text": "\n\nMartha,\nLike Lawrence said, it CM's nightmare. However, I have dealt with these kind of issues through my weekly meetings with our Mayor and four councilmembers. I use these individal meetings to dsicuss the most sensitive issues we face in councilmember/staff interactions and with citizens. I specifically discuss the offending behavior to better understand why it occurs and offer suggestions on how the councilmember can better their needs. I do establish boundaries so councilmembers won't be surprised if I oppose their actions and I seek the help of the Mayor to address inappropriate council behavior. If the Mayor is the offending party, I'll work with the Vice Mayor.  At the end of the day, I am prepared to lose my job to maintain the integrity of the city charter.\n\n\nMartha,\nLike Lawrence said, it CM's nightmare. However, I have dealt with these kind of issues through my weekly meetings with our Mayor and four councilmembers. I use these individal meetings to dsicuss the most sensitive issues we face in councilmember/staff interactions and with citizens. I specifically discuss the offending behavior to better understand why it occurs and offer suggestions on how the councilmember can better their needs. I do establish boundaries so councilmembers won't be surprised if I oppose their actions and I seek the help of the Mayor to address inappropriate council behavior. If the Mayor is the offending party, I'll work with the Vice Mayor.  At the end of the day, I am prepared to lose my job to maintain the integrity of the city charter.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-07-2010"
    }, 
    {
      "author": "Larry Paine", 
      "score": "0", 
      "text": "\n\nYou just described a CM nightmare.  I think the best approach is too low key the discussions with the offending Council member initially. When things don't change, it would be time to bring the Mayor into the discussions. Assuming you have a strong Mayor who can lay down the law is a good chance the situation will improve. If there is another member of the Council who can speak forcefully if the Mayor cannot, use this member.\nMy experience is that you cannot change this behavior easily. This type of member has an agenda and nothing will stop this behavior short of being unelected.\nOne could always hope that when this sort of behavior shows up at the Council meeting other members of the Council would say \"there you go again. We don't do things like this on this Council.\"  \nIn some issues like being involved in personnel decisions, the Council could do a public vote that status the city manager will be responsible for those decisions.\nBottom line is the whole city Council has to step up to support manager when issues like this occur. Without it, it's miserable.\n\n\nYou just described a CM nightmare.  I think the best approach is too low key the discussions with the offending Council member initially. When things don't change, it would be time to bring the Mayor into the discussions. Assuming you have a strong Mayor who can lay down the law is a good chance the situation will improve. If there is another member of the Council who can speak forcefully if the Mayor cannot, use this member.\n\nMy experience is that you cannot change this behavior easily. This type of member has an agenda and nothing will stop this behavior short of being unelected.\n\nOne could always hope that when this sort of behavior shows up at the Council meeting other members of the Council would say \"there you go again. We don't do things like this on this Council.\"  \n\nIn some issues like being involved in personnel decisions, the Council could do a public vote that status the city manager will be responsible for those decisions.\n\nBottom line is the whole city Council has to step up to support manager when issues like this occur. Without it, it's miserable.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-07-2010"
    }, 
    {
      "author": "Stephen Veitch", 
      "score": "0", 
      "text": "\n\nI don't disagree with anything that has been suggested so far, and thankfully I never experienced behavior quite as outrageous as some of the examples given, but when I encountered situations of this general nature I usually tried to get a clearer understanding of the council member's objectives (and perhaps help them adjust their objectives a bit) and get them to understand that their objectives would be best served by working within the established structures, processes and communication channels.  That assumes, of course, that their objectives were not illegal, just borne of inexperience.  I employed regular one on one meetings, and occasional meetings where the mayor and/or the attorney might be present.  Always, such meetings were characterized as intended to help inform the member and show them how their legitimate objectives could be served, or at least thoroughly considered within the governmental process.\n\n\nI don't disagree with anything that has been suggested so far, and thankfully I never experienced behavior quite as outrageous as some of the examples given, but when I encountered situations of this general nature I usually tried to get a clearer understanding of the council member's objectives (and perhaps help them adjust their objectives a bit) and get them to understand that their objectives would be best served by working within the established structures, processes and communication channels.  That assumes, of course, that their objectives were not illegal, just borne of inexperience.  I employed regular one on one meetings, and occasional meetings where the mayor and/or the attorney might be present.  Always, such meetings were characterized as intended to help inform the member and show them how their legitimate objectives could be served, or at least thoroughly considered within the governmental process.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-07-2010"
    }, 
    {
      "author": "John Garvison", 
      "score": "0", 
      "text": "\n\nWhile I generally agree with all the responses so far, I would have to state the obvious that maybe has not been stated. The people (voters) of your jurisdiction elected this individual to office and regardless of how we might feel about this individual, they are due all the respect that their elected office commands. We have to understand that the people entrusted the city/county/district's governance into this person's hands for some reason. We have to account for that and provide the elected official with all the deference that their position entails. \nWe may disagree with this individual's methods, intents, etc, but they are the elected official, we are just an appointed official that serves at their leisure.\nWith that being said, I subscribe to the 'cards on the table' approach. When a new elected official takes office, I would sit down with them and start a dialogue about why they wanted to run for office, what they are trying to accomplish, their strengths and weaknesses, and in turn I would reciprocate. It is amazing the power of simple communication between people. I also, would understand that on many issues we may disagree, but we would disagree reasonably, and never make it a personal issue.\nNow with all of those qualifiers said, the key as a former elected official myself, is can I trust my staff to bring me all the information necessary for me to make an informed decision, if I can then I will give my staff much more leeway. But, this trust takes time, just as the elected official needs time to earn our trust, we need the same amount of time to earn their trust.\nIf the elected officials know I am going to be a straight shooter with them, even when we disagree on fundamental approaches to governance, they can respect our positions, just as we can respect their positions, but it comes down at least for me to a level of personal communication. Without that frank and open personal communication up down and sideways in the organization, I feel I would be doomed to failure.\n\n\nWhile I generally agree with all the responses so far, I would have to state the obvious that maybe has not been stated. The people (voters) of your jurisdiction elected this individual to office and regardless of how we might feel about this individual, they are due all the respect that their elected office commands. We have to understand that the people entrusted the city/county/district's governance into this person's hands for some reason. We have to account for that and provide the elected official with all the deference that their position entails. \n\nWe may disagree with this individual's methods, intents, etc, but they are the elected official, we are just an appointed official that serves at their leisure.\n\nWith that being said, I subscribe to the 'cards on the table' approach. When a new elected official takes office, I would sit down with them and start a dialogue about why they wanted to run for office, what they are trying to accomplish, their strengths and weaknesses, and in turn I would reciprocate. It is amazing the power of simple communication between people. I also, would understand that on many issues we may disagree, but we would disagree reasonably, and never make it a personal issue.\n\nNow with all of those qualifiers said, the key as a former elected official myself, is can I trust my staff to bring me all the information necessary for me to make an informed decision, if I can then I will give my staff much more leeway. But, this trust takes time, just as the elected official needs time to earn our trust, we need the same amount of time to earn their trust.\n\nIf the elected officials know I am going to be a straight shooter with them, even when we disagree on fundamental approaches to governance, they can respect our positions, just as we can respect their positions, but it comes down at least for me to a level of personal communication. Without that frank and open personal communication up down and sideways in the organization, I feel I would be doomed to failure.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-07-2010"
    }, 
    {
      "author": "Martha Perego", 
      "score": "0", 
      "text": "\n\nThanks to all for your thoughtful comments.  An upcoming PM ethics matter! column is devoted to this important topic.  Please note as well that I have directed several of your colleagues who are dealing with this issue now to your responses. They are grateful for your wisdom.\n\n\nThanks to all for your thoughtful comments.  An upcoming PM ethics matter! column is devoted to this important topic.  Please note as well that I have directed several of your colleagues who are dealing with this issue now to your responses. They are grateful for your wisdom.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-07-2010"
    }, 
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nJanuary 8, 2011\nI am a resident of Manhattan Beach, California.  We have a city council/city manager form of government.  The elected officials serve as mayor on a rotating basis for nine months.  The present mayor is serving his second four-year term that expires in March, 2013.  I and other residents feel his violates the principles and practices of an elected official in a democracy.\nIn a recent letter to a local newspaper, he stated: \"I continually ask that the local “gadflys” (sic) at least inform the residents of the actual facts instead of the usual “misdirection” tactics they always rely on.  \nMaybe one of the “gadflys” (sic) should try for council? Give the residents a chance to show what they think of them.\"\nAt the last city council meeting, December 27, 2010, he responded to a citizen's request that he be censured, apologize, and resign by defiantly reiterating to continue characterize our residents as gadflies.  \nIn response, I submitted a letter to the other four members of the city council requesting them to censure the mayor for malfeasance, require an apology, and require him to undertake efforts to re-educate and reaffirm his roles and responsibilities as an elected officials (Please see attached document).  In addition, I included letters from other citizens who shared my concern; a list of resources that are available to the mayor for re-examining his behavior and practices.\nWe have a new city manager coming on board this Monday.  His name is Dave Carmany, a 25+ year member of ICMA.  In March, we have an election to replace to council members.  One of the candidates is the mayor's sister-in-law.  In addition, the mayor is undertaking efforts to move the subsequent election to November that would extend his term and another effort to increase his term as mayor.\nThe following is my email that contains the attached request to the city council.  In includes my reaction to his remarks made at the December 27th council meeting.\nManhattan Beach City Council Members Ward, Cohen, Powell and Tell:  \nI have attached a letter requesting that the City Council:\n        1. Censure. Censure Councilmember Montgomery for malfeasance.\n        2. Apology. Require Councilmember Montgomery make a public apology.\n        3. Re-education. Require re-education by Councilmember Montgomery on the\n        principles of a democracy and citizen participation.\n        4. Accountability. Hold Councilmember Montgomery accountable to these\n        rehabilitation requirements.\n\nIn addition, please find the following attachments:\n\nLetters to the Editor.  Letters to the Editor of the Beach Reporter by Manhattan Beach residents expressing concerns related to Mr. Montgomery’s behavior and actions that strongly serve as the basis of my requests.  \nRehabilitation Resources.  Examples of resources available to Councilmember Montgomery to re-educate himself on the principles of a democracy and citizen participation including:\n\nA.  The International City/County Management Association (ICMA).  The ICMA offers online workshops and programs that focus on its identification of key competencies essential to local government management including leadership for building community cooperation and consensus. Their online conferences on public engagement and collaborative governance include:\n                                (1). Local Government Collaboration: Success Stories and Lessons \n                        Learned.\n                                (2). Turning Public Employee and Public Ideas into Big Savings and \n                                Increased Revenue\n                                (3). Engaging Citizens to Cut Budgets: How One City Cut $9.5 Million\n                                From the Budget in Just Two Months\n                            (4). Using Collaborative Leadership Skills to Improve Performance of\n                         Local Governments \n\nB. League of California Cities (LCC) and the Institute for Local\n\nGovernment (ILG).  A top priority of the LCC and its research and education affiliate, the ILG, is also public engagement and collaborative governance.  Among its resources are the following free publications:\n                                (1). Principles of Local Government Public Engagement\n                                (2). Beyond the Usuals: Ideas to Encourage Broader Public \n                                 Involvement in Your Community\n                                (3). Responding to Emotions and Conflicts in Public Hearings\n                                (4). Getting the Most Out of Public Hearings: A Guide to Improve \n                                Public Involvement\n\nGadfly “Misdirection”.  Among the Letters to the Editor I have cited is one that relates to a 2006 City Council decision involving undergrounding in which Councilmember Montgomery voted to accept $80,000 to the city from a group seeking council approval on a contested issue involving its desired departure from established city policies and practices.  In my view, it is an example of the “misdirection” tactics that Mr. Montgomery decries\nPositive Gadflies vs. Negative Gadflies.  At the last city council meeting, Mayor Montgomery defiantly reaffirmed his scourge of these gadflies.  However, he went on to argue that there are positive gadflies (those who provide constructive criticism) and negative gadflies (those who complain and criticize).  \nSince a gadfly, by definition, is a person who persistently annoys or stirs up others, we are left with Mr. Montgomery’s semantic challenge to decide by innuendos just who are these negative gadflies?  Are they our neighbors who wrote the letters in my list sharing their depth of concerns regarding Mr. Montgomery’s actions?  Not in my judgment.  \n“Do your homework,” Mr. Montgomery demands, lest he call you a gadfly.  But has he done his?  He pontificates but does not specify.  Request Mr. Montgomery to blazon out his list of negative gadflies and provide them an opportunity to come before your tribunal.  \nHe states “freedom of speech works both ways.”  That is true.  Therefore, give these so-called negative gadflies an opportunity to defend themselves against their “inaccurate statements,” “wild accusations,” and “outright lies.” Or, as he put it, “How’s that for equal justice!”  \nGet Your Facts Right!  Or else, Mr. Montgomery says, he will respond!  This leads to the essence of public service and the pride of being a public employee or an elected official.  Every day you are charged with the responsibility of confronting issues that deeply impact our lives—our livelihood, our homes, our safety, the education of our children, the care of our seniors—in sum, the quality of our existence.  \nBut not without a price, because we often come to you with opposing views based on deeply held value differences where if we “compromise” we feel we have “compromised” our integrity.  And, so our emotions erupt and do they erupt!  Not only directed at each other but also at you in the form of criticism and complaints.\nYet, getting us to “get our facts right” is harder than making simple pronouncements because our values filter our perception of the “facts.”  And, all the facts in the world cannot prove one value better than another, one belief better than another or one feeling better than another.  \nAs I state in my letter, “American democracy is built on forging divergent interests and values within our community into solutions that maximize our long-term viability.”  When President Kennedy said, “Ask not what your country can do for you, but what you can do for your country,” he was asking us to put aside our value differences for the common good.  That is the heart of great political leadership.\nOur Public Employees.  We are fortunate to have the finest city employees.  Every day, they too, face the pressures and challenges similar to those of elected officials.  However, as elected officials you set the standards.  \nThat being the case, do you want our city employees to adhere to Mr. Montgomery’s standards and condone the stereotyping and treatment of our residents as gadflies?  Are you willing to accept the employees’ defense of this characterization, “Well, if the Mayor can do it, why can’t we?”\nWe are also fortunate to live in a community with so many of our neighbors shaping the city’s soul and character by their outpouring of volunteerism, philanthropy, and concern for those in need.    \nIt is a critical time for our city.  “Times they are a-changing” and forging new directions to ensure our viability was never more challenging and never more in need of both compassionate and decisive leadership.  I wish you well.\nThank you for your service.\nI plan to raise further awareness by informing other residents and requesting assistance from the South Bay Council of Governments, the Independent Cities Association, and other community groups.  \nAm I doing the right thing?  Are there other steps I should take?  What should our new city manager do?\nThank you.\nEdward C. Caprielian, Ph.D.\n(310) 546-2345\necapriel@csulb.edu\n\n\nJanuary 8, 2011\n\nI am a resident of Manhattan Beach, California.  We have a city council/city manager form of government.  The elected officials serve as mayor on a rotating basis for nine months.  The present mayor is serving his second four-year term that expires in March, 2013.  I and other residents feel his violates the principles and practices of an elected official in a democracy.\n\nIn a recent letter to a local newspaper, he stated: \"I continually ask that the local “gadflys” (sic) at least inform the residents of the actual facts instead of the usual “misdirection” tactics they always rely on.  \n\nMaybe one of the “gadflys” (sic) should try for council? Give the residents a chance to show what they think of them.\"\n\nAt the last city council meeting, December 27, 2010, he responded to a citizen's request that he be censured, apologize, and resign by defiantly reiterating to continue characterize our residents as gadflies.  \n\nIn response, I submitted a letter to the other four members of the city council requesting them to censure the mayor for malfeasance, require an apology, and require him to undertake efforts to re-educate and reaffirm his roles and responsibilities as an elected officials (Please see attached document).  In addition, I included letters from other citizens who shared my concern; a list of resources that are available to the mayor for re-examining his behavior and practices.\n\nWe have a new city manager coming on board this Monday.  His name is Dave Carmany, a 25+ year member of ICMA.  In March, we have an election to replace to council members.  One of the candidates is the mayor's sister-in-law.  In addition, the mayor is undertaking efforts to move the subsequent election to November that would extend his term and another effort to increase his term as mayor.\n\nThe following is my email that contains the attached request to the city council.  In includes my reaction to his remarks made at the December 27th council meeting.\n\nManhattan Beach City Council Members Ward, Cohen, Powell and Tell:  \n\nI have attached a letter requesting that the City Council:\n\n        1. Censure. Censure Councilmember Montgomery for malfeasance.\n        2. Apology. Require Councilmember Montgomery make a public apology.\n        3. Re-education. Require re-education by Councilmember Montgomery on the\n        principles of a democracy and citizen participation.\n        4. Accountability. Hold Councilmember Montgomery accountable to these\n        rehabilitation requirements.\n\n\nIn addition, please find the following attachments:\n\n\nLetters to the Editor.  Letters to the Editor of the Beach Reporter by Manhattan Beach residents expressing concerns related to Mr. Montgomery’s behavior and actions that strongly serve as the basis of my requests.  \nRehabilitation Resources.  Examples of resources available to Councilmember Montgomery to re-educate himself on the principles of a democracy and citizen participation including:\n\n\nA.  The International City/County Management Association (ICMA).  The ICMA offers online workshops and programs that focus on its identification of key competencies essential to local government management including leadership for building community cooperation and consensus. Their online conferences on public engagement and collaborative governance include:\n\n                                (1). Local Government Collaboration: Success Stories and Lessons \n                        Learned.\n                                (2). Turning Public Employee and Public Ideas into Big Savings and \n                                Increased Revenue\n                                (3). Engaging Citizens to Cut Budgets: How One City Cut $9.5 Million\n                                From the Budget in Just Two Months\n                            (4). Using Collaborative Leadership Skills to Improve Performance of\n                         Local Governments \n\nB. League of California Cities (LCC) and the Institute for Local\n\n\nGovernment (ILG).  A top priority of the LCC and its research and education affiliate, the ILG, is also public engagement and collaborative governance.  Among its resources are the following free publications:\n\n                                (1). Principles of Local Government Public Engagement\n                                (2). Beyond the Usuals: Ideas to Encourage Broader Public \n                                 Involvement in Your Community\n                                (3). Responding to Emotions and Conflicts in Public Hearings\n                                (4). Getting the Most Out of Public Hearings: A Guide to Improve \n                                Public Involvement\n\n\nGadfly “Misdirection”.  Among the Letters to the Editor I have cited is one that relates to a 2006 City Council decision involving undergrounding in which Councilmember Montgomery voted to accept $80,000 to the city from a group seeking council approval on a contested issue involving its desired departure from established city policies and practices.  In my view, it is an example of the “misdirection” tactics that Mr. Montgomery decries\n\nPositive Gadflies vs. Negative Gadflies.  At the last city council meeting, Mayor Montgomery defiantly reaffirmed his scourge of these gadflies.  However, he went on to argue that there are positive gadflies (those who provide constructive criticism) and negative gadflies (those who complain and criticize).  \n\nSince a gadfly, by definition, is a person who persistently annoys or stirs up others, we are left with Mr. Montgomery’s semantic challenge to decide by innuendos just who are these negative gadflies?  Are they our neighbors who wrote the letters in my list sharing their depth of concerns regarding Mr. Montgomery’s actions?  Not in my judgment.  \n\n“Do your homework,” Mr. Montgomery demands, lest he call you a gadfly.  But has he done his?  He pontificates but does not specify.  Request Mr. Montgomery to blazon out his list of negative gadflies and provide them an opportunity to come before your tribunal.  \n\nHe states “freedom of speech works both ways.”  That is true.  Therefore, give these so-called negative gadflies an opportunity to defend themselves against their “inaccurate statements,” “wild accusations,” and “outright lies.” Or, as he put it, “How’s that for equal justice!”  \n\nGet Your Facts Right!  Or else, Mr. Montgomery says, he will respond!  This leads to the essence of public service and the pride of being a public employee or an elected official.  Every day you are charged with the responsibility of confronting issues that deeply impact our lives—our livelihood, our homes, our safety, the education of our children, the care of our seniors—in sum, the quality of our existence.  \n\nBut not without a price, because we often come to you with opposing views based on deeply held value differences where if we “compromise” we feel we have “compromised” our integrity.  And, so our emotions erupt and do they erupt!  Not only directed at each other but also at you in the form of criticism and complaints.\n\nYet, getting us to “get our facts right” is harder than making simple pronouncements because our values filter our perception of the “facts.”  And, all the facts in the world cannot prove one value better than another, one belief better than another or one feeling better than another.  \n\nAs I state in my letter, “American democracy is built on forging divergent interests and values within our community into solutions that maximize our long-term viability.”  When President Kennedy said, “Ask not what your country can do for you, but what you can do for your country,” he was asking us to put aside our value differences for the common good.  That is the heart of great political leadership.\n\nOur Public Employees.  We are fortunate to have the finest city employees.  Every day, they too, face the pressures and challenges similar to those of elected officials.  However, as elected officials you set the standards.  \n\nThat being the case, do you want our city employees to adhere to Mr. Montgomery’s standards and condone the stereotyping and treatment of our residents as gadflies?  Are you willing to accept the employees’ defense of this characterization, “Well, if the Mayor can do it, why can’t we?”\n\nWe are also fortunate to live in a community with so many of our neighbors shaping the city’s soul and character by their outpouring of volunteerism, philanthropy, and concern for those in need.    \n\nIt is a critical time for our city.  “Times they are a-changing” and forging new directions to ensure our viability was never more challenging and never more in need of both compassionate and decisive leadership.  I wish you well.\n\nThank you for your service.\n\nI plan to raise further awareness by informing other residents and requesting assistance from the South Bay Council of Governments, the Independent Cities Association, and other community groups.  \n\nAm I doing the right thing?  Are there other steps I should take?  What should our new city manager do?\n\nThank you.\n\nEdward C. Caprielian, Ph.D.\n(310) 546-2345\necapriel@csulb.edu\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-01-2011"
    }
  ], 
  "answers_count": 7, 
  "author": "Martha Perego", 
  "id": 20198, 
  "score": "0", 
  "tags": [
    "Leadership", 
    "Elected Officials", 
    "Ethics", 
    "Management"
  ], 
  "text": "\n\nAdvice on how to deal with an elected official who seems not to understand their role and interferes with the city/county manager's role would be most helpful.  For example, what do you do when the elected official contacts vendors to inquire about the status of a project or makes demands about the work?  What do you do when an individual council member wants to be consulted or have input on personnel decisions that are the manager's responsibility? Do you discuss this privately with the individual? If that doesn't seem to work, do you notify the entire governing body? Ignore the situation?  Based on your experience, what approach seems most effective?\n\n", 
  "title": "Dealing with difficult elected officials", 
  "when": "09-07-2010"
}