{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nI have resigned for a new position, retired and now served twice as an Interim city manager and in all three circumstances had vacant executive positions that were to be filled..  In California the CM  does not appoint Boards and Commissions the city council has that duty.  Unless there was some overwhelming and compelling reason, I would not appoint a department head under any of these three conditions.  I have on one occasion felt those conditions existed and made an appointment.  The next manager needs to have that ability to hire the people they think will fit their needs, not mine.\n\n\nI have resigned for a new position, retired and now served twice as an Interim city manager and in all three circumstances had vacant executive positions that were to be filled..  In California the CM  does not appoint Boards and Commissions the city council has that duty.  Unless there was some overwhelming and compelling reason, I would not appoint a department head under any of these three conditions.  I have on one occasion felt those conditions existed and made an appointment.  The next manager needs to have that ability to hire the people they think will fit their needs, not mine.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-01-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Christopher Hayes", 
  "id": 22939, 
  "score": "0", 
  "tags": [
    "Elected Officials", 
    "Ethics", 
    "Form of Government"
  ], 
  "text": "\n\nDo resigning or interim Chief Administrative Officers commonly exercise their powers to appoint members to boards and commissions? Do councils commonly pass motions to request resigning/interim CAOs to not appoint members to boards and commissions?\nI am unfamiliar with common practice or accepted ethics regarding appointments during transitional periods. Would the length of transition affect whether it is \"acceptable\" to make appointments during a transition?\nThanks!\n\n", 
  "title": "Resigning/interim CAOs appointing boards and committees?", 
  "when": "25-01-2014"
}