{
  "answer_by": null, 
  "answers": [
    {
      "author": "Xavier Bishop", 
      "score": "0", 
      "text": "\n\nAnne, great forward thinking on the part of your council. Most small cities I've been involved with live pretty much \"paycheck to paycheck\" and therefore have not had the luxury of looking much beyond 2-3 years. Moreover, taking such a extended look at financials requires a long range view across several disciplines - from public safety, to public works and even human resources.  For small cities especially, having the time, manpower and discipline to achieve this is rare.  I applaude you and your council for being so forward looking.\n\n\nAnne, great forward thinking on the part of your council. Most small cities I've been involved with live pretty much \"paycheck to paycheck\" and therefore have not had the luxury of looking much beyond 2-3 years. Moreover, taking such a extended look at financials requires a long range view across several disciplines - from public safety, to public works and even human resources.  For small cities especially, having the time, manpower and discipline to achieve this is rare.  I applaude you and your council for being so forward looking.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-03-2012"
    }, 
    {
      "author": "Stephanie Klinkenberger", 
      "score": "0", 
      "text": "\n\nWhile our City Strategic plan is only outlined in paper until 2014 (http://tinyurl.com/7cefrda), our City is part of a foundation called Envision Virginia Beach 2040 (http://tinyurl.com/7s5yrbj) which is aimed at future visioning beyond the next couple of years.  Envision Virginia Beach is in its early phases, but Council has tasked this group with planning the next 30 years for our City.\n\n\nWhile our City Strategic plan is only outlined in paper until 2014 (http://tinyurl.com/7cefrda), our City is part of a foundation called Envision Virginia Beach 2040 (http://tinyurl.com/7s5yrbj) which is aimed at future visioning beyond the next couple of years.  Envision Virginia Beach is in its early phases, but Council has tasked this group with planning the next 30 years for our City.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-03-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Anne Carlson", 
  "id": 21714, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nLast night, our elected body, the Leesburg Town Council, had a truly strategic discussion about the financial future of the Town of Leesburg.  The most satisfying element was that a long-term projection (13-year) was used to illustrate the ordinary financial pressures facing the Town in a discussion before the public.  In an election year.  The projection showed that without some significant changes, the Town would be forced to raise taxes to cover operations and debt.  By looking at this now, we in the budget office believe the Town has a good chance of adjusting budgets and programs to meet the financial requirements ahead without drastic changes to the real estate tax (major revenue source) rate.\nI would like to know if there are other jurisdictions out there whose elected bodies have shared with their constituents projections of ten years or more as the basis for their budget process.\n\n", 
  "title": "Strategic Budgeting", 
  "when": "28-02-2012"
}