{
  "answer_by": null, 
  "answers": [
    {
      "author": "Thomas Miller", 
      "score": "0", 
      "text": "\n\nTom, Good question. There's nothing wrong with asking residents if local government is meeting or exceeding their expectations, but consider what you've got once you get the answer.  As local government resources hit bottom, it's understandable that any administrator would reconsider how much to promise.  In these tough times, maybe it is enough to meet or, if you're lucky, even exceed expectations.  And, indeed, expectations remain a part of how a citizen decides about the quality of a service - other parts include a resident's prior experience with the service, his/her background which influences how tough a grader he or she has become, reported service quality from trusted secondary sources, severity of the problem the service is solving and, thankfully, even actual service delivery itself.  \nBut meeting or exceeding expectations, even in tough times, may damn your considerable efforts with faint praise.  NRC conducts The National Citizen Survey and our research professionals - who also are former city employees - consider the gold standard of survey excellence to be a rating about excellence itself.  Here's an excerpt from a chapter we wrote about this very issue where we argued for the importance of absolute ratings of service quality – better, we think than ratings of \"satisfaction\" and, by extension, better than ratings that measure how well a service is delivered relative to \"expectations.\"\n\"Satisfaction: setting the bar too low\nThe temptation of some local governments is to test citizen opinion by asking about satisfaction. Borrowing from the private sector, they describe their citizen surveys as “customer satisfaction surveys.” But tests of “satisfaction” are not helpful for measuring performance in the public sector. Customer satisfaction is linked to expectations, and low expectations make for high satisfaction. Because most residents expect relatively little from local government having been influenced over many years to believe that government is inefficient, cumbersome, and inept even a rating of high satisfaction may be a low rating indeed. \nWhen local government customers are asked to report their “satisfaction,” they most often report being “very” or “somewhat” satisfied, but these ratings can mislead government stakeholders who are using them for performance monitoring. A citizen may report satisfaction with the quality of a service that is delivered poorly but better than the citizen expected. In effect, a poorly delivered public service may receive a rating of “somewhat satisfied” because the respondent has little hope of first-class service.\nSo ask about quality on an EGFP scale or use “very good” to “very bad” options or ratings of 1 to 10 or high to low but make it about clients’ perceptions of your quality, not about their satisfaction\"\nNRC, using The NCS data, has not seen a downturn in resident opinions about quality that economic privation would predict, so we think it's too soon to abandon asking the fundamental question about quality because residents, by and large, still appreciate the quality they are getting.\n\n\nTom, Good question. There's nothing wrong with asking residents if local government is meeting or exceeding their expectations, but consider what you've got once you get the answer.  As local government resources hit bottom, it's understandable that any administrator would reconsider how much to promise.  In these tough times, maybe it is enough to meet or, if you're lucky, even exceed expectations.  And, indeed, expectations remain a part of how a citizen decides about the quality of a service - other parts include a resident's prior experience with the service, his/her background which influences how tough a grader he or she has become, reported service quality from trusted secondary sources, severity of the problem the service is solving and, thankfully, even actual service delivery itself.  \n\nBut meeting or exceeding expectations, even in tough times, may damn your considerable efforts with faint praise.  NRC conducts The National Citizen Survey and our research professionals - who also are former city employees - consider the gold standard of survey excellence to be a rating about excellence itself.  Here's an excerpt from a chapter we wrote about this very issue where we argued for the importance of absolute ratings of service quality – better, we think than ratings of \"satisfaction\" and, by extension, better than ratings that measure how well a service is delivered relative to \"expectations.\"\n\n\"Satisfaction: setting the bar too low\nThe temptation of some local governments is to test citizen opinion by asking about satisfaction. Borrowing from the private sector, they describe their citizen surveys as “customer satisfaction surveys.” But tests of “satisfaction” are not helpful for measuring performance in the public sector. Customer satisfaction is linked to expectations, and low expectations make for high satisfaction. Because most residents expect relatively little from local government having been influenced over many years to believe that government is inefficient, cumbersome, and inept even a rating of high satisfaction may be a low rating indeed. \n\nWhen local government customers are asked to report their “satisfaction,” they most often report being “very” or “somewhat” satisfied, but these ratings can mislead government stakeholders who are using them for performance monitoring. A citizen may report satisfaction with the quality of a service that is delivered poorly but better than the citizen expected. In effect, a poorly delivered public service may receive a rating of “somewhat satisfied” because the respondent has little hope of first-class service.\n\nSo ask about quality on an EGFP scale or use “very good” to “very bad” options or ratings of 1 to 10 or high to low but make it about clients’ perceptions of your quality, not about their satisfaction\"\n\nNRC, using The NCS data, has not seen a downturn in resident opinions about quality that economic privation would predict, so we think it's too soon to abandon asking the fundamental question about quality because residents, by and large, still appreciate the quality they are getting.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-05-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Tom Nosack", 
  "id": 21013, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nThe new realities of cities operating more like businesses, embracing lean processes and continuous improvement while being resource constrained like no other time in the past....is making us question everything. \nOur community survey is an example: we have been running roughly parallel to the NCS with ICMA in many ways, but also using other benchmark opportunities (most notably the ETC Institute's DirectionFinder). Neither of them really address this question: Should we change the focus of asking residents and customers about services in absolute terms (how satisfied are you on a scale of etc..) and ask them how well our services are meeting THEIR EXPECTATIONS?\nI am really primarily focused on simply meeting the community's expectations (if possible) with the current budget - which means I need to know what the gap is between what we are doing and what they expect - and either provide more service or manage their expectations better. (or both)\nIt is a new world and this may be heresy, but that is what I think we need to do. Bellevue WA is already asking this type of question instead of absolutes, and it seems to resonate well with their community. Shoudl we all be going there?\nTom\n\n", 
  "title": "Change entire focus of Community Survey?", 
  "when": "05-05-2011"
}