{
  "answer_by": null, 
  "answers": [
    {
      "author": "Matthew Fore", 
      "score": "0", 
      "text": "\n\nWe looked into several options for increasing organics recycling. For home use, our collection agreement requires the waste hauling company to offer home composting bins at cost. However, for large-scale organics/food waste composting, I would recommend building this service into the curbside collection agreement. Food waste collection is often stymied by high levels of contamination that should be left to the hauler and ultimate processor to remedy. Our concern from a nuisance standpoint is that leaving composting to each resident, rather than removing from the curbside/property on a weekly basis, would invite flies, rodents and odors. The City of San Francisco has the most robust food waste collection program of which I am aware. The City's food waste is transported to adjacent Solano County, to the Jepsem Prarie Composting Facility.\nI just completed the new collection contract for Monterey County. While we do not yet have sufficient processing capacity for county-wide collection, we did build food waste collection into the agreement and will amend the contract once the processing location is known.\n\n\nWe looked into several options for increasing organics recycling. For home use, our collection agreement requires the waste hauling company to offer home composting bins at cost. However, for large-scale organics/food waste composting, I would recommend building this service into the curbside collection agreement. Food waste collection is often stymied by high levels of contamination that should be left to the hauler and ultimate processor to remedy. Our concern from a nuisance standpoint is that leaving composting to each resident, rather than removing from the curbside/property on a weekly basis, would invite flies, rodents and odors. The City of San Francisco has the most robust food waste collection program of which I am aware. The City's food waste is transported to adjacent Solano County, to the Jepsem Prarie Composting Facility.\n\nI just completed the new collection contract for Monterey County. While we do not yet have sufficient processing capacity for county-wide collection, we did build food waste collection into the agreement and will amend the contract once the processing location is known.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-09-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Brian Halverson", 
  "id": 20363, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nThe City of San Antonio is in the planning phase of a new \"Yard Waste Program,\" and we are currently looking into several different options.  \nOne such option would be a program that gets residents to mulch and compost yard waste (and appropriate food waste) in their back yards.  \nThe idea is to avoid creating a costly and polluting collection scheme, while at the same time significantly reducing the amount of yard and food waste that ends up in a landfill.\nDoes anyone have/know of examples of such programs that have been effective in promoting home composting on a large scale?\n\n", 
  "title": "Yard Waste Recycling", 
  "when": "31-08-2010"
}