{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Garvison", 
      "score": "0", 
      "text": "\n\nFrom my experience, if you have a presence on any social media or networking site that is official to your jurisdiction you have to be able to quickly respond to comments, questions, etc from other users. Having a presence that is not maintained is worse than having no presence at all.\nAs for your 2nd paragraph, if you do not use it as an alternative for 311, then why have the site? Remember, the social media outlets are to reach the segments of our communities that might not be reached by the traditional formats. I always remembered that, otherwise why would you use these social media sites if you are not going to put the resources into doing it right?\nThe City of Portland uses their Twitter feed and an Iphone app for its citizens to report potholes and the response has been better than the old method of leaving a message on someone's voicemail and maybe getting a response three weeks later.\nLike I said, the only warning is if you say or intimate you are going to do something in an alternative media outlet such as twitter, facebook, you better do exaclty what you say.\n\n\nFrom my experience, if you have a presence on any social media or networking site that is official to your jurisdiction you have to be able to quickly respond to comments, questions, etc from other users. Having a presence that is not maintained is worse than having no presence at all.\n\nAs for your 2nd paragraph, if you do not use it as an alternative for 311, then why have the site? Remember, the social media outlets are to reach the segments of our communities that might not be reached by the traditional formats. I always remembered that, otherwise why would you use these social media sites if you are not going to put the resources into doing it right?\n\nThe City of Portland uses their Twitter feed and an Iphone app for its citizens to report potholes and the response has been better than the old method of leaving a message on someone's voicemail and maybe getting a response three weeks later.\n\nLike I said, the only warning is if you say or intimate you are going to do something in an alternative media outlet such as twitter, facebook, you better do exaclty what you say.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-08-2010"
    }, 
    {
      "author": "April Jaeger", 
      "score": "0", 
      "text": "\n\nI agree with John G. If  you say you will do it, then do it; if you say you won't, then don't.   \nContinue to \"resist\" the dark side... the day you start \"officially\" responding on the SCF site is the day that you become responsible for maintaining that communication venue and ensuring that that there is no offensive content on the site regardless of if it is related to the County or not.  I don't know much about SCF, but my opinion is if you can't control it, don't officially use it.\nIn Great Bend, we only follow up on information that is submitted via the official venues (though we may unofficially check out a recurring issue that pops up on the Chamber or CVB site).  Our policy is that we do not provide blogging, tweeting, or wall comments on any of the City sites to non-employees, except for the zoo. We know that is it is not a user friendly attitude, but like you, we do not have the FTEs to monitor the sites.  We believe that if we respond to one and not another we've lost any defensible status of process for potential law suits and we could appear to be non-responsive to the citizens. Additionally, every outgoing message from any social media from the city directs users back to the city's official site, or to an email and phone number.   The zoo is excluded because we have volunteers that are willing to monitor it on a daily basis. We believe we are still accessible to our public, because anyone who can tweet can either text, email, or call.\n\n\nI agree with John G. If  you say you will do it, then do it; if you say you won't, then don't.   \n\nContinue to \"resist\" the dark side... the day you start \"officially\" responding on the SCF site is the day that you become responsible for maintaining that communication venue and ensuring that that there is no offensive content on the site regardless of if it is related to the County or not.  I don't know much about SCF, but my opinion is if you can't control it, don't officially use it.\n\nIn Great Bend, we only follow up on information that is submitted via the official venues (though we may unofficially check out a recurring issue that pops up on the Chamber or CVB site).  Our policy is that we do not provide blogging, tweeting, or wall comments on any of the City sites to non-employees, except for the zoo. We know that is it is not a user friendly attitude, but like you, we do not have the FTEs to monitor the sites.  We believe that if we respond to one and not another we've lost any defensible status of process for potential law suits and we could appear to be non-responsive to the citizens. Additionally, every outgoing message from any social media from the city directs users back to the city's official site, or to an email and phone number.   The zoo is excluded because we have volunteers that are willing to monitor it on a daily basis. We believe we are still accessible to our public, because anyone who can tweet can either text, email, or call.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-08-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "David Morrison", 
  "id": 20317, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nGood Afternoon, \nThe topic of the week in my office centers around www.seeclickfix.com (SCF), which may qualify as social media, though I think of it as an old style Internet forum with some bells and whistles.  I am mainly looking for other jurisdictions to share how they respond to requests submitted passively through SCF, Facebook, Twitter, etc.\nI realize that some jurisdictions have partnered with the website, but we have not taken that step to date, and are trying to figure out what our policy should be on engaging the site, and participating in sometimes random discussions at an official capacity.  We do not have the FTEs to support this, and this is just one site.  What happens when a rival site starts up?\nWe currently monitor the site for issues that our department can address (potholes, broken signs, etc.), and enter the complaints into our management system, but without name or contact information, have resisted in providing an official response. We do not want to create the impression that this website is a substitute for 311 or contacting the County directly via our webpages, email or phone.\n\n", 
  "title": "Official Interaction with Social Media", 
  "when": "13-08-2010"
}