{
  "answer_by": null, 
  "answers": [
    {
      "author": "Gregory Crocker", 
      "score": "0", 
      "text": "\n\nJeff,  I posed your question to a co-worker here who primarily deals with electric utilities and I will share his answer: \nMuscatine Power and water sells steam to an industrial facility.  The Iowa State University power plant produces electricity, steam for heating, and chilled water for air conditioning.\nI guess Barron County needs to compare the cost they are charging for steam to the cost that the cheese plant could produce steam on their own for.  The low cost of natural gas is probably causing this problem.\nJoel Logan\nIowa Association of Municipal Utilities\nIf you'd like to ask any follow-up questions, his e-mail address is JLogan@iamu\n\n\nJeff,  I posed your question to a co-worker here who primarily deals with electric utilities and I will share his answer: \n\nMuscatine Power and water sells steam to an industrial facility.  The Iowa State University power plant produces electricity, steam for heating, and chilled water for air conditioning.\n\nI guess Barron County needs to compare the cost they are charging for steam to the cost that the cheese plant could produce steam on their own for.  The low cost of natural gas is probably causing this problem.\n\nJoel Logan\nIowa Association of Municipal Utilities\n\nIf you'd like to ask any follow-up questions, his e-mail address is JLogan@iamu\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-03-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Jeffrey French", 
  "id": 22469, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Water & Sanitation", 
    "Environment", 
    "Finance and Budgeting", 
    "Sustainability", 
    "Utilities", 
    "Contracts"
  ], 
  "text": "\n\nBarron County owns a Waste to Energy Plant which burns garbage and converss this energy to steam.  The steam generated is first used to provide steam to a nearby cheese plant, any residual steam is used to generate electricity.  Steam sold to the cheese plant brings in about double the revenue that electricity sales does.  Now however, the cheese plant is \"balking\" at paying the agreed upon steam sales rate and essentially demanding a reduction in price.  \nMy question is has any other municipality faced a similar situation and what did you do to attract another steam user?  I'm looking for ideas, thought process on how to create some competition? \nThank you.\nemail address - jeff.french@co. barron.wi.us\n\n", 
  "title": "Waste to Energy Plants and Steam Sales", 
  "when": "12-03-2013"
}