{
  "answer_by": null, 
  "answers": [
    {
      "author": "William Emerson", 
      "score": "0", 
      "text": "\n\nOur contract with the county sheriff also uses geography.  We pay for the officers in town, less for officers in the vicinity of town, and even less for officers in the region providing coverage of low risk shifts.  We have a lieutenant who acts as our police chief and provides quarterly reports to Council.  This system avoids over-concentration, but maintains good call times, low cost, tremendous emergency response, local presence, and local control.\n\n\nOur contract with the county sheriff also uses geography.  We pay for the officers in town, less for officers in the vicinity of town, and even less for officers in the region providing coverage of low risk shifts.  We have a lieutenant who acts as our police chief and provides quarterly reports to Council.  This system avoids over-concentration, but maintains good call times, low cost, tremendous emergency response, local presence, and local control.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-07-2010"
    }, 
    {
      "author": "William Emerson", 
      "score": "0", 
      "text": "\n\nThat is, on an FTE basis, with a sliding scale keyed to proximity.\n\n\nThat is, on an FTE basis, with a sliding scale keyed to proximity.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-07-2010"
    }, 
    {
      "author": "Thomas Wieczorek", 
      "score": "0", 
      "text": "\n\nICMA Consulting Services often sees costs associated with calls for service or geographic size.\nThe most effective way to determine costs is analyzing the raw data contained in the agency's Computer Aided Dispatch (CAD) system. By extracting the data from CAD, a community can determine the amount of time that is spent in various areas by tying that data to geographic points with a GIS information system.\nNot all calls are created equal; a homicide will require considerably more time than will a bike larceny. By tracking the time spent, a more accurate picture of the costs can be provided. It is one other tool to minimize disagreements that may occur over assignment of costs. \nThis type of analysis requires that officers call out the time that they are assigned to various tasks as well as the location. It also requires that supervision maintain control so that units do not all congregate when calls are received but, instead, remain in the sector to which they have been assigned.  Most fire departments do not utilize the radio for things like training, inspections, station assignments and other duties so a clear picture of the amount and distribution of time cannot be created without great effort. By making these changes in the data collection center -- dispatch -- the costing of service becomes much more accurate.\n\n\nICMA Consulting Services often sees costs associated with calls for service or geographic size.\n\nThe most effective way to determine costs is analyzing the raw data contained in the agency's Computer Aided Dispatch (CAD) system. By extracting the data from CAD, a community can determine the amount of time that is spent in various areas by tying that data to geographic points with a GIS information system.\n\nNot all calls are created equal; a homicide will require considerably more time than will a bike larceny. By tracking the time spent, a more accurate picture of the costs can be provided. It is one other tool to minimize disagreements that may occur over assignment of costs. \n\nThis type of analysis requires that officers call out the time that they are assigned to various tasks as well as the location. It also requires that supervision maintain control so that units do not all congregate when calls are received but, instead, remain in the sector to which they have been assigned.  Most fire departments do not utilize the radio for things like training, inspections, station assignments and other duties so a clear picture of the amount and distribution of time cannot be created without great effort. By making these changes in the data collection center -- dispatch -- the costing of service becomes much more accurate.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-08-2010"
    }
  ], 
  "answers_count": 3, 
  "author": "Michael Edwards", 
  "id": 20216, 
  "score": "1", 
  "tags": [
    "Contracts", 
    "Finance and Budgeting", 
    "Police", 
    "Public Safety"
  ], 
  "text": "\n\nWe provide contract Police and Fire services to our local university after absorbing their police department in a merger several years ago.  We are looking to improve how the cost of the services is measured, and are interested in finding out how other municipalities determine what to charge for contracted public safety services.  We already have a comprehensive model for capturing overhead costs within our organization, and are able to calculate a cost allocation using either geographic area, CAD call volume, or a blend of the two, as they result in very different costs.  Our current contract is based upon the number of officers they have requested be stationed on campus (which are primarily those officers we have absorbed), although we are desirous of getting away from this method as we feel it results too much manpower being concentrated in the campus area.  We also are able to bill directly for special events (like football games or frat parties), so that is dealt with as a separate issue.  Does anyone have any experience in costing police or fire services that could offer advice on how those pricing decisions are made?\nThanks!\n\n", 
  "title": "Contracted Police and Fire Services", 
  "when": "15-07-2010"
}