{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHey there, In this 2010 question (http://icma.org/en/icma/knowledge_network/kn/Question/20379), we heard about how decisions on outsourcing are handled in the City of Tifton, GA.  You may want to consider the Effectiveness and Efficiency Committee model that they employ. I hope this gives you something new to consider.\n\n\nHey there, In this 2010 question (http://icma.org/en/icma/knowledge_network/kn/Question/20379), we heard about how decisions on outsourcing are handled in the City of Tifton, GA.  You may want to consider the Effectiveness and Efficiency Committee model that they employ. I hope this gives you something new to consider.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-08-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "[Anonymous]", 
  "id": 22695, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting", 
    "Technology", 
    "Service Delivery"
  ], 
  "text": "\n\nWe are evaluating the cost/benefit of outsourcing our Payroll and HR systems and related administrative support work.   We are a City with 1600 employees and over 50% of our employees are represented by numerous bargaining units.   I would be interested in hearing what other Cities (particularly any of comparable size- but not limited to that) have learned from conducting a similar evaluation; and from those that have outsourced- what the outcome has been.   I would be interested in hearing about successes, challenges and outright failures so that we can make a thoughtful and informed decision.   We currently outsource management of  our health and welfare benefits successfully but have realized that the system cost of supporting these function with a workforce of 1600 just doesn't provide the economies of scale that we think an outsourcer could gain.  But...we recognize that there is likely a trade off in service, etc.\nFor those that have done this successfully- have you measured the actual savings/benefits?\nFor those that have not been successful- why do you think it didn't work?\nFor those that evaluated and decided not to outsource- what was the driver for the decision?\n\n", 
  "title": "Payroll/HR Outsourcing", 
  "when": "16-08-2013"
}