{
  "answer_by": null, 
  "answers": [
    {
      "author": "Cory Fleming", 
      "score": "1", 
      "text": "\n\nHi Malissa,\nI've asked a couple of my colleagues in 311 to respond to your question, but thought I'd also give it a shot.  Most jurisdictions with 311 centers institute service level agreements (SLAs) with the participating departments, i.e., 72 hours to fix a pothole.  The SLAs are determined with the department based on staff's expert knowledge of what labor and resources are required to respond to a request.  If a department isn't meeting those goals 90-95% of the time, that becomes a trigger to look more closely at why the department isn't completing tasks within the SLA:  lack of staff, problems with equipment, scheduling issues, etc., and what needs to be done to correct that situation.\nSLAs aren't intended to be carved in stone.  After a brutal winter, it's going to take more time to fix potholes and the SLAs can be adjusted for such circumstances. But they do help manage the public's expectations of when their service requests will be addressed.\nYour organization will likely have more phone calls and other connections with the public as the result of having a 311 center, but you will also be able to demonstrate that you have a pro-active and responsive system in place to address those service requests in a timely fashion.  From a liability standpoint, I think that would serve you better than having no system.\n\n\nHi Malissa,\n\nI've asked a couple of my colleagues in 311 to respond to your question, but thought I'd also give it a shot.  Most jurisdictions with 311 centers institute service level agreements (SLAs) with the participating departments, i.e., 72 hours to fix a pothole.  The SLAs are determined with the department based on staff's expert knowledge of what labor and resources are required to respond to a request.  If a department isn't meeting those goals 90-95% of the time, that becomes a trigger to look more closely at why the department isn't completing tasks within the SLA:  lack of staff, problems with equipment, scheduling issues, etc., and what needs to be done to correct that situation.\n\nSLAs aren't intended to be carved in stone.  After a brutal winter, it's going to take more time to fix potholes and the SLAs can be adjusted for such circumstances. But they do help manage the public's expectations of when their service requests will be addressed.\n\nYour organization will likely have more phone calls and other connections with the public as the result of having a 311 center, but you will also be able to demonstrate that you have a pro-active and responsive system in place to address those service requests in a timely fashion.  From a liability standpoint, I think that would serve you better than having no system.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-09-2014"
    }, 
    {
      "author": "Jesse Himes", 
      "score": "0", 
      "text": "\n\nHi Malissa,\nThat’s a very unique question. Under the ICMA Center for Sustainable Communities project section I was able to find a resource list of over two dozen resources ranging from 311 software to community engagement.\nhttp://icma.org/en/results/sustainable_communities/projects/311/resource_list\nI’m sure there is something there that you will find useful. I hope this helps!\nJesse Himes, Knowledge Network Intern, jhimes@icma.org\n\n\nHi Malissa,\nThat’s a very unique question. Under the ICMA Center for Sustainable Communities project section I was able to find a resource list of over two dozen resources ranging from 311 software to community engagement.\nhttp://icma.org/en/results/sustainable_communities/projects/311/resource_list\nI’m sure there is something there that you will find useful. I hope this helps!\nJesse Himes, Knowledge Network Intern, jhimes@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-09-2014"
    }, 
    {
      "author": "DJ Russell", 
      "score": "0", 
      "text": "\n\nHi Malissa,\nI have worked with two 311 centers, first in Hampton, Virginia for 12 years and for the last 2 years, implementing and running the center for Newport News, Virginia.  Both cities understand that there is significant value in giving citizens a way to report small issues before they become huge.  \nI understand your concerns but there are many things that cities can do once they know about a pothole.  They can temporarily fill it with gravel or place cones around it so drivers will not hit it, until they can come out to permanently fill it.  The other issue is that a permanent fix cannot be applied if temperatures are too low, so whatever they do in winter would be a temporary fix anyway.\nCory is correct that one of the keys is to establish a time frame for repair.  The other great thing about 311 is that we can ask questions that help the departments prioritize repairs, based on severity or location.  If a citizen says that the pothole is greater than 12 inches or is located in the middle of a very busy street (as opposed to a smaller pothole or one on a less traveled road), Streets can address those potholes that need urgent attention first, thereby decreasing liability.  We spend considerable time with a department before taking their calls so we understand their processes and know which questions are important.  The other benefit is that by taking their calls, we let the departments focus more of their resources on responding to potholes rather than taking phone calls.  Our software also flags duplicates so that rather than responding to 50 reports of one pothole (at this corner, near this house, in the middle of this road), they get one request, thereby focusing their resources on the one true pothole repair needed.\n311 creates relationships in the community so that potholes can be reported early before they become massive.  Our city actually encouraged citizens to call in to report potholes after our unusually snowy winter.  We put it on our opening recording and the media let citizens know where to report potholes.  Again, the thought process is to repair them before they become significant liability issues.\nI hope this helps clarify how 311 works and why citizens love having a place to call to get information or to report problems.  Citizens are increasingly demanding a better way to interact with their government so that they can provide input and get information they need to be good citizens.  311 provides both of these benefits.\n\n\nHi Malissa,\n\nI have worked with two 311 centers, first in Hampton, Virginia for 12 years and for the last 2 years, implementing and running the center for Newport News, Virginia.  Both cities understand that there is significant value in giving citizens a way to report small issues before they become huge.  \n\nI understand your concerns but there are many things that cities can do once they know about a pothole.  They can temporarily fill it with gravel or place cones around it so drivers will not hit it, until they can come out to permanently fill it.  The other issue is that a permanent fix cannot be applied if temperatures are too low, so whatever they do in winter would be a temporary fix anyway.\n\nCory is correct that one of the keys is to establish a time frame for repair.  The other great thing about 311 is that we can ask questions that help the departments prioritize repairs, based on severity or location.  If a citizen says that the pothole is greater than 12 inches or is located in the middle of a very busy street (as opposed to a smaller pothole or one on a less traveled road), Streets can address those potholes that need urgent attention first, thereby decreasing liability.  We spend considerable time with a department before taking their calls so we understand their processes and know which questions are important.  The other benefit is that by taking their calls, we let the departments focus more of their resources on responding to potholes rather than taking phone calls.  Our software also flags duplicates so that rather than responding to 50 reports of one pothole (at this corner, near this house, in the middle of this road), they get one request, thereby focusing their resources on the one true pothole repair needed.\n\n311 creates relationships in the community so that potholes can be reported early before they become massive.  Our city actually encouraged citizens to call in to report potholes after our unusually snowy winter.  We put it on our opening recording and the media let citizens know where to report potholes.  Again, the thought process is to repair them before they become significant liability issues.\n\nI hope this helps clarify how 311 works and why citizens love having a place to call to get information or to report problems.  Citizens are increasingly demanding a better way to interact with their government so that they can provide input and get information they need to be good citizens.  311 provides both of these benefits.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-09-2014"
    }
  ], 
  "answers_count": 3, 
  "author": "Malissa Kaping", 
  "id": 23299, 
  "score": "0", 
  "tags": [
    "311/CRM Systems"
  ], 
  "text": "\n\nWe are in the early stages of considering implementing 311. There have been some questions regarding increased liability by opening another reporting portal by implementing 311. The thought is that we are opening ourselves up for more claims from persons who allegedly experienced an injury or damage to property as a result of the condition that had been reported. \nFor example, someone takes a photo and reports a minor pothole.  The City now has notice that a problem exists but due to resources and workload we don’t immediately repair (we, along with most cities, do not have the capacity to be lightning fast responsive). Then, two weeks later someone hits the pothole and alleges it knocked their car out of alignment and they tender a claim to the City for repair costs.  When claims for property damage come to us, we sometimes have available to us the defense of sovereign immunity and lack of constructive notice of the dangerous condition. That is, we can’t be held liable for a situation we didn’t know existed that may have caused a problem.  It could be argued that a 311 system might increase the amount of reporting and correspondingly, the amount of noticing we receive. \nWhat are your thoughts?\n\n", 
  "title": "Does 311 increase a City's liability risk?", 
  "when": "29-08-2014"
}