{
  "answer_by": null, 
  "answers": [
    {
      "author": "Michael Lehman", 
      "score": "0", 
      "text": "\n\nHi Meryl, I'm a past planning board member for St. Pete Beach in Florida, which is why I'm a member here, and I own an art consulting company. Depending on scope, the plans we've produced have averaged in the $30,000 - $50,000 range. I can share some sample RFP's if you like, my email is michael@bobosart.com. This is not a side-door solicitation, so no obligation inferred. Generally, plans work best when they not only identify opportunities for public art, but detail operational and funding strategies that include achievable action strategies that fit your particular culture and align with your capabilities. I hope all works well for you, art done well adds value in a number of measurable ways.\n\n\nHi Meryl, I'm a past planning board member for St. Pete Beach in Florida, which is why I'm a member here, and I own an art consulting company. Depending on scope, the plans we've produced have averaged in the $30,000 - $50,000 range. I can share some sample RFP's if you like, my email is michael@bobosart.com. This is not a side-door solicitation, so no obligation inferred. Generally, plans work best when they not only identify opportunities for public art, but detail operational and funding strategies that include achievable action strategies that fit your particular culture and align with your capabilities. I hope all works well for you, art done well adds value in a number of measurable ways.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-08-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Meryl Dye", 
  "id": 22702, 
  "score": "0", 
  "tags": [
    "Local Culture"
  ], 
  "text": "\n\nI'm trying to get an idea of the cost of hiring a consultanting firm to develop a public art master plan, one that includes a citizen engagement piece.  If your community has hired such a consultant in the last 3 years, I would appreciate hearing from you.  Also, it would be helpful if you can share a copy of your RFQ and the master plan (if this is final).  Thanks.\n\n", 
  "title": "Consultant Fee for Public Art Master Plan", 
  "when": "20-08-2013"
}