{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jared Cobb", 
      "score": "1", 
      "text": "\n\nMentoring a potential successor is considered good practice. The governing body makes the final decision, but I'm sure they would appreciate the manager being proactive and at least preparing someone to handle the duties of interim city manager, if not the permanent position.\nSome communities hire the new manager as an assistant before the current one retires. This provides an opportunity for him/her to gain an understanding of the community and ongoing projects before taking the manager position.\n\n\nMentoring a potential successor is considered good practice. The governing body makes the final decision, but I'm sure they would appreciate the manager being proactive and at least preparing someone to handle the duties of interim city manager, if not the permanent position.\n\nSome communities hire the new manager as an assistant before the current one retires. This provides an opportunity for him/her to gain an understanding of the community and ongoing projects before taking the manager position.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-09-2013"
    }, 
    {
      "author": "Alan Bergren", 
      "score": "0", 
      "text": "\n\nThe process needs to be an open competitive process, where someone, such as an assistant from within, as well as qualified individuals from outside the organization compete for the job. No retiring manager should presume to designate their successor. If they mentored their assistant well, then the assistant may do very well in the open competitive process. The manager who is retiring can help the Council in the process by assisting them in hiring a professional third party to administer the manager recruitment/selection process.  The manager may also have designated someone on a regular basis to serve as acting manager when they are out of town so the position can be covered during the interval after the current manager retires while the search process proceeds.\n\n\nThe process needs to be an open competitive process, where someone, such as an assistant from within, as well as qualified individuals from outside the organization compete for the job. No retiring manager should presume to designate their successor. If they mentored their assistant well, then the assistant may do very well in the open competitive process. The manager who is retiring can help the Council in the process by assisting them in hiring a professional third party to administer the manager recruitment/selection process.  The manager may also have designated someone on a regular basis to serve as acting manager when they are out of town so the position can be covered during the interval after the current manager retires while the search process proceeds.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-10-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 22728, 
  "score": "0", 
  "tags": [
    "Ethics", 
    "Form of Government", 
    "Codes of Ethics"
  ], 
  "text": "\n\nI recently read about a local City Manager designating his/her successor upon retirement, subject, of course, to approval by the governing body.  The jurisdication is a Council-Manager form of government.  The City Manager has served for many years and has recently tapped two department heads to compete for his/her position upon his/her retirement.  The local paper has widely covered the process as the City Manager choosing his/her successor.  I find nothing explicit in the ICMA Code of Ethics that precludes the practice.  However, I have always found this practice to be frownded upon within the profession.  Most managers I have worked with would never presume to participate in the process of recruitment for their replacement, regardless of retirement.\n\n", 
  "title": "City Manager", 
  "when": "11-09-2013"
}