{
  "answer_by": "15-11-2011", 
  "answers": [
    {
      "author": "Brent Eichelberger", 
      "score": "0", 
      "text": "\n\nYou may try contacting Port Barrington Illinois. \nFrom Wikipedia - \"Port Barrington is a village in Lake and McHenry Counties in the U.S. state of Illinois. It was formerly known as Fox River Valley Gardens. Fox River Valley Gardens' village board voted 4-3 in September 2002 to change the community's long-winded name to Port Barrington. Supporters said they hoped the name change would boost property values by associating it with other nearby Barrington area communities.\"\nEdited excerpts from the December 2002 issue of Governing - \"If your town's new slogan isn't working, how about changing the town's name? The village trustees of Fox River Valley Gardens, Illinois, recently voted to change their community's name to Port Barrington. They didn't exactly pick the new name out of thin air. They named it after Barrington, 12 miles away, a somewhat larger and more desirable community. How desirable? Barrington has been around since 1865, but beginning in 1957 other villages nearby incorporated and began using the Barrington name. Hence, we now have South Barrington, Barrington Hills, North Barrington, Lake Barrington and, if the state agrees to the name change, Port Barrington. \"At one point a resident said we should have copyrighted the name,\" says Barrington's village manager, \"then we could get royalties.\"\n\n\nYou may try contacting Port Barrington Illinois. \n\nFrom Wikipedia - \"Port Barrington is a village in Lake and McHenry Counties in the U.S. state of Illinois. It was formerly known as Fox River Valley Gardens. Fox River Valley Gardens' village board voted 4-3 in September 2002 to change the community's long-winded name to Port Barrington. Supporters said they hoped the name change would boost property values by associating it with other nearby Barrington area communities.\"\n\nEdited excerpts from the December 2002 issue of Governing - \"If your town's new slogan isn't working, how about changing the town's name? The village trustees of Fox River Valley Gardens, Illinois, recently voted to change their community's name to Port Barrington. They didn't exactly pick the new name out of thin air. They named it after Barrington, 12 miles away, a somewhat larger and more desirable community. How desirable? Barrington has been around since 1865, but beginning in 1957 other villages nearby incorporated and began using the Barrington name. Hence, we now have South Barrington, Barrington Hills, North Barrington, Lake Barrington and, if the state agrees to the name change, Port Barrington. \"At one point a resident said we should have copyrighted the name,\" says Barrington's village manager, \"then we could get royalties.\"\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Heidi Moegerle", 
  "id": 21411, 
  "score": "0", 
  "tags": [
    "Economic Development"
  ], 
  "text": "\n\nI am interested in learning if any city has successfully renamed itself as a part of a recent marketing plan. \nWhat were the costs, benefits and pitfalls?\nHow was the renaming process begun?  What fact/issue started the process?   What was the process?  What was the cost?  How large was the city?  How receptive were residents to the change?   What type of meetings were held with residents to engage them in the process and gauge response to the renaming suggestion.\nWhat was the political response to the suggestion of the name change?  How was that response managed?  Did the name change actually occur?  Why or why not?\nDid the symbolic name change result in an actual change in the community?  Were the changes expected or unexpected?  In hindsight, was the name change successful?  Was the process valuable?  What should have been done differently?\n\n", 
  "title": "Renaming a City as Part of Economic Development/Marketing Plan", 
  "when": "11-10-2011"
}