{
  "answer_by": null, 
  "answers": [
    {
      "author": "Mark Abeles-Allison", 
      "score": "0", 
      "text": "\n\nIt is good that you are asking this question.  I think it is our job as professionals to assist elected officials in any way we can.  It sounds like you have ample information going out, I think you have to acknowledge that it is impossible to stay up to date on all issues.  That may mean that every agenda item has an explanation that precedes it that highlights the issues.    \nI do have a couple of other questions for you.  Does the council think there is an issue?  You mentioned that they favored \"short\" meetings (less than 3 hours).  Do they take staff advice and recommendations.  Perhaps they trust your advice and recommendations and are comfortable enough to not do all the legwork on issues but instead listen to and usually follow your suggestions?\nBy the way, 3 hours is a long meeting in my book.\n\n\nIt is good that you are asking this question.  I think it is our job as professionals to assist elected officials in any way we can.  It sounds like you have ample information going out, I think you have to acknowledge that it is impossible to stay up to date on all issues.  That may mean that every agenda item has an explanation that precedes it that highlights the issues.    \n\nI do have a couple of other questions for you.  Does the council think there is an issue?  You mentioned that they favored \"short\" meetings (less than 3 hours).  Do they take staff advice and recommendations.  Perhaps they trust your advice and recommendations and are comfortable enough to not do all the legwork on issues but instead listen to and usually follow your suggestions?\n\nBy the way, 3 hours is a long meeting in my book.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-08-2013"
    }, 
    {
      "author": "Tom Homan", 
      "score": "0", 
      "text": "\n\nKeeepimg the Council abreast of issues is crticial and one way we do this is through a weekly update on issues/events/projects that is developed by our PIO. In addtion to this, I provide them with updates that normally coincide with council packets. I also contact each member individually on the day of a council meeting to ask them if they have questions regarding the agenda. This gives them and me an opportunity to find out if there are quesiotns/issues I should be aware of before the metting. Our Council likes to keep meetings to less than 2 hours. I've found that after 2.5 hours, attention spans fade and keeeping all engaged is difficult.\n\n\nKeeepimg the Council abreast of issues is crticial and one way we do this is through a weekly update on issues/events/projects that is developed by our PIO. In addtion to this, I provide them with updates that normally coincide with council packets. I also contact each member individually on the day of a council meeting to ask them if they have questions regarding the agenda. This gives them and me an opportunity to find out if there are quesiotns/issues I should be aware of before the metting. Our Council likes to keep meetings to less than 2 hours. I've found that after 2.5 hours, attention spans fade and keeeping all engaged is difficult.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-11-2013"
    }, 
    {
      "author": "Mindy Manson", 
      "score": "0", 
      "text": "\n\nEvery Friday, we prepare a weekly report with updates from each Department that include a brief summary of the week's activities and a look forward to the next week or two. The weekly report does not include routine activities to keep it from being repititious but does cover updates on projects, issues, and things out of the ordinary.  In addition to that, the day before each Council meeting, I prepare an executive summary of the agenda which includes a 2 - 3 sentence summary of each agenda item which is sent out via email.  I try not to inundate the Council with emails on smaller things (we save those for the weekly report unless it is time sentitive) with the promise to them that the emails that they do receive contain information that they need to read.\n\n\nEvery Friday, we prepare a weekly report with updates from each Department that include a brief summary of the week's activities and a look forward to the next week or two. The weekly report does not include routine activities to keep it from being repititious but does cover updates on projects, issues, and things out of the ordinary.  In addition to that, the day before each Council meeting, I prepare an executive summary of the agenda which includes a 2 - 3 sentence summary of each agenda item which is sent out via email.  I try not to inundate the Council with emails on smaller things (we save those for the weekly report unless it is time sentitive) with the promise to them that the emails that they do receive contain information that they need to read.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-11-2013"
    }
  ], 
  "answers_count": 3, 
  "author": "[Anonymous]", 
  "id": 22658, 
  "score": "0", 
  "tags": [
    "Elected Officials"
  ], 
  "text": "\n\nIn the last few months we've increasingly run into issues in which the City Council is not reading information provided to them by staff, and is therefore, uninformed. Examples include not reviewing emails and then being out of the loop on projects or not checking their Council calendar and missing key workshops. We currently utilize the following communication methods: one on one meetings between Council and City Manager, biweekly City Manager reports which is a written report emailed out highlighting key events and projects, City Council Outlook calendar with meetings and events, and misc. emails and texts sent out for time-sensitive issues. \nOur Council has also expressed an interest in keeping their meetings short (less than 3 hours) so many FYI items or reports not needing action have been moved to email...which is then not being read. \nConsidering that a Council has many demands on their time, how do you keep your Council informed and engaged? How do you keep FYI reports, memos, events, etc. on their radar? Thanks!\n\n", 
  "title": "How do you keep your Council informed?", 
  "when": "23-07-2013"
}