{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nI was hoping other members by now would weigh in with examples as you have requested.  I don't have examples but would recommend at the outset that the CIC seriously consider as a first step reapplying to the IRS to change the designation from 501c4 to 501c3.  Under IRS rules, 501c4 is the least attractive and constructive form of nonprofit corporation.  Historically, and this could be the case dating back to when the CIC first sought tax exempt status, the IRS when unclear as to the exact purpose and scope of applicant will designate it a 501c4.  To accomplish the stated purposes of the CIC, it will need to be a 501c3 development organization.\n\n\nI was hoping other members by now would weigh in with examples as you have requested.  I don't have examples but would recommend at the outset that the CIC seriously consider as a first step reapplying to the IRS to change the designation from 501c4 to 501c3.  Under IRS rules, 501c4 is the least attractive and constructive form of nonprofit corporation.  Historically, and this could be the case dating back to when the CIC first sought tax exempt status, the IRS when unclear as to the exact purpose and scope of applicant will designate it a 501c4.  To accomplish the stated purposes of the CIC, it will need to be a 501c3 development organization.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-08-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Scott Rainone", 
  "id": 22681, 
  "score": "0", 
  "tags": [
    "Economic Development"
  ], 
  "text": "\n\nHoping the network might be able to point me to research or examples of city-aligned economic development arms.\nFor years, the small city of Ravenna, Ohio, has had a Community Improvement Corporation (a 501(c)(4) entity) created in the 1970s as an economic development tool \"to borrow money, to make loans, to acquire the good will, business rights, real and personal property, etc.\"  However, up until last year, it had not been used much or really formalized. \nThe organization has been re-launched to help work with the city administration to pursue economic and community development opportunities.  \nNow the hard work is just starting of developing the CIC's strategic plan and protocols, as well as establishing short- and long-term goals and metrics. The group's overarching goal is to grow the CIC into an aggressive economic development tool that can seize opportunities while building financial resources and capacity.\nAny examples of successful CICs from other small communities (Ravenna's population is approximately 11,500) or sample strategic plans and protocols would be greatly appreciated.\nThank you for your help.\nScott\n\n", 
  "title": "Examples of Success for Community Improvement Corps?", 
  "when": "05-08-2013"
}