{
  "answer_by": null, 
  "answers": [
    {
      "author": "Richard Brown", 
      "score": "0", 
      "text": "\n\nIn East Providence, RI department heads organize unofficially and negotiate as a group.  That seems to keep them in line with what happens to the general employees.  But as the financial crunch has gotten deeper, the council and community expect that department heads voluntarily agree to pay reductions and/or higher co-share for health insurance premiums.\n\n\nIn East Providence, RI department heads organize unofficially and negotiate as a group.  That seems to keep them in line with what happens to the general employees.  But as the financial crunch has gotten deeper, the council and community expect that department heads voluntarily agree to pay reductions and/or higher co-share for health insurance premiums.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-07-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Krista Watters", 
  "id": 20245, 
  "score": "0", 
  "tags": [
    "Labor-Management Relations"
  ], 
  "text": "\n\nOur California city is struggling like the rest of the jurisdictions.  Our CM and Council want to cut 5% (permanently) from all employee's salary base.  Unfortunately all employees except for managers are represented by unions.  Managers may be the only ones to actually receive the cut.\nHistorically the department heads have been part of the \"management team\" group that has been recognized by upper management in the past, but has no real authority or protection when it comes to bargaining.  Whatever the City wants to do to us it can.  Now the department heads want to split off and have their own individual employment contracts negotiated with the City Manager.  This is probably a good idea in the long run because dept. head and mid-managers' needs are not always the same.\nThe mid-managers have not received raises in 2, now going on 3 years and there is starting to be a compaction issue with employees a) hired after current mid managers and/or \nb)supervised by the managers because non-management staff continue to get 5% a year until they reach their top step in their classification.  There are other issues the mid-managers face which I won't go into here.\nWhat we need at this point is to organize ourselves or have representation.  In the past we have been told we are \"at will\", but with the dept. heads splitting off of our group, this may create an opportunity to be represented.  I have worked for State government in an exempt status, but was represented by a bargaining group, so I think it may be possible.\nDoes your organization (or any you know of) have a management group that is represented professionally or organized and recognized as a bargaining group when it comes to labor relations/negotiation with City Management and Council.\nAny ideas and/or direction or organization you can point me to will be most helpful.\nThanks so much.\n\n", 
  "title": "Mid-management labor negotiations", 
  "when": "22-07-2010"
}