{
  "answer_by": null, 
  "answers": [
    {
      "author": "Rachel Leininger", 
      "score": "1", 
      "text": "\n\nHi Patrick.  As far as looking at volunteers helping with events, there are several volunteer event surveys that have been used by the Olympics and other large events to gauge how well volunteers are being motivated, retained, and what it is that made them want to donate their time in the first place--which could be very useful information for the planning of future events regardless of political affiliation.  \nAs far as voter turnout and other aspects of the gathering voters, you need to clearly define what success looks like for organization.  From what I understand, your organization runs the events, so you all need to be the ones determining success.  For example, you would want to find an event that caters to all socioeconomic backgrounds, but particularly your focus may be engaging a specific voter class like the elderly, the middle class, or individuals under 30.  Let's face it, the political environment will most likely not agree on how to do things, but this topic is your organizations bread and butter.  Set politically neutral goals and/or targets and then build your measures from there.  Also, have you collected any data in the past?  What have you already got on hand and can that data be used for past events?\n\n\nHi Patrick.  As far as looking at volunteers helping with events, there are several volunteer event surveys that have been used by the Olympics and other large events to gauge how well volunteers are being motivated, retained, and what it is that made them want to donate their time in the first place--which could be very useful information for the planning of future events regardless of political affiliation.  \n\nAs far as voter turnout and other aspects of the gathering voters, you need to clearly define what success looks like for organization.  From what I understand, your organization runs the events, so you all need to be the ones determining success.  For example, you would want to find an event that caters to all socioeconomic backgrounds, but particularly your focus may be engaging a specific voter class like the elderly, the middle class, or individuals under 30.  Let's face it, the political environment will most likely not agree on how to do things, but this topic is your organizations bread and butter.  Set politically neutral goals and/or targets and then build your measures from there.  Also, have you collected any data in the past?  What have you already got on hand and can that data be used for past events?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-05-2012"
    }, 
    {
      "author": "Patrick O'Malia", 
      "score": "0", 
      "text": "\n\nThanks in advance for all of your help!\n\n\nThanks in advance for all of your help!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-05-2012"
    }, 
    {
      "author": "Robert Woods", 
      "score": "0", 
      "text": "\n\nI think you need to clarify things a little. It looks like you're talking about: Finding Poll workers, Adding new voters, and Increasing vote by mail.\nIf you are trying to guage effectiveness of increasing those numbers at particular events, the most basic guage would be the unit counts of new [Poll workers/voter registrations/absentee ballot requests (?)] divided by the number of attendees at the event, to generate a success rate per event.\n\n\nI think you need to clarify things a little. It looks like you're talking about: Finding Poll workers, Adding new voters, and Increasing vote by mail.\n\nIf you are trying to guage effectiveness of increasing those numbers at particular events, the most basic guage would be the unit counts of new [Poll workers/voter registrations/absentee ballot requests (?)] divided by the number of attendees at the event, to generate a success rate per event.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-05-2012"
    }, 
    {
      "author": "Corey Hendon", 
      "score": "0", 
      "text": "\n\n\"Success can't be on simple numbers like the number of new registrations or the number of vote by mail apps.\" Would a useful measure be the number of registrants who then actually DO VOTE in the next election? Perhaps the next \"major election\", properly defined so as to exclude the atypical trend of city bond elections versus General Ballots?\nHere, your state's public information laws will come into play. In Texas, how someone votes is private, but to some extent whether they voted in an election or not is public information. your IT environment would also be relevant.  Would cross-referencing a digitized event guest list or list of attendees choosing to register with the voter list be too time consuming, or does your database query of election rolls make this viable?\nTo build on that, you might consider whether a new voter actually KEEPS voting.  If your events are just encouraging people to vote right before an election, and they do, but they don't continue to participate, then to my mind that's not a sustained community outreach if the goal is to increase civic participation. You might want to track two or three subsequent participations to see if your ultimate outcome - increase participation - is sustaining, or if your treatment/stimulus to the participants is limited by severe erosion over a short period of time.  You can't be responsible for whether they're voting 10, 20, or 50 years from now, but the near-medium term might make a good social outcome.  The added benefit is that it would address the concern that your events aren't investments, they're just a way to shift the recurring costs of getting voters disproportionately disposed to one party to the polls.\n\n\n\"Success can't be on simple numbers like the number of new registrations or the number of vote by mail apps.\" Would a useful measure be the number of registrants who then actually DO VOTE in the next election? Perhaps the next \"major election\", properly defined so as to exclude the atypical trend of city bond elections versus General Ballots?\n\nHere, your state's public information laws will come into play. In Texas, how someone votes is private, but to some extent whether they voted in an election or not is public information. your IT environment would also be relevant.  Would cross-referencing a digitized event guest list or list of attendees choosing to register with the voter list be too time consuming, or does your database query of election rolls make this viable?\n\nTo build on that, you might consider whether a new voter actually KEEPS voting.  If your events are just encouraging people to vote right before an election, and they do, but they don't continue to participate, then to my mind that's not a sustained community outreach if the goal is to increase civic participation. You might want to track two or three subsequent participations to see if your ultimate outcome - increase participation - is sustaining, or if your treatment/stimulus to the participants is limited by severe erosion over a short period of time.  You can't be responsible for whether they're voting 10, 20, or 50 years from now, but the near-medium term might make a good social outcome.  The added benefit is that it would address the concern that your events aren't investments, they're just a way to shift the recurring costs of getting voters disproportionately disposed to one party to the polls.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-08-2012"
    }
  ], 
  "answers_count": 4, 
  "author": "Patrick O'Malia", 
  "id": 21917, 
  "score": "1", 
  "tags": [
    "Citizen Engagement", 
    "Citizen Education", 
    "Performance Management and Analytics"
  ], 
  "text": "\n\nHello and thanks for taking a minute to help a fellow public servant out!\nI work at my local Board of Elections as the Community Outreach Coordinator.  Part of our job is education and we go to events to register people, get them to vote by mail, work the polls, etc.  As a part of a large metro area we need to hire about 6,000 workers every election.  It is a tremendous task.\nOur department has been asked to come up with metrics to judge which events we will go to and how we will measure success. Typically, we go try to go to events that will have the largest number of people. If it is an equal amount we go where either there is the most population or the least number of registered voters. Success can't be on simple numbers like the number of new registrations or the number of vote by mail apps.  No one seems to agree what is the most important and this is further complicated by the fact that we are in an extremely political environment.  The R's want one thing; the D's want the exact opposite. \nDoes anyone have any suggestions for measuring intangiables and weighing priorities like this?\n\n", 
  "title": "Metrics for the intangiables", 
  "when": "22-05-2012"
}