{
  "answer_by": null, 
  "answers": [
    {
      "author": "Leslie Beauregard", 
      "score": "1", 
      "text": "\n\nWayne, I am interested in learning more about this.\n\n\nWayne, I am interested in learning more about this.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-08-2010"
    }, 
    {
      "author": "Karen Pinkos", 
      "score": "1", 
      "text": "\n\nThis also seems like it would also be a great way for members to more easily tackle their credentialing requirements, too...as Bonnie said, with training budgets being cut, an easy (and cheap!) way to meet our professional development needs would be an excellent member benefit.\n\n\nThis also seems like it would also be a great way for members to more easily tackle their credentialing requirements, too...as Bonnie said, with training budgets being cut, an easy (and cheap!) way to meet our professional development needs would be an excellent member benefit.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-08-2010"
    }, 
    {
      "author": "Bonnie Svrcek", 
      "score": "0", 
      "text": "\n\nSounds like this will be a great asset particularly for members working on their CPM requirement. And, while training and travel budgets continue to be challenged I think this is a great move on the part of ICMA.  Communicating the availabliity of this tool will be really important to its success!\n\n\nSounds like this will be a great asset particularly for members working on their CPM requirement. And, while training and travel budgets continue to be challenged I think this is a great move on the part of ICMA.  Communicating the availabliity of this tool will be really important to its success!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-08-2010"
    }
  ], 
  "answers_count": 3, 
  "author": "Wayne Sommer", 
  "id": 20283, 
  "score": "1", 
  "tags": [
    "Leadership", 
    "Career Resources", 
    "Management"
  ], 
  "text": "\n\nMost of you have had the opportunity to partake in an ICMA web conference or web workshop.   You may have participated in our first virtual conference last year and may also be planning to do so again this year. (And if you haven't done any of these activities yet, you should; click on the University tab above to find out more.)  ICMA is deepening our investment in e-learning for your benefit.  In the coming months you should see the new ICMA learning management system makes its debut.  This will be the beginning of a whole new way to invest in your professional and personal development--what you need, when you want it, in a way that is convenient and enriching.  As we build this out, we would like to hear ideas from you on how we can make this opportunity most valuable to you and your staff.  What do you think?\n\n", 
  "title": "Advancing e-learning for you...", 
  "when": "04-08-2010"
}