{
  "answer_by": "11-06-2010", 
  "answers": [
    {
      "author": "Andre Moquin", 
      "score": "0", 
      "text": "\n\n\nWe implemented in July of 2004, moving from a step increase (about 4.75%) on the 6, 10, 15 and 20th anniversary date of hire.  \nWe were attempting to link pay increase to performance and progress towards our strategic objectives and goals.\nNo. Most unrepresented positions are under this program. Department directors and employees represented by one of our three Unions are not. \nThere is a better linkage between performance and pay increases. It has created a system whereas all employees are being evaluated yearly. It provides the opportunity for supervisors to discuss and establish work performance expectation and goals with employees during the evaluation. Helped with the alignment of strategic goals and work for some employees. Puts financial control for the program with the Council during budget.\nOur system is somewhat complex and not easily understood by all employees. The forecasted allocation in to the merit pool by Council (tough economic times) have not materialized as of yet and merit increases are relatively low.  The updates to our strategic plan have developed more slowly than anticipated and the link has yet to be established to our satisfaction. Our system does not recognize high performing teams. All believe they are in high performing teams. Not all supervisors are skilled in goal setting\nCouncil allocates merit pool as part of the budget. This pool is subdivided by department and section and allocated based on evaluation scores and an established matrix.\nGiven that it has become a budget issue, it has increased Council’s ability top allocate resources based on the availability of funds.\nIt can be all of the above. However, in the initial years of implementation it was more expensive.\n\n\n\n\nWe implemented in July of 2004, moving from a step increase (about 4.75%) on the 6, 10, 15 and 20th anniversary date of hire.  \nWe were attempting to link pay increase to performance and progress towards our strategic objectives and goals.\nNo. Most unrepresented positions are under this program. Department directors and employees represented by one of our three Unions are not. \nThere is a better linkage between performance and pay increases. It has created a system whereas all employees are being evaluated yearly. It provides the opportunity for supervisors to discuss and establish work performance expectation and goals with employees during the evaluation. Helped with the alignment of strategic goals and work for some employees. Puts financial control for the program with the Council during budget.\nOur system is somewhat complex and not easily understood by all employees. The forecasted allocation in to the merit pool by Council (tough economic times) have not materialized as of yet and merit increases are relatively low.  The updates to our strategic plan have developed more slowly than anticipated and the link has yet to be established to our satisfaction. Our system does not recognize high performing teams. All believe they are in high performing teams. Not all supervisors are skilled in goal setting\nCouncil allocates merit pool as part of the budget. This pool is subdivided by department and section and allocated based on evaluation scores and an established matrix.\nGiven that it has become a budget issue, it has increased Council’s ability top allocate resources based on the availability of funds.\nIt can be all of the above. However, in the initial years of implementation it was more expensive.\n\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-06-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Jo Mattoon", 
  "id": 20047, 
  "score": "0", 
  "tags": [
    "Management"
  ], 
  "text": "\n\nThank you for participating in this survey on Pay for Performance. Your answers to all or any of the following questions are greatly appreciated. Please return your survey questions by June 11, 2010 to Gabriella Bommer at gbommer@arvada.org or fax # 720-898-7556. \n\nWhen did you implement Pay for Performance and what type of system did you have prior to this?  \nWhy did you switch to a performance-based system? \nAre all employees on Pay for Performance?  If not- please explain which positions are and which ones are not. \nWhat have been the main advantages/benefits of Pay for Performance? \nWhat have been the main disadvantages, if any? \nWhat methods within your Pay for Performance system are used to control payroll increase costs?  (e.g. do you use a matrix or forced distribution? Other methods?) \nHow has the performance-based system improved your financial/budgeting flexibility, especially during these lean economic times? \nOverall, has the Pay for Performance system resulted in a more expensive, cost- neutral or less expensive pay system when compared to your previous system?\n\n\n", 
  "title": "Pay for Performance Transition Questions", 
  "when": "01-06-2010"
}