{
  "answer_by": null, 
  "answers": [
    {
      "author": "Derek Johnson", 
      "score": "0", 
      "text": "\n\nHi Douglas,\nHere are a couple examples of oversized vehicle ordinances from cities that take the same basic regulatory approach with added tweaks here and there:\nCity of Oakley, CA: http://bit.ly/eaSLwu\nThe City of Oakley prohibited oversized vehicle parking on public streets in 2004. This 2007 report to the City Council consists of a staff analysis of the ordinance and recommendations for improvements. As a result of resident input, a 24-hour grace period was implemented and a system of permits were created to allow for occasional stays longer than that. In order to avoid abuse, city staff recommended that individual residents be limited to two permits per month. \nFort Worth, Texas: http://bit.ly/gmSfkb\nThis powerpoint presentation by the Code Compliance Office of Forth Worth, Texas provides a nice overview of how their oversized vehicle policy works. There are different regulations for recreational, large recreational and oversized recreational vehicles. There are also separate rules for on-street and off-street parking.\n\n\nHi Douglas,\n\nHere are a couple examples of oversized vehicle ordinances from cities that take the same basic regulatory approach with added tweaks here and there:\n\nCity of Oakley, CA: http://bit.ly/eaSLwu\n\nThe City of Oakley prohibited oversized vehicle parking on public streets in 2004. This 2007 report to the City Council consists of a staff analysis of the ordinance and recommendations for improvements. As a result of resident input, a 24-hour grace period was implemented and a system of permits were created to allow for occasional stays longer than that. In order to avoid abuse, city staff recommended that individual residents be limited to two permits per month. \n\nFort Worth, Texas: http://bit.ly/gmSfkb\n\nThis powerpoint presentation by the Code Compliance Office of Forth Worth, Texas provides a nice overview of how their oversized vehicle policy works. There are different regulations for recreational, large recreational and oversized recreational vehicles. There are also separate rules for on-street and off-street parking.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-01-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Douglas Lewis", 
  "id": 20723, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nThe CIty of Painesville, Ohio currently regulates the types of oversized vehicles permitted in residential district by naming them.  Below is a copy of the section in the ordinance.  We have looked into and most seem to regulate by lenght, height, width and weight.   If you have other suggestions, I would be interested.  Thank you!\n(b)     No person shall park or store a commercial tractor, school bus, bus, semitrailer, pole trailer, dump vehicle, tow truck, or flat bed within the residential districts of the City, either on public or private property, including a public street or highway, except to make deliveries, pickups or for the loading or unloading of persons, unless such commercial tractor, school bus, bus, semitrailer, pole trailer, dump vehicle, tow truck or flat bed is parked or stored in a completely enclosed structure.\n\n", 
  "title": "Oversized Vehicle Regulation", 
  "when": "25-01-2011"
}