{
  "answer_by": null, 
  "answers": [
    {
      "author": "Timothy McLean", 
      "score": "0", 
      "text": "\n\nWe have been requiring permits for garage sales for a few years now. We dont charge a fee for the permits, but only permit six sales per year per household. So far we've allowed residents to get them at the desk of the clerk and this system has worked so far.  Of course, we are a smaller community, (2,258 residents).\n\n\nWe have been requiring permits for garage sales for a few years now. We dont charge a fee for the permits, but only permit six sales per year per household. So far we've allowed residents to get them at the desk of the clerk and this system has worked so far.  Of course, we are a smaller community, (2,258 residents).\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "29-05-2012"
    }, 
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nThis is the kind of function since it is address centric that can be converted to web based on line for the citizen to handle form home.  If you do not have in house expertise, there are many companies that do this kind of software programming.  This way the customer does not have to physically go anywhere.\n\n\nThis is the kind of function since it is address centric that can be converted to web based on line for the citizen to handle form home.  If you do not have in house expertise, there are many companies that do this kind of software programming.  This way the customer does not have to physically go anywhere.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "29-05-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Elizabeth Gray", 
  "id": 21926, 
  "score": "0", 
  "tags": [
    "Housing & Community Development", 
    "Strategic Planning", 
    "Sustainability", 
    "Citizen Engagement", 
    "Planning"
  ], 
  "text": "\n\nOur only local newspaper has offered to take our garage sale permits at their office.  Is anyone else doing this?  If so, what are your parameters? If we do this I do not wish to reinvent the wheel! Any pitfalls? The customer would not be required to take an advertisement with the paper and we would still offer the service at city hall. As we seem to downsize our staff year after year these types of public/private partnerships are becoming more and more attractive. I look forward to your response.\n\n", 
  "title": "Yard sale permits taken at newspaper offices", 
  "when": "29-05-2012"
}