{
  "answer_by": "30-09-2011", 
  "answers": [
    {
      "author": "Steve Balderson", 
      "score": "0", 
      "text": "\n\nWe use a qualified in house maintenance staff for our HVAC repairs and preventive maintenance.  Over the years I have found that the added investment and ownership your own employees have produce a superior quality and lower cost result over a \"for profit\" resource.   That said, you also must invest in employees that are experienced and qualified to perform this specialized work, along with folks in the  supervisory capacity to provide the required leadership to get  results.   \nThe best success I've experienced using contract services involves a multi year contract commitment (which may or may not be possible in the public sector).   The first year is an assessment and discovery period where all the equipment is inventoried, a condition assessment completed, and repairs are separated into \"normal maintenance\" and \"end of life - replacement\" categories.   The next year, costs for each category are determined and a plan to complete them.  Once the equipment is brought up to healthy operating level,  next year(s) should be regular maintenance.  So you need to commit to an assessment, upgrades, then a maintenance period.  The assessment period may be longer or shorter, depending on the number of facilities and amount of equipment involved.  \nThe other approach is to get pricing for hourly rates and material mark ups, complete the repairs as needed or reactively.  This may require the ability to tolerate break downs and service outages.   \nThis is a short answer to a very complex question.\n\n\nWe use a qualified in house maintenance staff for our HVAC repairs and preventive maintenance.  Over the years I have found that the added investment and ownership your own employees have produce a superior quality and lower cost result over a \"for profit\" resource.   That said, you also must invest in employees that are experienced and qualified to perform this specialized work, along with folks in the  supervisory capacity to provide the required leadership to get  results.   \n\nThe best success I've experienced using contract services involves a multi year contract commitment (which may or may not be possible in the public sector).   The first year is an assessment and discovery period where all the equipment is inventoried, a condition assessment completed, and repairs are separated into \"normal maintenance\" and \"end of life - replacement\" categories.   The next year, costs for each category are determined and a plan to complete them.  Once the equipment is brought up to healthy operating level,  next year(s) should be regular maintenance.  So you need to commit to an assessment, upgrades, then a maintenance period.  The assessment period may be longer or shorter, depending on the number of facilities and amount of equipment involved.  \n\nThe other approach is to get pricing for hourly rates and material mark ups, complete the repairs as needed or reactively.  This may require the ability to tolerate break downs and service outages.   \n\nThis is a short answer to a very complex question.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-08-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Lawrence Pierce", 
  "id": 21283, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Public Works", 
    "Finance and Budgeting", 
    "Contracts"
  ], 
  "text": "\n\nI am requesting any information or experiences from any entities that have engaged the services of private HVAC firms (AC/Heat/on call repairs, etc) to municipal or county facilities in communities that do not have such technicians/capabilities on staff. Also, how are these firms selected, and is there an evaluation sheet, that may include fixed hourly rates, response times, special services, and how long does your agreement last. How do you budget for such work as well as how is the successful firm evaluated for continued service to the community would be helpful as well.\n\n", 
  "title": "Municipal Facility HVAC Management via Private Contractor", 
  "when": "18-08-2011"
}