{
  "answer_by": null, 
  "answers": [
    {
      "author": "Mark Abeles-Allison", 
      "score": "0", 
      "text": "\n\nWe went with Official payments partially because of the 100% payment and surcharge to clients.\n\n\nWe went with Official payments partially because of the 100% payment and surcharge to clients.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-04-2012"
    }, 
    {
      "author": "Stephen Bechler", 
      "score": "0", 
      "text": "\n\nThank you Mark.\n\n\nThank you Mark.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-04-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Stephen Bechler", 
  "id": 21808, 
  "score": "0", 
  "tags": [
    "Innovation", 
    "Citizen Engagement", 
    "Technology", 
    "Finance and Budgeting", 
    "Form of Government", 
    "Process Improvement", 
    "Service Delivery"
  ], 
  "text": "\n\nWe at the City of Middleton (WI) are in the process of a website redesign, and are hoping to automate our bill paying functions as much as possible, while keeping them affordable.  As such, I was hoping to ascertain whether or not people have recommendations on vendors of this service--whether or not you are a customer.  I have just begun a list that includes: Payment Service Network, LexisNexis, Vanco, IntelliPay, Active Networks, Official Payments, Municipal Payments, and Pay-Ease.\nIn terms of parameters, I was looking at: fees per transaction (for the City & the customer), the time frame for operability, the type of services they provide (providing data for upload to Caselle, automating the entire process on customer and City accounts, etc.)\nInfo on the City:\nPopulation: approx. 17,000\nUsing Caselle\nIf there is any other info I can supply that would make this question easier to answer, or if there is already a similar thread with all the information I'm asking about, I would love some feedback.\nThank you!\nStephen Bechler\nCity of Middleton (WI)\nAdministrative Intern\nadministration@ci.middleton.wi.us\n\n", 
  "title": "Automated Payments Vendor", 
  "when": "06-04-2012"
}