{
  "answer_by": "08-08-2010", 
  "answers": [
    {
      "author": "William Follette", 
      "score": "0", 
      "text": "\n\nStefano,\nI have attached our city's organization chart as one example of reporting relationships.  Mesa, Arizona, USA is a City of about 450,000 population with an annual budget of USD $1.113 billion.\nBill Follette\nDirector, Management Performance and Accountability\n480.644.5182\n\n\nStefano,\nI have attached our city's organization chart as one example of reporting relationships.  Mesa, Arizona, USA is a City of about 450,000 population with an annual budget of USD $1.113 billion.\n\nBill Follette\nDirector, Management Performance and Accountability\n480.644.5182\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "29-07-2010"
    }, 
    {
      "author": "Stefano Tripi", 
      "score": "0", 
      "text": "\n\nThank you William, it is very interesting. \nIn my municipality (180,000 population, 2,000 employees), as in other italian cities,  the staff/line distinction is more marked, we have some strategic \"staff\" services, directly coordinated by the City Manager, and several \"line\" Departments (delivering public services). \nI'm attaching my city's organization chart for reference, you can see the support services I'm referring to under the \"Direzione Generale\" box (Direction-General, the direct staff offices for the Director-General - the equivalent to the City Manager).\nStefano Tripi\n\n\nThank you William, it is very interesting. \nIn my municipality (180,000 population, 2,000 employees), as in other italian cities,  the staff/line distinction is more marked, we have some strategic \"staff\" services, directly coordinated by the City Manager, and several \"line\" Departments (delivering public services). \nI'm attaching my city's organization chart for reference, you can see the support services I'm referring to under the \"Direzione Generale\" box (Direction-General, the direct staff offices for the Director-General - the equivalent to the City Manager).\n\nStefano Tripi\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "29-07-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "Stefano Tripi", 
  "id": 20267, 
  "score": "0", 
  "tags": [
    "Organizational Development", 
    "Management"
  ], 
  "text": "\n\nHello,\nI am a civil servant from Modena, Italy, working as an assistant to the City Manager.\nI am also finishing my dissertation for the postgraduate degree in Public Policy, regarding the role and status of City Managers in Italy and in other countries.\nRight now I'm focusing on the topic of the size of the city management staff, meaning the offices reporting directly to the City Manager: for instance, right now in our municipality we have the Communication Service, the Strategic Planning Service and the Mayor's Cabinet offices reporting directly to the City Manager, while other Services and Departments stay in the \"line\" structure, managed by Department Heads (reporting to the City Manager).\nI would like to ask if you know of any U.S. or international research on this topic: I managed to find some articles regarding company headquarters, but nothing specific on public or city management.\nI am also looking forward to some experience from U.S. City Managers on this topic: city management is different in Italy and in the U.S., but I think it's possible to find some points in common - that's what I'm trying to do in my dissertation.\nThanks in advance. Greetings from Italy!\n\n", 
  "title": "City Manager's staff size", 
  "when": "29-07-2010"
}