{
  "answer_by": null, 
  "answers": [
    {
      "author": "Israel Murguia", 
      "score": "0", 
      "text": "\n\nHi Anne,\nAs you know, civic engagement can be a nebulous concept and can be difficult to measure. Nevertheless, the following are some things to keep in mind: When looking for measurements, local governments should develop measures of the outcomes from engagement\napproaches, the number and range of participants, the quality of participation, change in public attitudes, and the extent to which people have come together to resolve important community issues. In my search, I did not come across any type of metric, mostly I think because communities are still trying to grapple with this concept. I don't know if you had the chance to read the Connected Communities White Paper that deals with civic engagement, but if you haven't, you may find some of the highlighted case studies helpful in thinking about some measures. Hopefully someone who has seen your question and has some developed measures can help us all by shedding light on this subject. Attached is the paper, I hope you find it useful.\n\n\nHi Anne,\nAs you know, civic engagement can be a nebulous concept and can be difficult to measure. Nevertheless, the following are some things to keep in mind: When looking for measurements, local governments should develop measures of the outcomes from engagement\napproaches, the number and range of participants, the quality of participation, change in public attitudes, and the extent to which people have come together to resolve important community issues. In my search, I did not come across any type of metric, mostly I think because communities are still trying to grapple with this concept. I don't know if you had the chance to read the Connected Communities White Paper that deals with civic engagement, but if you haven't, you may find some of the highlighted case studies helpful in thinking about some measures. Hopefully someone who has seen your question and has some developed measures can help us all by shedding light on this subject. Attached is the paper, I hope you find it useful.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-03-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Anne Lewis", 
  "id": 20815, 
  "score": "0", 
  "tags": [
    "Housing & Community Development", 
    "Citizen Engagement"
  ], 
  "text": "\n\nNow more than ever, localities must encourage, support and promote economic development.  There are limited dollars in which to accomplish an effective plan.  Marketing plans are a key tool in promoting and supporting these efforts.  Plans may include increasing awareness; assisting local businesses through cooperative programs and incentives; communicating with partners and collaborating marketing efforts; and utilizing public relations tools including web 2.0 technologies to engage citizens in what matters locally.  What are you measuring to know that you have been successful in engaging citizens?  Sample documents and information is appreciated.\n\n", 
  "title": "Local Government Marketing and Citizen Engagement", 
  "when": "22-02-2011"
}