{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Clayton, \nIn Raleigh, we use a program called ImageNow, which allows us to open digital copies of our contract transmittal forms and see who, from the department head to accounting to the attorneys and the city manager, has approved the contract.  It also lets us know if the contract is currently in accounting or still in the process of being signed, which helps figure out (particularly at year-end) which contracts have funds already encumbered.  I wasn't part of the implementation process, but I do know it's been a helpful tool for us!\n\n\nHi Clayton, \n\nIn Raleigh, we use a program called ImageNow, which allows us to open digital copies of our contract transmittal forms and see who, from the department head to accounting to the attorneys and the city manager, has approved the contract.  It also lets us know if the contract is currently in accounting or still in the process of being signed, which helps figure out (particularly at year-end) which contracts have funds already encumbered.  I wasn't part of the implementation process, but I do know it's been a helpful tool for us!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-06-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Clayton Voignier", 
  "id": 21900, 
  "score": "0", 
  "tags": [
    "Contracts"
  ], 
  "text": "\n\nDoes anyone have experience with implementing an electronic contract management software solution that uses automated workflow, digital signature capture, and that also integrates with their existing electronic financial, ERP and/or internal audit systems? I have browsed lots of solutions that are mainly geared toward the private sector and/or federal government contracting, but I have not seen anything browsing through ICMA or other local government publications and resources. Any suggestions or recommendations are welcome. Thanks!\n\n", 
  "title": "Contracts Management Software", 
  "when": "15-05-2012"
}