{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nThis situation begs the question as to whether the city has a relationship with the region's Workforce Investment Board and/or economic development organizations, or even whether the city is served by a defined economic development function or a WIB.  If there is a WIB covering the city and/or an economic development organization then it would be prudent before establishing such a task force to engage them to find out if the city/City Council can become more actively involved with the WIB and/or EDO.  If there is neither an EDO or a WIB serving the city, then a task force is probably the answer but one with a focus on determining the best course of action to create an economic development organization or function with a clear mission of addressing the unemployment rate.  The underlying point is that a local government task force operating in a vacuum in terms of seeking ways to reduce the community's unemployment rate will end up spinning their wheels.\n\n\nThis situation begs the question as to whether the city has a relationship with the region's Workforce Investment Board and/or economic development organizations, or even whether the city is served by a defined economic development function or a WIB.  If there is a WIB covering the city and/or an economic development organization then it would be prudent before establishing such a task force to engage them to find out if the city/City Council can become more actively involved with the WIB and/or EDO.  If there is neither an EDO or a WIB serving the city, then a task force is probably the answer but one with a focus on determining the best course of action to create an economic development organization or function with a clear mission of addressing the unemployment rate.  The underlying point is that a local government task force operating in a vacuum in terms of seeking ways to reduce the community's unemployment rate will end up spinning their wheels.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-09-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Kimball Payne", 
  "id": 22150, 
  "score": "0", 
  "tags": [
    "Economic Development"
  ], 
  "text": "\n\nA member of City Council has suggested forming a task force to examine the city's unemployment rate and make recommendations regarding actions that the governing body can take to reduce the rate. The manager has been asked to explore the feasibility of this initiative and to report back to Council.  Does anyone have any experience with such a task force that you can share or are you aware of any publications that address this issue?\n\n", 
  "title": "Addressing Community Unemployment Rate", 
  "when": "14-09-2012"
}