{
  "answer_by": null, 
  "answers": [
    {
      "author": "Leonard Matarese", 
      "score": "0", 
      "text": "\n\nMichigan has the most public safety departments of any state and very similar labor laws to IL. Suggest you contact the Michigan City Managers Association and ask them to post the question on their website. Its very active and you should be able to get some good samples. Here's some Michigan cities you may want to contact that have public safety departments: Kalamazoo, St. Joseph, Grosse Point, Grosse Point Park, Grosse Point Shores, Berkley, Oak Park.\n\n\nMichigan has the most public safety departments of any state and very similar labor laws to IL. Suggest you contact the Michigan City Managers Association and ask them to post the question on their website. Its very active and you should be able to get some good samples. Here's some Michigan cities you may want to contact that have public safety departments: Kalamazoo, St. Joseph, Grosse Point, Grosse Point Park, Grosse Point Shores, Berkley, Oak Park.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-02-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Philip Kiraly", 
  "id": 22942, 
  "score": "0", 
  "tags": [
    "Public Safety"
  ], 
  "text": "\n\nOur community has had a combined Public Safety Department for 60 years, but we are just now dealing with our first collective bargaining situation as the Public Safety Officers have organized with the FOP.  In Illinois, combined Public Safety Departments are no longer statutorially authorized, and so the two combined Departments that exist in the State (ours included) have been grandfathered in.  This alone makes it difficult to find comparables, let alone contracts and contract language that we can use as a starting point.  \nFor the other combined Public Safety departments out there, if you have an FOP or other collective bargaining agreement, I would appreciate if you could share it with us.  Likewise, any thoughts you have on building comparables would be appreciated as well.\n\n", 
  "title": "Combined Public Safety Departments and Collective Bargaining", 
  "when": "29-01-2014"
}