{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nThe City of Arlington, Texas started using a vehicle with camera's on it to gather data on the state of their infrastructure.  The same technology could improve your efficiency.  Go here for more information: http://www.arlingtontx.gov/articles/2010/articles_0210_06.html\nI haven't found anything that would help with the noise issue, but am working on it.  I'll post something when I get more information.\n\n\nThe City of Arlington, Texas started using a vehicle with camera's on it to gather data on the state of their infrastructure.  The same technology could improve your efficiency.  Go here for more information: http://www.arlingtontx.gov/articles/2010/articles_0210_06.html\n\nI haven't found anything that would help with the noise issue, but am working on it.  I'll post something when I get more information.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-08-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Pamela Muse", 
  "id": 20325, 
  "score": "0", 
  "tags": [
    "Public Works"
  ], 
  "text": "\n\nLos Angeles County is interested in learning about new ways to identify and repair maintenance deficiences as well as reduce noise of heavy beach equipment.  Specifically:\n\nHow to effectively identify and repair maintenance deficiencies in areas (with Department maintained infrastructure) such as parking lots, walking paths, public restrooms, lifeguard facilities, and park community buildings.  Our Department already has a good program for looking out for deficiencies in these areas that we take care of, but there is always room to improve and we are wondering if there are other ways of looking for deficiencies (perhaps using technological devices?) that would help a department adjusting to budget cuts and the strain that puts on personnel hours.  Maybe there are other creative methods as well that allow staff to inspect a large area (such as a large parking lot) and identify hazards or deteriorating conditions. \nHow to reduce noise from our beach heavy equipment while still remaining in compliance with CAL OSHA laws.  Our machinery cleans the beach early in the morning, and we do receive complaints from nearby residents about the noise, so we would need research done on noise reducing devices for our equipment. \n\nThank you.  I look forward to your solutions! \nWalter Popoff, Executive Assistant\nLos Angeles County, CA\n\n", 
  "title": "Maintenance Deficiences & Reduce Heavy Beach Equip Noise", 
  "when": "19-08-2010"
}