{
  "answer_by": null, 
  "answers": [
    {
      "author": "Alexandra Iannolo", 
      "score": "0", 
      "text": "\n\nHello,\nI found some links that you might find helpful.\nThis report from Michigan State University discusses systems local governments can use to support the growth of business.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/301732/Role_of_Entrepreneurship__Innovation_in_Regional_Economic_Development\nIn this article you can read about the successful business development programs in Santa Clarita, CA.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/5381/Local_Government_Mantra_Help_Businesses_Shop_Local\nI have also included their zoning brochure.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/9319/City_of_Santa_Claritas_Enterprise_Zone_Brochure\nYucca Valley, CA has also taken on a number of programs to improve the economic development processes for local businesses.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/11960/Taking_Care_of_Business\nLoudon, VA was the first county in the state to allow electronic declarations of the Business Tangible Personal Property tax.\nhttp://icma.org/en/Article/10035/Loudoun_Becomes_First_in_Virginia_with_Online_Business_Property_Reporting\nI have also included a PowerPoint from Roseville, CA on streamlining the development review process.\nhttp://www.sacregionblueprint.org/sacregionblueprint/the_project/implementation/2005-09sep-05/Roseville_Busch_present0905.pdf\nAli Iannolo\nKnowledge Network Intern\naiannolo@ICMA.org\n\n\nHello,\n\nI found some links that you might find helpful.\nThis report from Michigan State University discusses systems local governments can use to support the growth of business.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/301732/Role_of_Entrepreneurship__Innovation_in_Regional_Economic_Development\nIn this article you can read about the successful business development programs in Santa Clarita, CA.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/5381/Local_Government_Mantra_Help_Businesses_Shop_Local\nI have also included their zoning brochure.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/9319/City_of_Santa_Claritas_Enterprise_Zone_Brochure\nYucca Valley, CA has also taken on a number of programs to improve the economic development processes for local businesses.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/11960/Taking_Care_of_Business\nLoudon, VA was the first county in the state to allow electronic declarations of the Business Tangible Personal Property tax.\nhttp://icma.org/en/Article/10035/Loudoun_Becomes_First_in_Virginia_with_Online_Business_Property_Reporting\nI have also included a PowerPoint from Roseville, CA on streamlining the development review process.\nhttp://www.sacregionblueprint.org/sacregionblueprint/the_project/implementation/2005-09sep-05/Roseville_Busch_present0905.pdf\n\nAli Iannolo\nKnowledge Network Intern\naiannolo@ICMA.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-10-2011"
    }, 
    {
      "author": "Gregory Stopka", 
      "score": "0", 
      "text": "\n\n\n\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-10-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Gregory Stopka", 
  "id": 21378, 
  "score": "2", 
  "tags": [
    "Infrastructure Planning", 
    "Planning"
  ], 
  "text": "\n\nBloomington, MN has amended its development review process to make it more business friendly (see below).  I'm interested in learning what other innovative practices are being used to create a business friendly development review process.  Please let me know.\nSo far Bloomington has made the following changes,\n\"Quick review times.  Bloomington has amended several Codes recently to shorten review times.  Small building additions, two-family dwellings, accessory dwelling units, accessory buildings, parking lot changes, site changes, antenna installations and simple plats can all be approved administratively (by staff), typically in a matter of a couple days.  Other amendments allow the Planning Commission to make final approvals (subject to appeal to the City Council) on Code complying site plans, allow certain minor variances to go to a hearing examiner instead of the Planning Commission, and allow certain CUPs and IUPs to skip the Planning Commission and proceed directly to the City Council.  Minnesota has a State law requiring all applications to be acted upon within 120 days.  In Bloomington, typical applications that require a Planning Commission and City Council hearing are processed faster than the requirement.\nClear ordinances.  Bloomington has been updating ordinances in part to make them clearer and easier to understand.\nReasonable fees.  Bloomington’s zoning, use permit and variance application fees are below the City’s actual costs to process. City Council views as a “loss leader” for development.\nPreapplication meetings.  Bloomington often holds several preapplication meetings at the applicant’s request  to ensure all questions are answered and an application is complete when it is submitted.\nDevelopment Review Committee.  Bloomington holds DRC meetings to ensure applicants know about any concerns or conflicts with the City’s ordinances prior to application.\nCourtesy reviews prior to building permit applications.  On request, the City will review draft construction plans prior to submittal for a building permit to flag issues early on and ensure complete submittals. Identifying building code-related issues early in the design process is an important cost saver. We have noticed this is especially helpful when the architect or engineer is from outside Minnesota and not entirely familiar with Minnesota codes.\nWeekly or biweekly progress review meetings for large projects in the permit review and construction stage.  These meetings are important for keeping applicants focused on satisfying conditions of approval so that miscellaneous items are not left to the last minute, slowing down a project.\nExamples of summaries explaining various aspects of the planning and review process:\nhttp://www.ci.bloomington.mn.us/cityhall/dept/commdev/handouts/planhandouts.htm\nDevelopment application procedures:\nhttp://www.ci.bloomington.mn.us/handouts/52/52tdev_app_procedure.pdf\nDevelopment application review, including description of the Development Review Committee process. The DRC review does not have a fee, one aspect of being business friendly:\nhttp://www.ci.bloomington.mn.us/handouts/52/52ldevapp.pdf\nChecklist for submitting applications:\nhttp://www.ci.bloomington.mn.us/handouts/52/52eplansub.pdf\"\n\n", 
  "title": "Business Friendly Development Review Process", 
  "when": "27-09-2011"
}