{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jeri Corgill", 
      "score": "1", 
      "text": "\n\nTom - Go with your gut; it's telling you the right thing to do. It is always best to be up front with all concerned. Even if you don't get the position, the last thing you want is for those you work with to feel betrayed.\n\n\nTom - Go with your gut; it's telling you the right thing to do. It is always best to be up front with all concerned. Even if you don't get the position, the last thing you want is for those you work with to feel betrayed.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-10-2013"
    }, 
    {
      "author": "Larry Paine", 
      "score": "0", 
      "text": "\n\nI definately would tell my supervisors.  He/she needs to know that your motives for advancement are honorable.  If you are selected for the position, you have some transition responsibilities to your current employer.  I listen to a managemet podcast called Manager Tools.  They have a series of 3 podcasts that you would want to consider as you leave. http://www.manager-tools.com/2006/07/how-to-resign-part-1-of-3.  This is the URL for the first of the three.  Access to these podcasts is free.  I highly recommend this site based on what they teach.  they have been producing weekly podcasts since 2005 and each one is a gem.\nAgain, if you are selected for this new position, use this model for exiting and let your supervisors know what you intend to do as you exit.  Supervisors and directs will appreciate your closing efforts.  The word will get out that Tom is a great employee.\nGood luck.\n\n\nI definately would tell my supervisors.  He/she needs to know that your motives for advancement are honorable.  If you are selected for the position, you have some transition responsibilities to your current employer.  I listen to a managemet podcast called Manager Tools.  They have a series of 3 podcasts that you would want to consider as you leave. http://www.manager-tools.com/2006/07/how-to-resign-part-1-of-3.  This is the URL for the first of the three.  Access to these podcasts is free.  I highly recommend this site based on what they teach.  they have been producing weekly podcasts since 2005 and each one is a gem.\n\nAgain, if you are selected for this new position, use this model for exiting and let your supervisors know what you intend to do as you exit.  Supervisors and directs will appreciate your closing efforts.  The word will get out that Tom is a great employee.\n\nGood luck.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-10-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Tom Gosiorowski", 
  "id": 22761, 
  "score": "0", 
  "tags": [
    "Career Resources"
  ], 
  "text": "\n\nI have been selected as a finalist candidate for a department head position at another agency in my regional area. This agency is going to publicly name the finalists prior to the next step in the selection process. There is a decent possibility that my current employer will learn the news once the finalist names are announced. My gut is telling me that prior to the announcement I should inform at least the senior managers at my current employer and possibly my direct reports. Not having been in this situation before I am looking for any guidance on how to best handle this situation. Thanks in advance.\n\n", 
  "title": "Notifying employer/employees of POSSIBLE job change", 
  "when": "03-10-2013"
}