{
  "answer_by": null, 
  "answers": [
    {
      "author": "Laura Hagg", 
      "score": "0", 
      "text": "\n\nHi Waheed - I am glad you posted a question and great to hear from you!  ICMA has done some small infrastructure projects in Afghanistan, as part of our programs.  We have worked with municipal staff to pave roads, clean ditches and manage solid waste.  However, we are not a construction and engineering firm so for the big construction projects in Afghanistan, those are best handled by the specialized construction firms.    \nHowever, you also bring up a good point about volunteering to help communities.  They are many examples in the U.S. where cities use volunteers to help build and maintain parks, conduct clean up efforts and many others.  The Knowledge Network has some documents on volunteering that you may want to review.\n\n\nHi Waheed - I am glad you posted a question and great to hear from you!  ICMA has done some small infrastructure projects in Afghanistan, as part of our programs.  We have worked with municipal staff to pave roads, clean ditches and manage solid waste.  However, we are not a construction and engineering firm so for the big construction projects in Afghanistan, those are best handled by the specialized construction firms.    \n\nHowever, you also bring up a good point about volunteering to help communities.  They are many examples in the U.S. where cities use volunteers to help build and maintain parks, conduct clean up efforts and many others.  The Knowledge Network has some documents on volunteering that you may want to review.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-07-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Waheed Rahimi", 
  "id": 21172, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nAs we all know giving advice to the municipalities has no better impact than practical works, I asked why ICMA are not taking much more part in construction than advising?\nHopes ICMA take practical part in reconstruction of Afghanistan and involve the resident as a volunteer labors in rehabilitation as Japan did and the same our MRRD is doing by the name of Notional solidarity Program in Afghanistan.\nNeeds your comments and idea for better development\n\n", 
  "title": "Hope bring changes in implementing of ICMA project in Afghanistan Municipalities", 
  "when": "30-06-2011"
}