{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roger Kolman", 
      "score": "0", 
      "text": "\n\nTammy, the North Dakota League of Cities would probably be the best comprehensive resource.  You might also check the municipal leagues of surrounding states for North Dakota job postings.\n\n\nTammy, the North Dakota League of Cities would probably be the best comprehensive resource.  You might also check the municipal leagues of surrounding states for North Dakota job postings.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-09-2012"
    }, 
    {
      "author": "Tammy Carr", 
      "score": "0", 
      "text": "\n\nRoger, Thank you for responding!  That term \"municipal league\" is a key term that may have been missing from my search efforts.\n\n\nRoger, Thank you for responding!  That term \"municipal league\" is a key term that may have been missing from my search efforts.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-09-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Tammy Carr", 
  "id": 22172, 
  "score": "0", 
  "tags": [
    "Legal Issues", 
    "Leadership", 
    "Public Policy", 
    "Technology", 
    "Lean Government", 
    "Labor-Management Relations", 
    "Management", 
    "Next Generation of Managers", 
    "Organizational Development", 
    "Form of Government", 
    "Career Resources", 
    "Elected Officials"
  ], 
  "text": "\n\nAfter recently researching the GOSCMA regional states, North Dakota is of particular interest in terms of employment growth opportunities. However, aside from the Job Service of North Dakota website, how could professional oriented people find gainful employment careers?  The Job Service of North Dakota website is full of wonderful opportunities for skilled labor and a great resource which serves that purpose. Positions which would require higher levels of education and professional experience seem to be somewhat limited therein, as well, North Dakota does not post jobs through the ICMA.org website for career seekers either. Any information on how to ensue this quest will be immeasurably appreciated.\n\n", 
  "title": "Employment Inquiry", 
  "when": "21-09-2012"
}