{
  "answer_by": null, 
  "answers": [
    {
      "author": "Eric Cline", 
      "score": "0", 
      "text": "\n\nLeslie,\nGood afternoon. There are no easy or consistent answers to this question. I experienced similar problems in my last community and my first year there we had major communication issues between the elected Board and the various departments. I implemented changes and had some success, but more work remained.\nA starting point for these discussions should be what does the elected body want to accomplish with its budget process? If you lack a strategic plan and/or any performance measures, then that is a simple way to begin. You may not need specifics but there \"temperature\" may suffice.\nAlso, do any other guiding documents such as a Capital Improvements Plan exist? This will help identify what purchases are up and the document will be helpful in deciding what to push off.\nA lot of this discussion is going to be dictated by your internal culture. Just be honest with your departments and keep them constantly informed.\nGood luck.\n\n\nLeslie,\n\nGood afternoon. There are no easy or consistent answers to this question. I experienced similar problems in my last community and my first year there we had major communication issues between the elected Board and the various departments. I implemented changes and had some success, but more work remained.\n\nA starting point for these discussions should be what does the elected body want to accomplish with its budget process? If you lack a strategic plan and/or any performance measures, then that is a simple way to begin. You may not need specifics but there \"temperature\" may suffice.\n\nAlso, do any other guiding documents such as a Capital Improvements Plan exist? This will help identify what purchases are up and the document will be helpful in deciding what to push off.\n\nA lot of this discussion is going to be dictated by your internal culture. Just be honest with your departments and keep them constantly informed.\n\nGood luck.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-12-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Leslie Beauregard", 
  "id": 21561, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nGood Morning:\nI am sure to open up the philosophical can of worms, but I am seeking some thoughts and practical strategies at having that very difficult discussion with City departments about providing service level and program cuts to help us balance next year’s budget.  In the past, we have been somewhat successful but regardless, games are played and the most politically popular programs are put on the table.  Also, we are working on a performance management initiative which should provide tools for better decision making down the road - but we are not there yet.  In the meantime, I would like to hear from others who have had success with those discussions and received the outcomes you wanted.\nThanks for your help!\n\n", 
  "title": "Budget Reductions - Conversations with Departments about Program and Service Cuts", 
  "when": "16-12-2011"
}