{
  "answer_by": "15-08-2014", 
  "answers": [
    {
      "author": "Robert Carty", 
      "score": "1", 
      "text": "\n\nThat's a great question, and all those ideas are certainly intermixed. Your organization may or may not already have a mission and vision statement, and you're correct that the governing body (and likely the community) need to be a part of any changing or creating that happens to those core values. It might be time to revisit that, but it might not.\nIf you want to go the B-track, one key question you could ask to compliment those without trying to change them is to start with the question, \"how do we want to work together?\" as staff. and, \"how do we want to treat/value each other?\" This way you will initiate a culture change conversation and lay out the respect, ethical base, transparency, accountability, etc. that gets to the heart of making your organization more productive, accountable, and fun. Without tampering with the mission/vision.\nTeams and departments can have their own mission and vision that should feed to the overall mission and vision, and that's another path you could take.\nIt could also turn out that, in pursuing the B-track, enough energy gets built up to approach the governing body with support to revisit or create the A-track.\n\n\nThat's a great question, and all those ideas are certainly intermixed. Your organization may or may not already have a mission and vision statement, and you're correct that the governing body (and likely the community) need to be a part of any changing or creating that happens to those core values. It might be time to revisit that, but it might not.\nIf you want to go the B-track, one key question you could ask to compliment those without trying to change them is to start with the question, \"how do we want to work together?\" as staff. and, \"how do we want to treat/value each other?\" This way you will initiate a culture change conversation and lay out the respect, ethical base, transparency, accountability, etc. that gets to the heart of making your organization more productive, accountable, and fun. Without tampering with the mission/vision.\nTeams and departments can have their own mission and vision that should feed to the overall mission and vision, and that's another path you could take.\nIt could also turn out that, in pursuing the B-track, enough energy gets built up to approach the governing body with support to revisit or create the A-track.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-07-2014"
    }, 
    {
      "author": "Cheryl Hilvert", 
      "score": "1", 
      "text": "\n\nHi Curry!   I really like the way you are approaching the conversation on organizational values.  As a former manager whose organization did a lot of work on \"culture development,\"   I totally agree that the organizational values are \"owned\" by those in the organization (staff and elected officials too!)  \nEvery organization has a culture.  You just hope that yours is one that embodies the type of values that we all want to see in our organizations.    \nPerhaps a good place to start is to ask employees what types of values they see within the organization presently.  Then ask what type of values they believe they should see.  The gap will point you in the direction of work that needs to be done to more fully develop a positive work culture.  \nOnce this has been done, I agree with Rob Carty that enough energy gets built up within the organization to revisit vision as well as strategic goals and objectives and have the full support of everyone in the organization to accomplish the necessary work to fulfill that mission/vision.\nIn reality both the mission/vision as well as culture development work are critical to any organization.  Often we spend too much time focusing on the mission/vision and pay little attention to the culture of the organization.  If we do both, we can truly become a higher performing organization.\nThese are some of the key principles of high performance organization strategies which has been identified by ICMA's CMS as a leading practice for local governments.  You can learn more about HPO strategies by visiting the Center for Management Strategies website at http://icma.org/en/results/management_strategies/leading_practices/hpowww.icma.org/strategies \nYou may also want to visit the Center for Management Strategies blog, which contains a number of blog posts that relate to organizational culture development.  Visit the blog at http://icma.org/en/icma/knowledge_network/blogs/blog/50/Center_for_Management_Strategies  and look through the many pages of blogs that have been compiled on not only culture and values work, but other critical organizational development approaches as well.\nI applaud you for recognizing the importance of organizational values/culture and also recognizing that it really needs to be much more than a stated list that hangs on the wall that may or may not be reflective of what the real values of the organization may be.  Go ahead and ask your employees what the values are.  You may be very pleasantly surprised or may quickly learn about the work that needs to be done to become the type of organization you want to be!!\n\n\nHi Curry!   I really like the way you are approaching the conversation on organizational values.  As a former manager whose organization did a lot of work on \"culture development,\"   I totally agree that the organizational values are \"owned\" by those in the organization (staff and elected officials too!)  \nEvery organization has a culture.  You just hope that yours is one that embodies the type of values that we all want to see in our organizations.    \nPerhaps a good place to start is to ask employees what types of values they see within the organization presently.  Then ask what type of values they believe they should see.  The gap will point you in the direction of work that needs to be done to more fully develop a positive work culture.  \nOnce this has been done, I agree with Rob Carty that enough energy gets built up within the organization to revisit vision as well as strategic goals and objectives and have the full support of everyone in the organization to accomplish the necessary work to fulfill that mission/vision.\nIn reality both the mission/vision as well as culture development work are critical to any organization.  Often we spend too much time focusing on the mission/vision and pay little attention to the culture of the organization.  If we do both, we can truly become a higher performing organization.\nThese are some of the key principles of high performance organization strategies which has been identified by ICMA's CMS as a leading practice for local governments.  You can learn more about HPO strategies by visiting the Center for Management Strategies website at http://icma.org/en/results/management_strategies/leading_practices/hpowww.icma.org/strategies   \nYou may also want to visit the Center for Management Strategies blog, which contains a number of blog posts that relate to organizational culture development.  Visit the blog at http://icma.org/en/icma/knowledge_network/blogs/blog/50/Center_for_Management_Strategies  and look through the many pages of blogs that have been compiled on not only culture and values work, but other critical organizational development approaches as well.\nI applaud you for recognizing the importance of organizational values/culture and also recognizing that it really needs to be much more than a stated list that hangs on the wall that may or may not be reflective of what the real values of the organization may be.  Go ahead and ask your employees what the values are.  You may be very pleasantly surprised or may quickly learn about the work that needs to be done to become the type of organization you want to be!!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-07-2014"
    }, 
    {
      "author": "Pamela Muse", 
      "score": "0", 
      "text": "\n\nGood Evening - you may want to review and register for the Alliance's \"Culture Values/Organizational Change  Webinar with David Childs CM Palmdale CA, former Deputy County Manager Washoe County, NV and former ICMA President.    Visit the webinar website for details at http://transformgov.org/m/en/CalendarEvent/101004/Managers_Forum_Organizational_Values_and_Culture_Change\n\n\nGood Evening - you may want to review and register for the Alliance's \"Culture Values/Organizational Change  Webinar with David Childs CM Palmdale CA, former Deputy County Manager Washoe County, NV and former ICMA President.    Visit the webinar website for details at http://transformgov.org/m/en/CalendarEvent/101004/Managers_Forum_Organizational_Values_and_Culture_Change\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-07-2014"
    }, 
    {
      "author": "Paul Shew", 
      "score": "0", 
      "text": "\n\nCurry,  Please pardon coming to your conversation past your date that you required input, but you inspired excellent ideas with comments from Robert, Cheryl and Pamela.  \"How do you want to work together\", is probably an idea that many have not considered.  We plan to participate in David's forum as well, exactly for the reason we reviewed the comments raised by Curry's question.  Thanks to all of you.\n\n\nCurry,  Please pardon coming to your conversation past your date that you required input, but you inspired excellent ideas with comments from Robert, Cheryl and Pamela.  \"How do you want to work together\", is probably an idea that many have not considered.  We plan to participate in David's forum as well, exactly for the reason we reviewed the comments raised by Curry's question.  Thanks to all of you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-08-2014"
    }
  ], 
  "answers_count": 4, 
  "author": "Curry Clifford", 
  "id": 23244, 
  "score": "0", 
  "tags": [
    "Strategic Planning", 
    "Organizational Development"
  ], 
  "text": "\n\nI am about to embark here in my municipality ( 90,000 pop ) on designing a project that will lead to employee created organizational values.\nI’ve done a little research, spoken to staff in other municipalities about this, and would appreciate any suggestions on what makes for a good process to do this.\nOne of the issues I am struggling with is whether and how to link organizational values to organizational mission and vision in a government setting. One the one hand, conventional approaches to strategic planning and to developing organizational values would suggest that the values need to flow from the mission and values. On the other hand, in a government setting, the mission and vision is really about what the elected government itself wishes to achieve and what business it is in – decisions that, rightfully, need to be made by people elected to represent the community.  (Of course, the municipal administration needs to be involved in formulating vision and mission, but that is not, at the end of the day, their decision.) Organizational values, on the other hand are owned by the employees of the organization in my view in order to be effective and are not matters decided by the elected officials. \nSo how to right this seeming dilemma? That is a key (starting) piece I am struggling with. My bias is towards the second and say, regardless of the vision and mission of our municipality, here are the things that we will value in how we conduct ourselves and our business. These values, in turn, will drive our systems and processes (whether recruitment, performance management, procurement process, council staff relations- a very wide range of items) and will be what we will use as our touch stone when confronted with new issues and with ethical questions.\nIn summary, I’d appreciate thoughts then overall on good processes to arrive at organizational values in a government setting.\n\n", 
  "title": "Good processes for developing organizational values in a government setting", 
  "when": "28-07-2014"
}