{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "1", 
      "text": "\n\nHi Melissa, \nThank you for your question on branding. Here is a resource which I believe you may find useful in figuring out how to brand your organization. It is a past blog post that covers the entire branding process from start to finish as well as best practices and what to avoid. http://icma.org/en/BlogPost/529/Knowledge_Network_Community_Branding_Resources\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nHi Melissa, \n\nThank you for your question on branding. Here is a resource which I believe you may find useful in figuring out how to brand your organization. It is a past blog post that covers the entire branding process from start to finish as well as best practices and what to avoid. http://icma.org/en/BlogPost/529/Knowledge_Network_Community_Branding_Resources\n\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "19-11-2013"
    }, 
    {
      "author": "Richard Hoon", 
      "score": "0", 
      "text": "\n\nRobin has provided a lot of valuable information within the link.  As you know, promotion of your brand and its inherent values & goals goes beyond vague posters and limited swag and can be heavily influenced by the amount budgeted.  If funds are limited, hit hard on the low hanging fruit - such as creative Facebook and other social media posts, a dedicated page on the City website, etc.  If you haven't already partnered with other City organizations to establish the brand, do so now.  Their buy-in speaks volumes to the public and shows a unified group.  They, as well as elected officials and City employees should be emissaries of your brand and those of your core values.  But its important that they know what it truly means...not just a scripted fascade.\n\n\nRobin has provided a lot of valuable information within the link.  As you know, promotion of your brand and its inherent values & goals goes beyond vague posters and limited swag and can be heavily influenced by the amount budgeted.  If funds are limited, hit hard on the low hanging fruit - such as creative Facebook and other social media posts, a dedicated page on the City website, etc.  If you haven't already partnered with other City organizations to establish the brand, do so now.  Their buy-in speaks volumes to the public and shows a unified group.  They, as well as elected officials and City employees should be emissaries of your brand and those of your core values.  But its important that they know what it truly means...not just a scripted fascade.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-11-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Melissa Mundt", 
  "id": 22843, 
  "score": "0", 
  "tags": [
    "Organizational Development"
  ], 
  "text": "\n\nHow does your organization promote a desired culture, including values and goals?  \nWe have a strong organizational culture program, entitled Excellence Through People.  We are going through a re-branding effort and trying to figure out what types of medium others are using to promote their values and goals.\nIn the past we have used a single poster that did not detail the specifics, just stated the title of our program.  We have also developed a visual concept of all of the components of what makes up Excellence Through People in the form of a stool that has lots of wording on it to convey the the concepts.  \nWe have also had the typical coffee mugs and writing tools like pens and pencils with Excellence Through People placed on them.  If you have other means that you have used to brand your organizational cultural desires, we would be interested in hearing from you!  We would like to share them with our branding team!\n\n", 
  "title": "Branding-Organization's Cultural Values and Goals", 
  "when": "18-11-2013"
}