{
  "answer_by": null, 
  "answers": [
    {
      "author": "Sarah Nandawula", 
      "score": "0", 
      "text": "\n\n\n\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-03-2012"
    }, 
    {
      "author": "Paul Shew", 
      "score": "0", 
      "text": "\n\nNiel,\nOne sized answer will not fit all situations, but we have had some success in bringing the groups together on topics in which they may share an interest first; so that we have an on-going dialogue when a crisis situation arises.  For example, in Westchester County we encountered large group of day laborers on a regular basis in the Central Business District.  We worked to understand who was represented in the group (it is not sufficient to use Census terms in describing groups, you will need to be more specific to a country); and then to attempt to understand what it is that they are seeking.  By better understanding those elements, you might have a better shot at getting community support in working on collabortive projects with them and the community at large.\nPeter Block also has written on approaches similar to that, and you might look at his books.  (Community of Understanding, etc)\nGood luck.  Hope this delayed response finds some usefulness.\n\n\nNiel,\nOne sized answer will not fit all situations, but we have had some success in bringing the groups together on topics in which they may share an interest first; so that we have an on-going dialogue when a crisis situation arises.  For example, in Westchester County we encountered large group of day laborers on a regular basis in the Central Business District.  We worked to understand who was represented in the group (it is not sufficient to use Census terms in describing groups, you will need to be more specific to a country); and then to attempt to understand what it is that they are seeking.  By better understanding those elements, you might have a better shot at getting community support in working on collabortive projects with them and the community at large.\n\nPeter Block also has written on approaches similar to that, and you might look at his books.  (Community of Understanding, etc)\nGood luck.  Hope this delayed response finds some usefulness.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-08-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "Niel Curley", 
  "id": 21735, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nIn an excerpt from Professor Benoy Jacob in Diversity and Good Governance: Can I Have My Cake and Eat it Too, Ideas Quarterly, Winter 2012, “The more diverse a jurisdiction (usually measured in terms of demographic characteristics) the less effective the government may be at providing public services.  This can be particularly true for the provision of services such as local infrastructure, garbage collection services, and public schools.\"  How is your community addressing the needs of various groups that can be competitive to one another?\nhttp://transformgov.org/en/Article/101737/Diversity_and_Good_Governance_Can_I_Have_My_Cake_and_Eat_It_Too\n\n", 
  "title": "How does your community unify a diverse population?", 
  "when": "05-03-2012"
}