{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nJust keep trying, something will happen.  Do not start to doubt yourself n the process, these are tough and very competitive times for everyone and so will take longer then normal with several almost made it experiences.\n\n\nJust keep trying, something will happen.  Do not start to doubt yourself n the process, these are tough and very competitive times for everyone and so will take longer then normal with several almost made it experiences.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2010"
    }, 
    {
      "author": "Susan Thorpe", 
      "score": "0", 
      "text": "\n\nPeni - I would suggest broadening your search to include management analyst or budget analyst type positions, or assistant director positions in areas where you have gained experience.  The analyst-type positions are more numerous and they can help you get your foot in the door in an organization ,where you can demonstrate your abilities and then branch out into other opportunities that arise.\n\n\nPeni - I would suggest broadening your search to include management analyst or budget analyst type positions, or assistant director positions in areas where you have gained experience.  The analyst-type positions are more numerous and they can help you get your foot in the door in an organization ,where you can demonstrate your abilities and then branch out into other opportunities that arise.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-10-2010"
    }, 
    {
      "author": "William Emerson", 
      "score": "0", 
      "text": "\n\nI'm exploring the same waters, Peni.  I'm jealous of your volunteer gig!  Susan's right, of course: it's much easier to lead an organization where you are known and trusted, so starting a rung down makes sense if there's a community you are passionate about. If you're more focused on the job than the community, then, like Roderick said, keep at it: if you're that close, something will come along.  I think its a great idea to stay current by attending the conference in San Jose -- see you there!\n\n\nI'm exploring the same waters, Peni.  I'm jealous of your volunteer gig!  Susan's right, of course: it's much easier to lead an organization where you are known and trusted, so starting a rung down makes sense if there's a community you are passionate about. If you're more focused on the job than the community, then, like Roderick said, keep at it: if you're that close, something will come along.  I think its a great idea to stay current by attending the conference in San Jose -- see you there!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-10-2010"
    }, 
    {
      "author": "Peni Basalusalu", 
      "score": "0", 
      "text": "\n\nThank you very much Susan, Roderick and William for your thoughts and words of encouragement.  I value them and after attending the ICMA conference, your recommendations is even more valuable.\n\n\nThank you very much Susan, Roderick and William for your thoughts and words of encouragement.  I value them and after attending the ICMA conference, your recommendations is even more valuable.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-10-2010"
    }, 
    {
      "author": "LARRY SEURYNCK", 
      "score": "0", 
      "text": "\n\n\n\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-12-2010"
    }
  ], 
  "answers_count": 5, 
  "author": "Peni Basalusalu", 
  "id": 20499, 
  "score": "0", 
  "tags": [
    "Citizen Education", 
    "Career Resources", 
    "Management"
  ], 
  "text": "\n\nLike many of you did, I have a goal of becoming an ACM within the next 5 years.  I am starting my 11th month of volunteering in a CM's office (part-time) while aggresively looking for a full-time opportunity and doing odd jobs here and there to support my family, after being laid off form my last position.  I have had several interview opportunities for positions in CM's office and other depts' but keep lossing out as a top 2 or 3 candidate to former ACM's or Department Heads' who were laid off as well.  What would be your recommendation for someone like me that's looking for that opportuity, knowing that I have 8 years of experience with an MPA degree but facing a tough battle?  I'm looking forward to doing some networking at the upcoming ICMA conference but would really like to hear your ideas on my predicament.\n\n", 
  "title": "What else to do to keep beating the unemployment blues?", 
  "when": "11-10-2010"
}