{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nFirst and foremost, I would offer the observation that the two most effective grants search engines are grants.gov (which is the federal source point), and the Foundation Center (which is top notch with its thousands of current reports on Foundations and Foundation grant programs)...  Having served in the capacity of a grant procurement specialist with a city and a county government, what I found to be most effective was having one point person with whom to work in each department and the primary role of that point person was a)tell me the department's needs in terms of programs, services, and projects and b)keep me in the loop on the progress of applications.  I would also emphasize it is important to never discount potential grant opportunities with Foundations and Corporate Philanthropies.  I would also point out that many federal agencies now offer the opportunity for being alerted via email to when they issue grant announcements.  I realize this does not directly address the questionnaire but I hope the experience I have shared helpes in the focus of the information being sought.\n\n\nFirst and foremost, I would offer the observation that the two most effective grants search engines are grants.gov (which is the federal source point), and the Foundation Center (which is top notch with its thousands of current reports on Foundations and Foundation grant programs)...  Having served in the capacity of a grant procurement specialist with a city and a county government, what I found to be most effective was having one point person with whom to work in each department and the primary role of that point person was a)tell me the department's needs in terms of programs, services, and projects and b)keep me in the loop on the progress of applications.  I would also emphasize it is important to never discount potential grant opportunities with Foundations and Corporate Philanthropies.  I would also point out that many federal agencies now offer the opportunity for being alerted via email to when they issue grant announcements.  I realize this does not directly address the questionnaire but I hope the experience I have shared helpes in the focus of the information being sought.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-07-2012"
    }, 
    {
      "author": "Jeanna Cox", 
      "score": "0", 
      "text": "\n\nQ1: Yes; Q2:Yes; Q3: Daily; Q4: I am not a manager, I am the person designated to do research, and yes I think an individual S/B designated I believe that the most effective method of \"funding opportunity\" approach is a team.; Q5: Yes, someone should attend and regular be active with eCivis tools to improve both the research skill set and also the grant writing skill set. Q6: I would like to know what other counties are using grant funding for (i.e. social service programs, capital improvement; roads; waste management); Q7: N/A (however, I have worked with some municipalities in my county); Q8: N/A (I have attend community meetings regarding grant development in my county); Q9: N/A (I have established a grants committee in a division of our county government.  It is currently still in development stages but I would tell you having grants committee is crucial to the success of implementing grants into your over all budgetary operations.\n\n\nQ1: Yes; Q2:Yes; Q3: Daily; Q4: I am not a manager, I am the person designated to do research, and yes I think an individual S/B designated I believe that the most effective method of \"funding opportunity\" approach is a team.; Q5: Yes, someone should attend and regular be active with eCivis tools to improve both the research skill set and also the grant writing skill set. Q6: I would like to know what other counties are using grant funding for (i.e. social service programs, capital improvement; roads; waste management); Q7: N/A (however, I have worked with some municipalities in my county); Q8: N/A (I have attend community meetings regarding grant development in my county); Q9: N/A (I have established a grants committee in a division of our county government.  It is currently still in development stages but I would tell you having grants committee is crucial to the success of implementing grants into your over all budgetary operations.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-08-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Pamela Muse", 
  "id": 22031, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting"
  ], 
  "text": "\n\nAn alliance member is asking for help with their grants management efforts.  Attached are their goals to improve the grants function within the City to complete by June 2013; particularly interested in goals #1 and #2. \nThe first step is sending out a survey to all City staff in reference to use of a grants locator system and current communications between the grants division and all city departments. \nThe member is wondering if you have thoughts, ideas or surveys that could assist in generating more reliable or better suited survey questions.  See the draft questions they have so far below:\nThank you in advance for your assistance. \n\nDo you know what eCivis is?\nYes\nNo\nHave you used eCivis to help your department search for grant opportunities?\nYes\nNo\nIf you have used eCivis to search for grant opportunities, how often to do you log onto eCivis?\nWeekly\nMonthly\nEvery Six Months\nOnce a year\nNot applicable\nAs a manager are you willing to designate an individual/s to assist with researching grant opportunities for your department and increase revenue for the City of Maricopa?\nYes\nNo \nNot Applicable\nAs a manager are you willing to designate an individual/s to attend a 15 minute online training session on how to use of eCivis?\nYes\nNo\nMaybe\nAre you interested in knowing how many times a year eCivis is used and what types \nCommunication\nHave you work with the grants division in City Hall to secure grant funding for your department?\nYes \nNo\nHave you attended a City Wide Grants Committee meeting?\nYes\nNo\nNot Applicable\nOn a scale of 1-4 (4 being the highest) how helpful was the grants committee in keeping you informed of grant opportunities, department award etc.?\nNot helpful at all\nSlightly helpful\nHelpful\nVery Helpful\nNot applicable\n\n\n", 
  "title": "Internal Grants Use/Management Survey", 
  "when": "16-07-2012"
}