{
  "answer_by": null, 
  "answers": [
    {
      "author": "Derek Johnson", 
      "score": "0", 
      "text": "\n\nHi Yvette,\nBelow is the special events policy for the City of La Porte, Texas. Some of your questions, such as lead department (Parks and Recreation) and average length of time between application and approval/denial (10 day turnaround for approval/denial, 5 day turnaround for an appeal) are answered within. \nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/13114/Special_Events_Policy\nFor the others, I would recommend contacting one of the Knowledge Network's self-identified experts on the Special Events topic page, as they would most likely be able to assist you further (they can be found on the right-hand side of the page):\nhttp://icma.org/en/icma/knowledge_network/topics/kn/Topic/246/Special_Events#Tab=Overview\nHope this helps you in your search. Good luck.\nDerek Johnson\n\n\nHi Yvette,\n\nBelow is the special events policy for the City of La Porte, Texas. Some of your questions, such as lead department (Parks and Recreation) and average length of time between application and approval/denial (10 day turnaround for approval/denial, 5 day turnaround for an appeal) are answered within. \n\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/13114/Special_Events_Policy\n\nFor the others, I would recommend contacting one of the Knowledge Network's self-identified experts on the Special Events topic page, as they would most likely be able to assist you further (they can be found on the right-hand side of the page):\n\nhttp://icma.org/en/icma/knowledge_network/topics/kn/Topic/246/Special_Events#Tab=Overview\n\nHope this helps you in your search. Good luck.\n\nDerek Johnson\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-02-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Yvette Blackford", 
  "id": 20787, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Parks and Recreation", 
    "Process Improvement", 
    "Citizen Engagement"
  ], 
  "text": "\n\nSunnyvale sees an average of 20 special/community events held each year. We define a Special Event as a program or set of activities that is unique or out-of-the norm in nature, requires significant effort to plan and implement, and requires City permits or utilizes City resources. Special events include, but are not limited to:  parades, festivals, street fairs, sidewalk sales, outdoor music concerts, block parties, or athletic events such as runs, walkathons, bicycle races, etc.\nThe City created a process to evaluate these proposed events to facilitate the availability of any required City services or permits. The process includes an internal review by multiple departments of our special event application. Each department provides input on what conditions, if any, should be established for the event (obtaining appropriate permits, paying facility rental fees/deposits, etc.). \nOur City is currently evaluating our process to make it more efficient. We are interested in hearing from folks regarding: \n• How does your City handle these types of events?\n• Do you use any software to help you manage the process?\n• Which department is the lead on this process?\n• How far in advance does your City require an application/request be submitted?\n• How much do you charge for processing (application fee)?\n• What is the average length of time between the time of application and the approval/denial?\nAny information would be great! If you are interested, our website for events can be found at Events.inSunnyvale.com\n\n", 
  "title": "Community/Special Events Process?", 
  "when": "15-02-2011"
}