{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "2", 
      "text": "\n\nHi, Matt!  I can really only speak from personal experience here, because I fill a role very much like the one you're describing in the City of Raleigh Facilities & Operations division.  The biggest thing that attracted me to the position was the fact that, as a current MPA student who doesn't really know where she wants to specialize, I knew it would expose me to several different service areas and departments within the city.  It's also been the perfect workload for being in school, since my days are full, but the overwhelming ones are few and far between.  I'm not really sure how much experience you're looking for with your candidates (I had almost three years going in), but I do think opening up your search to nearby grad students, perhaps through university career centers and MPA listservs would be a great idea.  The NC State MPA program sends out nearby job listings at least weekly, and in most cases, the employers ask to be included in the emails.  Plus, my job has been the best \"foot in the door\" I could have asked for!\n\n\nHi, Matt!  I can really only speak from personal experience here, because I fill a role very much like the one you're describing in the City of Raleigh Facilities & Operations division.  The biggest thing that attracted me to the position was the fact that, as a current MPA student who doesn't really know where she wants to specialize, I knew it would expose me to several different service areas and departments within the city.  It's also been the perfect workload for being in school, since my days are full, but the overwhelming ones are few and far between.  I'm not really sure how much experience you're looking for with your candidates (I had almost three years going in), but I do think opening up your search to nearby grad students, perhaps through university career centers and MPA listservs would be a great idea.  The NC State MPA program sends out nearby job listings at least weekly, and in most cases, the employers ask to be included in the emails.  Plus, my job has been the best \"foot in the door\" I could have asked for!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-10-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Matthew Reges", 
  "id": 22222, 
  "score": "0", 
  "tags": [
    "Human Resources"
  ], 
  "text": "\n\nAs you know, the job of Administrative Assistant has become much more complex, professional, and demanding. We now expect these staff to enable and problem solve for entire departments. \nWhat advice can you offer on how to recruit candidates who can meet today's variety of needs? Do you know of resources to reach and attract the best administrative professionals without engaging search firms?\nBackground:\nOur city's Social Services department has an Administrative Assistant vacancy; the position supports the Chief of Administration, one of three team leaders (the others being Benefits and Social Work). The assistant has duties in personnel support, office operations, and management support, ranging from reception, employee timekeeping, and supply purchases to budget work in SAP, helping with the annual report, and background checks for recruitments --a whirlwind variety not unusual for the job title these days. We have competitive pay in the $40s and great benefits. We've tried two rounds of recruitment and received nearly 800 applications without finding just the right fit.\n\n", 
  "title": "Recruiting tips on the hardest position to fill: Administrative Assistant", 
  "when": "15-10-2012"
}