{
  "answer_by": null, 
  "answers": [
    {
      "author": "Edward Chew", 
      "score": "0", 
      "text": "\n\nIt's completely acceptable to contact the HR Departments of agencies that are doing a search for a CM/ACM. In California, salary information must be released as part of CA's Public Records Act. I would be very surprised if any agency doing an active recruitment would not provide the salary range information.  Same for a recruiting firm recruiting for a CM/ACM position. It doesn't make sense that they wouldn't have that information to share.\n\n\nIt's completely acceptable to contact the HR Departments of agencies that are doing a search for a CM/ACM. In California, salary information must be released as part of CA's Public Records Act. I would be very surprised if any agency doing an active recruitment would not provide the salary range information.  Same for a recruiting firm recruiting for a CM/ACM position. It doesn't make sense that they wouldn't have that information to share.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-06-2012"
    }, 
    {
      "author": "Mark Abeles-Allison", 
      "score": "0", 
      "text": "\n\nI agree.  Another question you could ask would be what the last manager's salary was.\n\n\nI agree.  Another question you could ask would be what the last manager's salary was.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-06-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 21938, 
  "score": "0", 
  "tags": [
    "Hiring", 
    "Career Resources"
  ], 
  "text": "\n\nI'm beginning a job search in earnest for my first position as an ACM or CM.  I'm finding that a surprising number of postings do not list any sort of salary range.  I do not want to waste my time or the time of a council or search firm by applying for jobs with a salary range that is either below what I am making now or would be of such a small increase that it wouldn't be worth pursuing.\nI've looked at ICMA's salary table (Excel file) as well as the compensation guide.  These are helpful, but there is still a very large gap in terms of salary expectations for a particular city.  Some of the methods I've used for trying to determine a range include: the city's administration budget, news articles that state the previous CM's salary, Google searches, etc.  In some cases, I am able to find out what the previous manager's salary was and get a range from that, but other times there is nothing at all by which to gauge compensation.\nAgain, my main concern is starting a process that wastes the time of numerous people due to a lack of information on my part.  I have no qualms about contacting a search firm to ask for a range, but would it be acceptable to contact the HR department of a city that is conducting its own search to do the same thing?  Obviously, I could get the information by making an open records request, but that seems like it would be a sure-fire way to eliminate myself from the outset.\nAny insight would be much appreciated.\n\n", 
  "title": "Resources for determining salary range?", 
  "when": "05-06-2012"
}