{
  "answer_by": null, 
  "answers": [
    {
      "author": "Cory Fleming", 
      "score": "0", 
      "text": "\n\nJason - \nThere are a number of mobile apps popping up -- CitySourced, SeeClickFix to name two, and many local governments are developing their own apps as you point out --but unless the apps are tied to and integrated into some type of system for handling the responses within the local government, you'll be creating a new work stream for staff already stretched during tight bugdet times.  If you haven't already done so, I'd encourage you to sit down with Milton's service department directors who would most stand to benefit from the technology -- Public Works, Transportation, Code Enforcement, etc. -- to discuss how they currently handle service requests, what work order management software they have in place, and what information they need in order to fulfill service requests.  Have that information in hand when you talk to the vendors and find out how their app would work with what you already have in place before you make any decisions.\n\n\nJason - \n\nThere are a number of mobile apps popping up -- CitySourced, SeeClickFix to name two, and many local governments are developing their own apps as you point out --but unless the apps are tied to and integrated into some type of system for handling the responses within the local government, you'll be creating a new work stream for staff already stretched during tight bugdet times.  If you haven't already done so, I'd encourage you to sit down with Milton's service department directors who would most stand to benefit from the technology -- Public Works, Transportation, Code Enforcement, etc. -- to discuss how they currently handle service requests, what work order management software they have in place, and what information they need in order to fulfill service requests.  Have that information in hand when you talk to the vendors and find out how their app would work with what you already have in place before you make any decisions.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-07-2011"
    }, 
    {
      "author": "Toni Shope", 
      "score": "0", 
      "text": "\n\nHi Jason.  The Alliance has a Corporate Partner, App-Order, that does this, App-Order Corporate Headquarters & Training Center • 1094 E Sahara Ave., Las Vegas, NV 89104 • Phone 800.884.7820.  They are providing complimentary apps to Alliance Members.  If you want to learn more give me a call (800) 777-2509.\n\n\nHi Jason.  The Alliance has a Corporate Partner, App-Order, that does this, App-Order Corporate Headquarters & Training Center • 1094 E Sahara Ave., Las Vegas, NV 89104 • Phone 800.884.7820.  They are providing complimentary apps to Alliance Members.  If you want to learn more give me a call (800) 777-2509.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-07-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Jason Wright", 
  "id": 21195, 
  "score": "0", 
  "tags": [
    "Technology"
  ], 
  "text": "\n\nI am the communications manager/web site administrator for the City of Milton, a northern suburb of Atlanta. We have a Web site through Gov Office's content management system and use social media regularly. \nThe next step for our government is a cell phone application. I am looking for it to have a news feed, calendar, \"report a problem' function (with photo support), GPS mapping, staff contacts, a \"how are we doing\" survey and social media tie in (Facebook, Twitter, flickr). \nI've contacted Macroview Labs -- the company that did Arlington's app mentioned in the news feed -- and a few others. But I feel a bit lost. Does anyone know of good government cell phone app developers? \nIt seems like most are for business, or governments have their own development teams. That's way out of our reach. \nAny help I could get would be most appreicated. Thank you.\n\n", 
  "title": "Moblie app developers", 
  "when": "07-07-2011"
}