{
  "answer_by": null, 
  "answers": [
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nOur (Charlottesville, VA) Parks department hires batches of seasonal staff.  We advertise the positions through the end of the fiscal year (applications accepted for several months rather than 2-4 weeks), and the department pays the part-time seasonal wages from a single fund: there is a limited fund but relative discretion in hours, wages, and number of hires. HR processes applications through the NeoGov tracking system and refers applicants to hiring managers weekly. All applications come in centrally, and the parks cannot hire outside of this system or off-list; job fairs are for information only. The parks' managers interview, hire, and train on a rolling basis through the summer. This process makes it easier to staff up quickly, adjust staffing to workload, and react to the expected degree of turnover.\nWe also use this kind of batch hiring process for bus drivers, some maintenance positions, and with certain variations for public safety positions. \nDoes that help?\n\n\nOur (Charlottesville, VA) Parks department hires batches of seasonal staff.  We advertise the positions through the end of the fiscal year (applications accepted for several months rather than 2-4 weeks), and the department pays the part-time seasonal wages from a single fund: there is a limited fund but relative discretion in hours, wages, and number of hires. HR processes applications through the NeoGov tracking system and refers applicants to hiring managers weekly. All applications come in centrally, and the parks cannot hire outside of this system or off-list; job fairs are for information only. The parks' managers interview, hire, and train on a rolling basis through the summer. This process makes it easier to staff up quickly, adjust staffing to workload, and react to the expected degree of turnover.\n\nWe also use this kind of batch hiring process for bus drivers, some maintenance positions, and with certain variations for public safety positions. \n\nDoes that help?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-05-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Ana Bradshaw", 
  "id": 21843, 
  "score": "0", 
  "tags": [
    "Human Resources", 
    "Healthy Living"
  ], 
  "text": "\n\nDo any other cities have policies regarding batch hiring (i.e. lifeguards for summer) or pre-screening applicants to create an applicant pools for positions with high turnover (maintenance workers or administrative staff) for all departments to draw from?\nFor batch hiring how do you hire and process efficiently? Do you do job fairs where applicants can be hired an processed on the spot?\nFor applicant pools, how do you advertise (continuous, limited time)? Who screens the applicants? How do departments request a pre-screened applicant? Are departments required to use applicant pools or can then choose to post the position separately? \nAny help is greatly appreciated!\n\n", 
  "title": "Applicant pools and batch hiring", 
  "when": "20-04-2012"
}