{
  "answer_by": null, 
  "answers": [
    {
      "author": "Richard Manchester", 
      "score": "1", 
      "text": "\n\nAnthony,\nWe are working on a new fees & charges policy that will be \"cost based pricing\".  We may not recover 100% for all programs, but City Council and staff will be making a deliberate choice on what percentage of costs program groups will make. Ie, adult sports will recover 100-150% of costs while youth sports will recover 50-100% of costs. \nThe program will be rolled in over a 5-year time period with a maximum increase of 15% per year per program.\nAt leaset that is what I will be propsoing for consideration.\\\nRick\n\n\nAnthony,\nWe are working on a new fees & charges policy that will be \"cost based pricing\".  We may not recover 100% for all programs, but City Council and staff will be making a deliberate choice on what percentage of costs program groups will make. Ie, adult sports will recover 100-150% of costs while youth sports will recover 50-100% of costs. \nThe program will be rolled in over a 5-year time period with a maximum increase of 15% per year per program.\n\nAt leaset that is what I will be propsoing for consideration.\\\nRick\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "27-05-2010"
    }, 
    {
      "author": "Stephanie Klinkenberger", 
      "score": "1", 
      "text": "\n\nAccording to an administrative analyst with the Parks and Recreation Department with the City of Virginia Beach:\nWe have not changed our user fees policies due to budget constraints. Of course the difficult economic times do make us look closely at our fees and raise them where reasonable. The main driving forces of our fees are our Strategic Plan including tiered levels of pricing, priorities of the community and of course the market. We try not to raise a fee more often than every other year. We do not have a full break even policy. We do try to recover 100% of costs for our non-resident recreation membership fees. I’ve attached a copy of our latest Revenue and Pricing Plan. Let me know if you have further questions. Thanks.\n\n\nAccording to an administrative analyst with the Parks and Recreation Department with the City of Virginia Beach:\n\nWe have not changed our user fees policies due to budget constraints. Of course the difficult economic times do make us look closely at our fees and raise them where reasonable. The main driving forces of our fees are our Strategic Plan including tiered levels of pricing, priorities of the community and of course the market. We try not to raise a fee more often than every other year. We do not have a full break even policy. We do try to recover 100% of costs for our non-resident recreation membership fees. I’ve attached a copy of our latest Revenue and Pricing Plan. Let me know if you have further questions. Thanks.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-06-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "Zane Reynolds", 
  "id": 20029, 
  "score": "0", 
  "tags": [
    "Parks and Recreation"
  ], 
  "text": "\n\nTraditionally, it was common practice in all jurisdictions to set parks and recreation user fees intentionally low as a service to the community. User fees were not intended to fully recoup the capital and maintenance costs associated with a service, but were more intended to encourage user accountability or to offset marginal costs associated with the service. User fees, viewed as a regressive fee or tax, were kept artificially low as a service to all residents in the community. \nHowever, as local governments face increasing budget shortfalls many parks and recreation departments have been pressured increase user fees in order to fully recover all parks and recreation expenditures. \nMy question is this: \nHave you noticed any shift in user fee policies within your jurisdiction?\nHas your jurisdiction adopted a full break-even pricing policy?\nIf so, how did your jurisdiction approach raising the fees? \nWere some fees raised more than others?\nHow did you associate costs with each service?\n\n", 
  "title": "Break-Even Pricing Policies", 
  "when": "26-05-2010"
}