{
  "answer_by": "15-01-2013", 
  "answers": [
    {
      "author": "Maxwell Moline", 
      "score": "0", 
      "text": "\n\nHello Edwin,\nThe City of Shoreline has a policy to limit critical comments about staff performance to private communication.\nhttp://icma.org/Documents/Document/Document/3884 \nIn Tulsa, all incoming and outgoing correspondences are stored digitally and searchable online. http://icma.org/Documents/Document/Document/2837\nFinally, the City of Carrolton has all correspondence featuring citizen complaints or concerns forwarded to the City Manager. http://icma.org/Documents/Document/Document/12087\nI hope this helps to answer your question. Please let us know if you need any more help.\nMax Moline\nKnowledge Network Intern\nICMA\n\n\nHello Edwin,\n\nThe City of Shoreline has a policy to limit critical comments about staff performance to private communication.\nhttp://icma.org/Documents/Document/Document/3884 \n\nIn Tulsa, all incoming and outgoing correspondences are stored digitally and searchable online. http://icma.org/Documents/Document/Document/2837\n\nFinally, the City of Carrolton has all correspondence featuring citizen complaints or concerns forwarded to the City Manager. http://icma.org/Documents/Document/Document/12087\n\nI hope this helps to answer your question. Please let us know if you need any more help.\n\nMax Moline\nKnowledge Network Intern\nICMA\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-01-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Edwin Pattison", 
  "id": 22339, 
  "score": "0", 
  "tags": [
    "Performance Management and Analytics", 
    "Elected Officials", 
    "Citizen Engagement"
  ], 
  "text": "\n\nWhat is the typical policy on notifying the public / citizens of incoming city correspondence. This issue has become so controversial that the City Council has now requested a future agenda item to develop policy for notifying citizens of incoming city correspondence.\nThe reality is that a vocal small minority of citizens desires to use the city council package as a platform to \"publish\" attacks on the city and regularly submit much of the same false negative information. The current policy on incoming city correspondence is to list the \"date, from/to, and subject in the council agenda under \"correspondence.\"  If anyone desires a copy of the correspondence they can request a copy during business hours at the front desk.  The vocal minority are angered by this policy and want the entire text of their letters to the City published in the agenda package.  I am hoping other cities' may have dealt with this issue and have existing policy we can use as a comparison.\n\n", 
  "title": "Incoming City Correspondence", 
  "when": "21-12-2012"
}