{
  "answer_by": null, 
  "answers": [
    {
      "author": "Sarah Read", 
      "score": "0", 
      "text": "\n\nLuke - One of the issues here will be ensuring public understanding of why you are moving to a longer term CIP, and how, when and why that plan might be amended or changed over time as information changes.  It helps ensure smoother implementation of a long term plan to document key drivers and assumptions and then monitor those for change in ways the public understands. I used to work on long term energy plans, and the long term definitely helps you evaluate and analyze more data and trends. It also can lead to projections that are very vulnerable to change -  and as you know change will happen.  I think its very helpful to model a range of scenarios when looking at long term plans, and also look at how vulnerable various costs are to changes in key assumptions. A disadvantage of a longer term plan is that people can misunderstand its purpose and be upset when the plan is adjusted or fine tuned because its viewed as a \"change\".  So being very clear on the purpose of planning, the fact that there will be changes, and helping the public understand the different drivers and how different inputs are being used, are all important to sustaining the effectiveness of a longer term planning process.  You might find this series of blog posts useful as you think further about this: http://buildingdialogue.wordpress.com/2011/03/08/setting-yourself-up-for-evaluation/    Good luck!\n\n\nLuke - One of the issues here will be ensuring public understanding of why you are moving to a longer term CIP, and how, when and why that plan might be amended or changed over time as information changes.  It helps ensure smoother implementation of a long term plan to document key drivers and assumptions and then monitor those for change in ways the public understands. I used to work on long term energy plans, and the long term definitely helps you evaluate and analyze more data and trends. It also can lead to projections that are very vulnerable to change -  and as you know change will happen.  I think its very helpful to model a range of scenarios when looking at long term plans, and also look at how vulnerable various costs are to changes in key assumptions. A disadvantage of a longer term plan is that people can misunderstand its purpose and be upset when the plan is adjusted or fine tuned because its viewed as a \"change\".  So being very clear on the purpose of planning, the fact that there will be changes, and helping the public understand the different drivers and how different inputs are being used, are all important to sustaining the effectiveness of a longer term planning process.  You might find this series of blog posts useful as you think further about this: http://buildingdialogue.wordpress.com/2011/03/08/setting-yourself-up-for-evaluation/    Good luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-05-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Luke Baron", 
  "id": 22526, 
  "score": "0", 
  "tags": [
    "Strategic Planning", 
    "Finance and Budgeting", 
    "Planning"
  ], 
  "text": "\n\nI am a second year MPA student working with a mid-sized city transitioning from a 5 year to a 20 year CIP, and am interested in any advice/best practices you have for cities embarking on this process. \nWhat are the challenges in transitioning from a 5 year CIP to a longer-term year CIP (15-20yr)? What has been helpful for your municipality as you made this transition, and what did you wish you would have known earlier? What are the advantages and disadvantages of a longer-term planning horizon, and what advice do you have for cities embarking on this transition? Any insights and advice you have are helpful, and I am grateful for your help!\n\n", 
  "title": "How to transition from 5 year to a 15 or 20 year CIP?", 
  "when": "22-04-2013"
}