{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Scot,\nUnfortunately we do not have any resources at this time that are directly related to staffing zoning help desks but here it a link to an old question that discusses staffing innovations. Hopefully the answers will give you some ideas. http://icma.org/en/icma/knowledge_network/kn/Question/21053\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nHi Scot,\n\nUnfortunately we do not have any resources at this time that are directly related to staffing zoning help desks but here it a link to an old question that discusses staffing innovations. Hopefully the answers will give you some ideas. http://icma.org/en/icma/knowledge_network/kn/Question/21053\n\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-10-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Scot Ferris", 
  "id": 22802, 
  "score": "0", 
  "tags": [
    "Management"
  ], 
  "text": "\n\nI am looking for examples of how other municipalities staff their front counters.  \nCurrently our \"Land Development/Zoning\" front counter is staffed with one full time manager (me), two administrative staff who run the file room, etc.,and a rotating crew of eight planners who come out and work the front counter all day, for one day a week.\nBefore this arrangement we had one full time manager and two administrative assistants providing the zoning information.  After a RIF where we lost these positions, we went with the current configuration. Our current method ensures that the public gets high quality answers from professional staff, however at the cost of the disruption of the Planners routine.\nI am curious as to how other jurisdictions staff their front counters - does anyone else have rotating staff? Full time staff that work nothing but the front counter?  If yes, what level of staff?  How much of a value does your municipality put on this service?\nThanks in advance!\n\n", 
  "title": "Staffing for zoning front counter", 
  "when": "29-10-2013"
}