{
  "answer_by": "01-05-2012", 
  "answers": [
    {
      "author": "Robert Carty", 
      "score": "0", 
      "text": "\n\nSounds like a fun project! I think in larger governments, you might find this function fully staffed or spread out over several departments with a budget to use shared facilities; possibly coordinated by the chief PIO or other department head. In smaller governments it could be \"other duties as assigned\" to a deputy manager, someone in economic development, or public information. Parks & Recreation could also be in charge, given the responsibility over public spaces and summer activities. A tourism department or Convention & Visitor's Bureau, or other local agency, could also be the lead coordinating group.\nOften a great low cost solution is to engage one or a small team of interns and let them cut their teeth on such a great opportunity, with appropriate supervision. Event management is a high-detail activity, so adding that to one person's job duties without support or shifting some of their workload will reduce the quality of the events being planned, their current workload, or wear them out. \nWhatever you do, a team approach with a point person as the lead project manager is good no matter what the size of staff or budget.\n\n\nSounds like a fun project! I think in larger governments, you might find this function fully staffed or spread out over several departments with a budget to use shared facilities; possibly coordinated by the chief PIO or other department head. In smaller governments it could be \"other duties as assigned\" to a deputy manager, someone in economic development, or public information. Parks & Recreation could also be in charge, given the responsibility over public spaces and summer activities. A tourism department or Convention & Visitor's Bureau, or other local agency, could also be the lead coordinating group.\n\nOften a great low cost solution is to engage one or a small team of interns and let them cut their teeth on such a great opportunity, with appropriate supervision. Event management is a high-detail activity, so adding that to one person's job duties without support or shifting some of their workload will reduce the quality of the events being planned, their current workload, or wear them out. \n\nWhatever you do, a team approach with a point person as the lead project manager is good no matter what the size of staff or budget.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-04-2012"
    }, 
    {
      "author": "Maya Williams", 
      "score": "0", 
      "text": "\n\nAlso, keep in mind that the revenue from the use of those event venues can conceivably cover the cost of or help offset the cost of a position.\n\n\nAlso, keep in mind that the revenue from the use of those event venues can conceivably cover the cost of or help offset the cost of a position.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-06-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Susan Sullivan", 
  "id": 21860, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Local Culture", 
    "Housing & Community Development", 
    "Management", 
    "Citizen Engagement", 
    "Contracts"
  ], 
  "text": "\n\nWe have many fine venues in our city that are often unused:  a beautiful theatre on Main Street, an outdoor amphitheatre by the river, parks, etc.  The local Main Street Morgantown agency, funded by the City, wants to create a position where someone would work to bring acts, performers, theatre troupes, singers, plays, magicians, into these arenas to create a more fruitful event array in our City.  However, the city is not currently planning to hire any new employees.\nWhat other cities have a similar position?  Who is in charge - the City, or another local agency that works within the municipality?  How is doing a job like this approached?  There is much interest, yet little funds.\n\n", 
  "title": "How to Create a Job to Manage City Venues & Events", 
  "when": "30-04-2012"
}