{
  "answer_by": null, 
  "answers": [
    {
      "author": "Israel Murguia", 
      "score": "0", 
      "text": "\n\nThe following are a couple of grant programs that you may want to look into for your municipal renovation. First, there is a program administered by the U.S. Department of Agriculture, which provides grants to assist in the development of essential community facilities in rural areas and towns of up to 20,000 in population. You can find more information here: http://www.rurdev.usda.gov/HAD-CF_Grants.html\nSecondly, you may want to examine the Community Development Block Grant program that is funded by the Department of Housing and Urban Development and administered by state’s urban and housing department.  CDBG funds can be used for preservation and restoration of historic properties, however, in only low-income neighborhoods. Nevertheless, the CDBG program is a flexible program that provides communities with resources to address a wide range of unique community development needs. \nLastly, the National Trust for Historic Preservation has provided localities with funds for restoration projects. You can a variety of grant programs here: http://www.preservationnation.org/resources/find-funding/nonprofit-public-funding.html\n\n\nThe following are a couple of grant programs that you may want to look into for your municipal renovation. First, there is a program administered by the U.S. Department of Agriculture, which provides grants to assist in the development of essential community facilities in rural areas and towns of up to 20,000 in population. You can find more information here: http://www.rurdev.usda.gov/HAD-CF_Grants.html\n\nSecondly, you may want to examine the Community Development Block Grant program that is funded by the Department of Housing and Urban Development and administered by state’s urban and housing department.  CDBG funds can be used for preservation and restoration of historic properties, however, in only low-income neighborhoods. Nevertheless, the CDBG program is a flexible program that provides communities with resources to address a wide range of unique community development needs. \n\nLastly, the National Trust for Historic Preservation has provided localities with funds for restoration projects. You can a variety of grant programs here: http://www.preservationnation.org/resources/find-funding/nonprofit-public-funding.html\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-08-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Reid Wodicka", 
  "id": 20348, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Housing & Community Development", 
    "Planning"
  ], 
  "text": "\n\nDoes anyone have knowledge of grant programs for local government to \"reclaim\" old buildings which a town still owns, but pretty much does not use anymore? I have read articles about localities which have renovated old school buildings, etc. for other public purposes and am looking for grant programs which may provide assistance. Just to give you some background, the Town's old municipal offices are basically no longer used. The Town moved its offices to an old house in Town about 30 years ago. The building, while historic, is outdated and is no where close to ADA compliant. If we could move back to the old location after renovating it, we would have significantly more parking, would have just about everything on the first floor and would consolidate all of our building, with the exception of our wastewater treatment plant and community center.  However, in order to do this, we will need to do significant renovation to the old building. \nObviously, this is something that is a few years down the road, but I am working on the capital improvements plan and want to include some funding options for the future. \nI look forward to your responses. \nReid Wodicka\nElkton, Virginia\n\n", 
  "title": "Old municipal buildings", 
  "when": "25-08-2010"
}