{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nI will be frank, yes the outcome is justified.  You willfully misrepresented the facts regarding your degree.  It would have been easy list the degree as in progress and then explain the actual status of your degree to the recruiter and city council.  It is your actions, not the employees, that violated the trust with the city council.  It leaves doubt in the councils mind and the public's as to under what other circumstances will you not be truthful.  When you make a mistake in judgment, it often has consequences.  There have been many occasions when absolute honesty was uncomfortable concerning one of my mistakes or staff's mistakes   and being honest rather then painting the best light or covering over placed my job at risk.   I always told them the truth.  I  believe that it be better to be fired for telling the truth and making an honest mistake then for telling a lie or trying to cover up a problem.  The world forgives mistakes, it is a little less forgiving of dishonesty.\nNotwithstanding the less then ethical actions of the terminated employee, you are responsible for your own actions and it is those actions that allowed that employee to accomplish this outcome.  In California all personnel files are confidential and is a criminal and civil violation to take and use such documents.  Even job recruitments are fully confidential here. That is not the case in many states, so I do not know if the law in Arizona allows you to prosecute the offender.  If Arizona law makes her actions illegal, then your recourse is with, her not the town, as she should also be held accountable for her improper actions.   If the Arizona laws provide no recourse, then you simply need to learn from the experience and move forward with your life.  It will take time regain credibility within government employment.\n\n\nI will be frank, yes the outcome is justified.  You willfully misrepresented the facts regarding your degree.  It would have been easy list the degree as in progress and then explain the actual status of your degree to the recruiter and city council.  It is your actions, not the employees, that violated the trust with the city council.  It leaves doubt in the councils mind and the public's as to under what other circumstances will you not be truthful.  When you make a mistake in judgment, it often has consequences.  There have been many occasions when absolute honesty was uncomfortable concerning one of my mistakes or staff's mistakes   and being honest rather then painting the best light or covering over placed my job at risk.   I always told them the truth.  I  believe that it be better to be fired for telling the truth and making an honest mistake then for telling a lie or trying to cover up a problem.  The world forgives mistakes, it is a little less forgiving of dishonesty.\n\nNotwithstanding the less then ethical actions of the terminated employee, you are responsible for your own actions and it is those actions that allowed that employee to accomplish this outcome.  In California all personnel files are confidential and is a criminal and civil violation to take and use such documents.  Even job recruitments are fully confidential here. That is not the case in many states, so I do not know if the law in Arizona allows you to prosecute the offender.  If Arizona law makes her actions illegal, then your recourse is with, her not the town, as she should also be held accountable for her improper actions.   If the Arizona laws provide no recourse, then you simply need to learn from the experience and move forward with your life.  It will take time regain credibility within government employment.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-06-2011"
    }, 
    {
      "author": "Charlene Stevens", 
      "score": "0", 
      "text": "\n\nYes, it was unethical of you to represent to the governing body that you had an MPA degree when in fact you had not completed all of the degree requirements.\n\n\nYes, it was unethical of you to represent to the governing body that you had an MPA degree when in fact you had not completed all of the degree requirements.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-06-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 21115, 
  "score": "0", 
  "tags": [
    "Ethics"
  ], 
  "text": "\n\nIn late 2009, I applied for a position as Town Manager with the Kayenta Township in Kayenta, AZ. At that time, I was still working on completing the remaining three (3) credit hours (Independent Study) for my Master of Public Administration degree. \nWhile I submitted as part of my application materials an unofficial transcript showing the successful completion of thirty-three (33) graduate hours and an \"I\" (Incomplete) for the Independent Study, I also listed among my educational achievements on the township's employment application having earned a MPA degree. As a matter of speaking I \"put the cart before the horse.\"\nIn February 2010, I was interviewed for the position, and, in June 2010, I was hired by the five-member Township Commission who entered into a three-year contract with me. Several months later, I took disciplinary action against a township employee and ultimately terminated her in writing. Before she left, she stole certain documents from my personnel file and took it upon herself to contact my graduate school, only to find out that I had not yet earned the MPA degree. She retaliated against me by showing my personnel file to one of the commissioners without my knowledge and consent and accused me of having \"lied\" on my original application. \nNearly ten (10) months after my starting date, I have now been placed on Administrative Leave with Pay, even though I successfully completed my initial 120-day probationary period. I have not been disciplined for any reason, verbally or in writing, by anybody.\nWas it unethical for me impart to the Township Commission that I not only graduated, but that I also earned the MPA degree? Do the above-stated facts justify my termination? \nI have provided a full-length in-depth explanation, in writing, to the Chairman of the Commission, pursuant to his written request for me to do so. At this writing, I am awaiting the decision of the Commission.....\n\n", 
  "title": "Qualifications", 
  "when": "11-06-2011"
}