{
  "answer_by": null, 
  "answers": [
    {
      "author": "Eric Norenberg", 
      "score": "0", 
      "text": "\n\nThe Lorain County (OH) Metro Parks Department has a multipurpose recreation facility in Oberlin.  It started out 10 years ago with indoor and outdoor aquatics facilities and over time, a fitness center, field house and additional lap pool have been added.   Though this is not a senior only facility, the lap pool is used by many senior lap swimmers and is kept at a warmer temperature for therapeutic purposes.  For more information about this facility and the lap pool in particular, please contact Metro Parks: http://www.metroparks.cc/contact.php\n\n\nThe Lorain County (OH) Metro Parks Department has a multipurpose recreation facility in Oberlin.  It started out 10 years ago with indoor and outdoor aquatics facilities and over time, a fitness center, field house and additional lap pool have been added.   Though this is not a senior only facility, the lap pool is used by many senior lap swimmers and is kept at a warmer temperature for therapeutic purposes.  For more information about this facility and the lap pool in particular, please contact Metro Parks: http://www.metroparks.cc/contact.php\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-08-2012"
    }, 
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nCharlottesville's aquatic center also has dry multi-purpose rooms for fitness classes for all ages. The aquatic center (24,000 sq.ft., $11 million, LEED Platinum) shares a parcel with the Boys & Girls Club and the city middle school, making enhanced after-school and recreation programs available. It's not billed as a senior center, but some classes are designed for elders.\nDiscussion/conference topics:\n    Combining youth and elders' programming. You mentioned the elder day care --can the facility combine that needed service with child care, so the two groups can learn from and enjoy each other? Play benefits everyone's brain plasticity.\n    Medical partnerships. Our newest community center will include a small clinic space for a nurse practioner and public health education, as well as some nonprofit counselors and healing arts experts. What local health resources could locate in your pool building to make it even better? There are wellness opportunities for City employees, too.\n    Low-Impact Design for pools. LEED or not, what design features make a facility more usable, less expensive, and lower impact? You have tools for water treatment, heating, and insulation in the greenhouse-like architecture of a pool.\nThanks for sharing!\n\n\nCharlottesville's aquatic center also has dry multi-purpose rooms for fitness classes for all ages. The aquatic center (24,000 sq.ft., $11 million, LEED Platinum) shares a parcel with the Boys & Girls Club and the city middle school, making enhanced after-school and recreation programs available. It's not billed as a senior center, but some classes are designed for elders.\n\nDiscussion/conference topics:\n    Combining youth and elders' programming. You mentioned the elder day care --can the facility combine that needed service with child care, so the two groups can learn from and enjoy each other? Play benefits everyone's brain plasticity.\n    Medical partnerships. Our newest community center will include a small clinic space for a nurse practioner and public health education, as well as some nonprofit counselors and healing arts experts. What local health resources could locate in your pool building to make it even better? There are wellness opportunities for City employees, too.\n    Low-Impact Design for pools. LEED or not, what design features make a facility more usable, less expensive, and lower impact? You have tools for water treatment, heating, and insulation in the greenhouse-like architecture of a pool.\n\nThanks for sharing!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-08-2012"
    }, 
    {
      "author": "Josh Jones", 
      "score": "0", 
      "text": "\n\nThanks for the answers. I've gotten great information on best practices, size, etc. The hardest number to come up with has been, just how much does it cost to run a pool versus if we had a senior center with no pool? We might have thought that the cost would have been greater, but really all I'm coming up with is the chemicals and staffing with a current employee.\n\n\nThanks for the answers. I've gotten great information on best practices, size, etc. The hardest number to come up with has been, just how much does it cost to run a pool versus if we had a senior center with no pool? We might have thought that the cost would have been greater, but really all I'm coming up with is the chemicals and staffing with a current employee.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-08-2012"
    }
  ], 
  "answers_count": 3, 
  "author": "Josh Jones", 
  "id": 22091, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Housing & Community Development", 
    "Healthy Living", 
    "Code Enforcement", 
    "Parks and Recreation", 
    "Partnerships", 
    "Sustainability", 
    "Aging", 
    "Finance and Budgeting", 
    "Planning"
  ], 
  "text": "\n\nI have a few very specific questions that I’m hoping some of you may have answers to about senior centers and accompanying lap pools:\n1) Does anyone know of a senior center/lap pool that has been incorporated into a mixed use (re)development or other public/private setting? So far, the examples I’m finding are generally standalone facilities. \n2) If there were a national conference on senior centers and lap pools, what would be the best practice models of the future and other timely topics that would be showcased and discussed there? One example of an award winning facility was one that incorporated a daycare facility run by a private foundation for those suffering from Alzheimer’s Disease. \n3) Lastly, the numbers. Does anybody have any costs that they can share of recent constructions (total and per sq. ft.) and their associated annual maintenance costs? What range of square footage is needed, with particular attention paid to ADA requirements and the inclusion of a lap pool?\nWe have the opportunity to build a senior center/lap pool from scratch, so we want to know what we should be striving for as we look to incorporate innovative features, locate in a mixed-use location downtown, and generally seek to understand the basics of cost, maintenance, and size.\n\n", 
  "title": "Senior Center/Lap Pool", 
  "when": "14-08-2012"
}