{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Brian, \nI have found a few resources that I believe will be helpful as you create your internal communications plan. \nThis previously asked question provides insight into how local governments deal with communication between those in the home office and employees in the field http://icma.org/en/icma/knowledge_network/kn/Question/20641\nHere are 10 musts for internal communication. http://icma.org/en/icma/knowledge_network/blogs/blogpost/2364/10_Musts_for_Internal_Communications\nThis previously asked question provides a few examples of internal communications plans. http://icma.org/en/icma/knowledge_network/kn/question/22497\nI hope you find these resources helpful and that other local government officials are able to weigh in on this issue. \nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nHi Brian, \n\nI have found a few resources that I believe will be helpful as you create your internal communications plan. \n\nThis previously asked question provides insight into how local governments deal with communication between those in the home office and employees in the field http://icma.org/en/icma/knowledge_network/kn/Question/20641\n\nHere are 10 musts for internal communication. http://icma.org/en/icma/knowledge_network/blogs/blogpost/2364/10_Musts_for_Internal_Communications\n\nThis previously asked question provides a few examples of internal communications plans. http://icma.org/en/icma/knowledge_network/kn/question/22497\n\nI hope you find these resources helpful and that other local government officials are able to weigh in on this issue. \n\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-05-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Brian Scott", 
  "id": 23117, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nThe City of Lee's Summit, Missouri has been working on a High Performance Initiative that we have branded as Performance Excellence.  One of the goals that has been identified in our business plan is to develop better methods of internal communications.  To this end we are seeking examples of best practices from both publicf and private for methods of internal communication, in particular how major initiatives of the organization are communicated to employees.  If you could take a few minutes to answer the questions below, it would be much apperciated.  \n\nHow does information flow within your organization? (Think about two-way communication instead of just one-way communication.)\nHow many employees do you have in your organization?\nHow are you communicating with employees? (Explain the different methods and how often you are communicating with them utilizing these methods.)\nHow are you building relationships with employees?\nWhat are your approaches for communicating with field vs. office employees? (home office vs. satellite offices)\nWho is responsible for communicating to these employees? \nHow do you measure the program’s success? (measurement tool and how often utilized)\n\nThanks again.\n\n", 
  "title": "Internal Organizations Communications", 
  "when": "06-05-2014"
}