{
  "answer_by": null, 
  "answers": [
    {
      "author": "Robert Woods", 
      "score": "0", 
      "text": "\n\nThe City of Albany, Oregon transitioned Public Works administration, engineering, customer service and major facilities maintenance/engineering into an Internal Service fund operation, where all work gets charged back to streets, water and sewer operations. That approach also permits those staff to charge directly to other city departments for services provided when warranted.\nThe basic approach is that PW Director and other administrative costs are in a separate program, where those costs are allocated to all PW operations, including those within the internal service fund. The director does NOT charge time to projects. The director’s job is management, but the costs become part of the overhead that IS charged to projects.\nOur Engineering Services program functions like a private-sector business. Each employee charges all time to projects or service areas as appropriate. The City Engineer can charge to projects if warranted, but typically will charge the largest portion of time to our General/Indirect cost center. \nAdministrative staff will only rarely charge time to a project. Instead they are part of the General/Indirect cost area. We made the choice that imposing detailed recordkeeping on administrative staff was just not a productive approach.\nI’m attaching a PDF of a help page from our Engineering Services operation so you can see the layout.   For FY 2012-13, our Engineering Services multiplier is 1.8221 times the employee’s hourly rate. That number covers ALL expenses of the engineering program including personnel contracted services, operating supplies, utilities, central service charges, repairs/maintenance and a proportional share of departmental administration.\nProject related outside expenses are charged directly to the project in whatever utility the project occurs – they are not passed through the Engineering budget.\n\n\nThe City of Albany, Oregon transitioned Public Works administration, engineering, customer service and major facilities maintenance/engineering into an Internal Service fund operation, where all work gets charged back to streets, water and sewer operations. That approach also permits those staff to charge directly to other city departments for services provided when warranted.\n\nThe basic approach is that PW Director and other administrative costs are in a separate program, where those costs are allocated to all PW operations, including those within the internal service fund. The director does NOT charge time to projects. The director’s job is management, but the costs become part of the overhead that IS charged to projects.\n\nOur Engineering Services program functions like a private-sector business. Each employee charges all time to projects or service areas as appropriate. The City Engineer can charge to projects if warranted, but typically will charge the largest portion of time to our General/Indirect cost center. \n\nAdministrative staff will only rarely charge time to a project. Instead they are part of the General/Indirect cost area. We made the choice that imposing detailed recordkeeping on administrative staff was just not a productive approach.\n\nI’m attaching a PDF of a help page from our Engineering Services operation so you can see the layout.   For FY 2012-13, our Engineering Services multiplier is 1.8221 times the employee’s hourly rate. That number covers ALL expenses of the engineering program including personnel contracted services, operating supplies, utilities, central service charges, repairs/maintenance and a proportional share of departmental administration.\n\nProject related outside expenses are charged directly to the project in whatever utility the project occurs – they are not passed through the Engineering budget.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-11-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Pamela Muse", 
  "id": 22277, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting", 
    "Public Works"
  ], 
  "text": "\n\nFremont, CA is undertaking a study of our Development Cost Center cost recovery model. Most of our staff within the cost center charge their time spent working on projects to the projects, which are either are funded by developer funds or capital funds.  Our executive staff (Dept head, City Engineer) sometimes charges time spent on specific projects as well.  I am looking for some help understanding best practices in this area - what do other agencies that operate with similar cost centers do in regards to their executive staff's time.\n*Do department heads charge time to projects or are they strictly considered 100% administrative overhead? \n*If they do charge to projects, what is the criteria for charging versus not charging?\n*What percentage of time is expected to be chargeable?\nAlso:\n*Do other cities set up accounts for these larger scope citywide to track/charge time? \n*Is it simply considered citywide overhead/cost of doing business?\nPlease let me know if you have any questions or if I can further explain what kind of information I'm looking for.\nThanks,\nSean\nSean O'Shea\nManagement Analyst II\nPublic Works Dept.\nCity of Fremont\n510-494-4777 (ph)\nsoshea@fremont.gov\n\n", 
  "title": "Cost Center Recovery Model", 
  "when": "08-11-2012"
}