{
  "answer_by": null, 
  "answers": [
    {
      "author": "Caitlyn Mitchell", 
      "score": "0", 
      "text": "\n\nThis answer is going to seem a little biased given that I am a student at Arizona State University, but ASU and the City of Phoenix have done a tremendous job working together to bring a brand new campus into the downtown area in the past five years. \nVoters approved a $223million bond in 2006 and by 2008 ASU Downtown opened its first building, and has been steadily adding to the campus ever since. The partnership worked in Phoenix's favor too because it brings over 10,000 students into the downtown area- improving residential and retail success rate and adding to the overall vitality of the area past 5pm.\nOn a regional level, ASU has five separate campuses in the Phoenix metro area, four of which are in separate cities. The partnership between the city and the university helped Phoenix create, plan and build a light rail system that currently connects two of the campuses together, with plans to reach another two by 2025.  \nAttached is a the plan for the partnership. It includes all the specifics you are looking for as far as who, where, and why are concerned. \nHope it helps!\n\n\nThis answer is going to seem a little biased given that I am a student at Arizona State University, but ASU and the City of Phoenix have done a tremendous job working together to bring a brand new campus into the downtown area in the past five years. \n\nVoters approved a $223million bond in 2006 and by 2008 ASU Downtown opened its first building, and has been steadily adding to the campus ever since. The partnership worked in Phoenix's favor too because it brings over 10,000 students into the downtown area- improving residential and retail success rate and adding to the overall vitality of the area past 5pm.\n\nOn a regional level, ASU has five separate campuses in the Phoenix metro area, four of which are in separate cities. The partnership between the city and the university helped Phoenix create, plan and build a light rail system that currently connects two of the campuses together, with plans to reach another two by 2025.  \n\nAttached is a the plan for the partnership. It includes all the specifics you are looking for as far as who, where, and why are concerned. \n\nHope it helps!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-02-2011"
    }, 
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nI would take a look at what Madison Wisconsin accomplished with UW-Madison beginning in the early 1980's, to establish successful bio-tech research parks that put Madison in the forefront in that regard.  Also, when I worked in Louisville, Kentucky, the City established effective plans to allow the U of L medical center to become a major presence in downtown Louisville and successfully redevelop declining areas of the near-downtown.  A form amd character plan for the entire community assisted this process, demonstrating the value of form and character-based comprehensive planning for the good of the entire community.\n\n\nI would take a look at what Madison Wisconsin accomplished with UW-Madison beginning in the early 1980's, to establish successful bio-tech research parks that put Madison in the forefront in that regard.  Also, when I worked in Louisville, Kentucky, the City established effective plans to allow the U of L medical center to become a major presence in downtown Louisville and successfully redevelop declining areas of the near-downtown.  A form amd character plan for the entire community assisted this process, demonstrating the value of form and character-based comprehensive planning for the good of the entire community.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-02-2011"
    }, 
    {
      "author": "Mike Cohen", 
      "score": "0", 
      "text": "\n\nCheck-out an example of how UC Berkeley and the City of Berkeley are working together, by going to http://www.BerkeleyStartupCluster.net .\n\n\nCheck-out an example of how UC Berkeley and the City of Berkeley are working together, by going to http://www.BerkeleyStartupCluster.net .\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-02-2011"
    }, 
    {
      "author": "John Duffy", 
      "score": "0", 
      "text": "\n\nWe in Mat-Su Borough, Alaska have a long standing partnership with the University of Alaska, Anchorage Justice Center.  The partnership consists of the Justice Center conducting an annual survey that obtains information on citizen satisfaction with our services and responses on taxes, initiatives, etc.  The survey also includes a section on neighborhood cohesiveness that is a longitudinal study being conducted by UAA which measures crime rates, communication levels between neighbors and those variables associated with vibrant neighborhoods.  These annual surveys have been quite beneficial to us and have allowed us to focus on services that have needed improvements.  The neighborhood cohesiveness section has provided information on how we can maintain good livability standards.\n\n\nWe in Mat-Su Borough, Alaska have a long standing partnership with the University of Alaska, Anchorage Justice Center.  The partnership consists of the Justice Center conducting an annual survey that obtains information on citizen satisfaction with our services and responses on taxes, initiatives, etc.  The survey also includes a section on neighborhood cohesiveness that is a longitudinal study being conducted by UAA which measures crime rates, communication levels between neighbors and those variables associated with vibrant neighborhoods.  These annual surveys have been quite beneficial to us and have allowed us to focus on services that have needed improvements.  The neighborhood cohesiveness section has provided information on how we can maintain good livability standards.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-02-2011"
    }
  ], 
  "answers_count": 4, 
  "author": "Wayne Sommer", 
  "id": 20727, 
  "score": "0", 
  "tags": [
    "Environment", 
    "Energy Efficiency", 
    "Partnerships", 
    "Sustainability", 
    "Town and Gown", 
    "Transportation"
  ], 
  "text": "\n\nThis morning I attended a set of panel discussions entitled City-University Partnerships:  Best Practices in Urban Sustainability in Europe and the U.S. (The presentations and a video of the sessions will be available at www.aplu.org by 1/28.)  Representatives from city government and local universities shared their experiences in successful partnerships between local governments and the universities within their communities.  The cities represented included Rotterdam, The Netherlands; Portland, Oregon; Lausanne, Switzerland; Philadelphia, Pennsylvania; Stockholm, Sweden; and, Washington D.C.  The presentations were excellent and it made me wonder:  do we have examples of successful partnerships between local governments and the universities that reside within their communities or region aimed at solving real problems here within the U.S.?  If so, what kind?  Who were the key individuals/positions involved from the local government and the university?\n\n", 
  "title": "Successful Partnerships Between Local Governments and Universities", 
  "when": "25-01-2011"
}