{
  "answer_by": null, 
  "answers": [
    {
      "author": "Eric Norenberg", 
      "score": "0", 
      "text": "\n\nHere is how the City of Oberlin (a smaller community surrounded by rural areas) addressed this subject.  Allowed surfaces are determined by the type of use: \nAll open off-street parking areas and related vehicular access drives and aisles, including residential (single-family detached dwellings  or conversions of such dwellings to rooming houses, accessory apartments or multi-family units) driveways and widenings thereof, shall be surfaced as follows:  Crushed stone, gravel or similar material, or asphalt, concrete, brick, paving block or similar durable, dustless and impervious surface.\nAll other uses:  Asphalt, concrete, brick, paving block or similar durable, dustless and impervious surface.\nI hope this helps!\n\n\nHere is how the City of Oberlin (a smaller community surrounded by rural areas) addressed this subject.  Allowed surfaces are determined by the type of use: \n\nAll open off-street parking areas and related vehicular access drives and aisles, including residential (single-family detached dwellings  or conversions of such dwellings to rooming houses, accessory apartments or multi-family units) driveways and widenings thereof, shall be surfaced as follows:  Crushed stone, gravel or similar material, or asphalt, concrete, brick, paving block or similar durable, dustless and impervious surface.\n\nAll other uses:  Asphalt, concrete, brick, paving block or similar durable, dustless and impervious surface.\n\nI hope this helps!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-01-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Timothy McLean", 
  "id": 21641, 
  "score": "0", 
  "tags": [
    "Planning", 
    "Public Works", 
    "Citizen Engagement"
  ], 
  "text": "\n\nAfter receiving direction from Council, I am currently drafting a potential ordinance to deal with issues of the parking of vehicles in the front yards of residential areas. I've reviewed many ordinances from municipalities across the country and have yet to find the happy medium I am looking for. It seems that many of the ordinances I have read are intended for more urban communities. We are in a smaller, semi-rural community and there are many instances where residential driveways are not necessarily paved or gravel coated. Because of this, it seems there are many gray areas in terms of what constitutes a driveway. I would be very interested in hearing what smaller sized communities have done to tackle this issue. I am particularly interested in hearing how the public has reacted to these ordinances as well as how these ordinances are being enforced. I would greatly appreciate any insight.\n\n", 
  "title": "Yard Parking Ordinance", 
  "when": "25-01-2012"
}