{
  "answer_by": null, 
  "answers": [
    {
      "author": "Israel Murguia", 
      "score": "0", 
      "text": "\n\nThe following is an example of a city making use of its old police building. While it does not address housing or nonprofits, the city's plan to use it as a tech incubation center is certainly innovative, especially for the area. As you can read, the article addresses how demolition was not an option give the state of the economy. Here is the link: http://www.nctimes.com/news/local/escondido/article_b45c23b8-3f2b-565b-92eb-1c5e2511aac7.html\n\n\nThe following is an example of a city making use of its old police building. While it does not address housing or nonprofits, the city's plan to use it as a tech incubation center is certainly innovative, especially for the area. As you can read, the article addresses how demolition was not an option give the state of the economy. Here is the link: http://www.nctimes.com/news/local/escondido/article_b45c23b8-3f2b-565b-92eb-1c5e2511aac7.html\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-02-2011"
    }, 
    {
      "author": "Israel Murguia", 
      "score": "0", 
      "text": "\n\nAttached is a case study from AFI's 2011 Innovation Awards. This particular case study is more aligned with what you are looking for. The Care1st Avondale Resource and Housing Center is a unique partnership between the City of Avondale and Care1st Health Plan Arizona.  This collaboration enables the City of Avondale to offer critical social services to area residents and simultaneously put a vacant City building to good use at no direct cost to the taxpayers. I hope this helps.\n\n\nAttached is a case study from AFI's 2011 Innovation Awards. This particular case study is more aligned with what you are looking for. The Care1st Avondale Resource and Housing Center is a unique partnership between the City of Avondale and Care1st Health Plan Arizona.  This collaboration enables the City of Avondale to offer critical social services to area residents and simultaneously put a vacant City building to good use at no direct cost to the taxpayers. I hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "19-02-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Karen Walz-Fuentes", 
  "id": 20783, 
  "score": "0", 
  "tags": [
    "Partnerships"
  ], 
  "text": "\n\nWe are looking for innovative ideas and solutions that other local government entities are using with regard to houses/buildings on their property. For example, often local government entities will rent out homes that exist on property that is acquired by or deeded to the entity. The ongoing repair costs and management/staff oversight for such a program can outweigh the benefits. Demolition is an option; but in the current economy with non-profits struggling to find affordable space, and a shortage of affordable housing in many areas has anyone developed an innovative approach to this problem? We are looking for examples.\n\n", 
  "title": "Innovative ideas for using and managing houses/buildings on local government property", 
  "when": "14-02-2011"
}