{
  "answer_by": "31-07-2011", 
  "answers": [
    {
      "author": "Timothy Hacker", 
      "score": "0", 
      "text": "\n\nIt has become a more common practice, at least in my experience, to include citizen panels as part of the interview process for City Manager/Administrator, as well as planned social events for a meet and greet approach with a broader segment of the community. A recent interview I participated in just last week included a citizen panel that included a representative selected by each of the elected officials (Mayor/Council). I wasn’t made privy to the instructions on what they were to do with the information they gleaned, however found it reassuring that none of the news media reported anything on this portion of the process. During this particular process, which was conducted over two days, all candidates sat for questions from the full Council, so the meeting was posted, open to the public and actually televised. All candidates also sat for a panel interview with select department heads as well. Frankly, I appreciate a thorough process that helps the candidate become more aware of the constituents they will eventually work with and for.\n\n\nIt has become a more common practice, at least in my experience, to include citizen panels as part of the interview process for City Manager/Administrator, as well as planned social events for a meet and greet approach with a broader segment of the community. A recent interview I participated in just last week included a citizen panel that included a representative selected by each of the elected officials (Mayor/Council). I wasn’t made privy to the instructions on what they were to do with the information they gleaned, however found it reassuring that none of the news media reported anything on this portion of the process. During this particular process, which was conducted over two days, all candidates sat for questions from the full Council, so the meeting was posted, open to the public and actually televised. All candidates also sat for a panel interview with select department heads as well. Frankly, I appreciate a thorough process that helps the candidate become more aware of the constituents they will eventually work with and for.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-07-2011"
    }, 
    {
      "author": "Jo Ann Leifeste", 
      "score": "0", 
      "text": "\n\nThank you for this input.   Are you a resident of TX by any chance?\n\n\nThank you for this input.   Are you a resident of TX by any chance?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-07-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Jo Ann Leifeste", 
  "id": 21216, 
  "score": "0", 
  "tags": [
    "Elected Officials"
  ], 
  "text": "\n\nI am interested in knowing how wide-spread the practice is today of citizens interviewing candidates for the job of city manager in addition to the city council doing so, and how municipalities choose which citizens will help do the interviewing and are the candidates interviewed by the city council and the citizens at the same meeting?  Are the citizens required to take an oath that they will not divulge the information they learn while interviewing candidates or not?  \nI would very much like to know if you think it is a good thing or bad thing for the public to be involved in the interviewing process.\nThank you.\n\n", 
  "title": "Citizens interviewing candidates for City Manager", 
  "when": "15-07-2011"
}