{
  "answer_by": null, 
  "answers": [
    {
      "author": "Julius Suchy", 
      "score": "0", 
      "text": "\n\nAnyone who wishes to see the CM, Finance Director, Building Inspector, Engineer or Attorney needs to stop at the front counter first. The way our building is designed this is easy. \nAs the manager I don't require appointments, but if I am involved in a legal matter the front desk staff will let them know to leave a message or come back some other time.\n\n\nAnyone who wishes to see the CM, Finance Director, Building Inspector, Engineer or Attorney needs to stop at the front counter first. The way our building is designed this is easy. \n\nAs the manager I don't require appointments, but if I am involved in a legal matter the front desk staff will let them know to leave a message or come back some other time.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-10-2012"
    }, 
    {
      "author": "Eric Norenberg", 
      "score": "0", 
      "text": "\n\nI agree with Julius.  I am very available to residents who need to meet on short notice.  Many residents will call in advance, e-mail or stop in the office to see when I have time for a short meeting.  If I am free, I will meet with them or at least take a moment to understand their need and be sure that when we schedule a meeting I include other staff, if relevant.  Few residents expect to simply walk into my office unannounced and unscheduled.  \nAll City staff have access (via Outlook) to see my calendar so that if an employee or resident wants to schedule a meeting, they can see when I am free.\n\n\nI agree with Julius.  I am very available to residents who need to meet on short notice.  Many residents will call in advance, e-mail or stop in the office to see when I have time for a short meeting.  If I am free, I will meet with them or at least take a moment to understand their need and be sure that when we schedule a meeting I include other staff, if relevant.  Few residents expect to simply walk into my office unannounced and unscheduled.  \n\nAll City staff have access (via Outlook) to see my calendar so that if an employee or resident wants to schedule a meeting, they can see when I am free.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-10-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 22241, 
  "score": "0", 
  "tags": [
    "Citizen Engagement"
  ], 
  "text": "\n\nHow does your city handle the availability of your city manager?  Is your city manager behind secure doors?  Is your HR and clerk behind secure doors? Does your city allow citizens to walk right into your city managers, HR or clerks office without stopping at the front desk?  Does your city manager require appointments?  I ask all this as my current mayor believes anyone should be able to walk right in to my or HR and clerk offices without stopping at the front desk to see if we are available.  Makes it quite uncomfortable when I and/or HR are working on a legal matter with our attorney and we have to start shuffling confidential documents out of sight of the public when they just walk in.   We feel we shoud be behind secure doors as should our files.\n\n", 
  "title": "Availability of City Manager", 
  "when": "22-10-2012"
}