{
  "answer_by": null, 
  "answers": [
    {
      "author": "Richard Brown", 
      "score": "0", 
      "text": "\n\nI think the member is correct in looking at the outcomes that are mentioned.  I also think it would be interesting to track the types of complaints (rudeness, excessive force, racial profiling for example).  These may point out concerns about the culture of the organization.\n\n\nI think the member is correct in looking at the outcomes that are mentioned.  I also think it would be interesting to track the types of complaints (rudeness, excessive force, racial profiling for example).  These may point out concerns about the culture of the organization.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-11-2010"
    }, 
    {
      "author": "Thomas Quist", 
      "score": "0", 
      "text": "\n\nI think you've come up with a good list of metrics already.  Off the top of my head, it would of course be wise to track the number of complaints against officers who had already received complaints (sustained or not).  I'm guessing most police departments have a file on this already.  This measure would help to inform if the corrective action taken by management was effective at reducing \"repeat offenders.\"\n\n\nI think you've come up with a good list of metrics already.  Off the top of my head, it would of course be wise to track the number of complaints against officers who had already received complaints (sustained or not).  I'm guessing most police departments have a file on this already.  This measure would help to inform if the corrective action taken by management was effective at reducing \"repeat offenders.\"\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-11-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "Donald Gloo", 
  "id": 20598, 
  "score": "0", 
  "tags": [
    "Ethics", 
    "Performance Management and Analytics", 
    "Police"
  ], 
  "text": "\n\nThe ICMA Center for Performance Measurement has received a question from one of its member jurisdictions.  This local government is developing a set of performance measures for its Community Ombudsman's office, and they would like to learn from other jurisdictions.\nWhile most local governments surely are tracking the raw number of complaints against police officers, this local government would like to go beyond simply tracking the numbers to looking at outcomes, such as the percentage of complaints that are sustained, the disposition of complaints, the various categories of complaints, citizen satisfaction with the complaint process, etc.\nIf you think you have some suggested performance measures beyond simply tracking the number of complaints, please reply to this question or send an email to Don Gloo at dgloo@icma.org.  Thank you.\n\n", 
  "title": "Measuring Citizen Complaints Against Police", 
  "when": "17-11-2010"
}