{
  "answer_by": null, 
  "answers": [
    {
      "author": "Dustin Anderson", 
      "score": "1", 
      "text": "\n\nWe have experienced a similar situation. It's an interesting tool, and certainly useful as an additional mechanism to interact with the public.    \nWe do not subscribe and do not intend to. We have detailed work plans that optimize efficiency of our crews. Allocating scarce resource on responding to a self-selecting minority's preference would be going a step backwards.    \nIf residents complain, they may be expressing a reasonable desire to interact with their government in non-traditional means. You could just as easily set up a Twitter account to have this sort of transparent and direct communication all while integrating feedback into an existing work-order system.\n\n\nWe have experienced a similar situation. It's an interesting tool, and certainly useful as an additional mechanism to interact with the public.    \n\nWe do not subscribe and do not intend to. We have detailed work plans that optimize efficiency of our crews. Allocating scarce resource on responding to a self-selecting minority's preference would be going a step backwards.    \n\nIf residents complain, they may be expressing a reasonable desire to interact with their government in non-traditional means. You could just as easily set up a Twitter account to have this sort of transparent and direct communication all while integrating feedback into an existing work-order system.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-05-2011"
    }, 
    {
      "author": "Cory Fleming", 
      "score": "0", 
      "text": "\n\nI attended the 311 Synergy Group Annual Conference in Nashville last year, and this topic was a major discussion/item for local government call center directors and managers.  There are applications that have been integrated with existing constituent relationship management (CRM) systems and/or work order management systems.  When the integration happens, the applications work well and can actually help lower a jurisdiction's costs in responding to service requests.  But the real key is integration.  Setting up a separate system to handle such requests is counter productive and expensive, imo.\n\n\nI attended the 311 Synergy Group Annual Conference in Nashville last year, and this topic was a major discussion/item for local government call center directors and managers.  There are applications that have been integrated with existing constituent relationship management (CRM) systems and/or work order management systems.  When the integration happens, the applications work well and can actually help lower a jurisdiction's costs in responding to service requests.  But the real key is integration.  Setting up a separate system to handle such requests is counter productive and expensive, imo.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-05-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Heather Ruddy", 
  "id": 21012, 
  "score": "0", 
  "tags": [
    "Management", 
    "Citizen Engagement"
  ], 
  "text": "\n\nWe were recently made aware of the new web-based citizen complaint/issue reporting system, seeclickfix.com.  Although this seems like a good product for cities that do not operate their own work order/call center for handling citizen concerns, many cities already have invested a lot of money and resources into creating their own systems.  From our research, seeclickfix does not provide an opt out provision for governments who do not want to use their system.  Consequently, citizens who use this service may view a city who opts not to pay into this system as being un-responsive.  It costs at a minimum, $40/month for a city to acknowledge an issue posted to the site, effectively holding that city hostage in being able to respond to their citizens.  The result is either pay the company $40 a month to respond to their own citizens or not respond to the issues posted.  \nWe would like to know if their are other local governments struggling with this issue and how you have handled it.  \nThank you!\n\n", 
  "title": "See Click Fix", 
  "when": "05-05-2011"
}