{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jared Cobb", 
      "score": "1", 
      "text": "\n\nWe have the same issue with a couple developments that were platted over 20 years ago. The only way for us to resolve the problem is to finance the improvements and then setup a special assessment district to recover the costs. Taking this from another angle, the individuals that bought property should have had something in writing or contacted the city to get a copy of your development policy. We've had a number of people complain about the City not developing their streets, but the lack of a street is what made their lot such a bargain. Finally, some planning agencies require a bond or other assurance that the developer will properly install utilities and streets. You may want to see if such a document was recorded at the county, as this may provide some recourse if the developer still owns lots in the development.\n\n\nWe have the same issue with a couple developments that were platted over 20 years ago. The only way for us to resolve the problem is to finance the improvements and then setup a special assessment district to recover the costs. Taking this from another angle, the individuals that bought property should have had something in writing or contacted the city to get a copy of your development policy. We've had a number of people complain about the City not developing their streets, but the lack of a street is what made their lot such a bargain. Finally, some planning agencies require a bond or other assurance that the developer will properly install utilities and streets. You may want to see if such a document was recorded at the county, as this may provide some recourse if the developer still owns lots in the development.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-04-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Amanda Torres", 
  "id": 23065, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Planning", 
    "Transportation"
  ], 
  "text": "\n\nCould anyone offer advice on how to remediate streets that have been been previously platted but left undeveloped? My city has several \"paper streets\" where realtors have sold property with the promise that the City would develop the street not the developer. We are working on resolving the problem for future property owners but how do address property owners who have already invested on these streets?  Please advise.\n\n", 
  "title": "Remediating previously platted, undeveloped streets", 
  "when": "03-04-2014"
}