{
  "answer_by": null, 
  "answers": [
    {
      "author": "Edward Reiskin", 
      "score": "0", 
      "text": "\n\nGood idea.  We're doing much the same in San Francisco (see http://www.sfartscommission.org/CAE/category/arts-education/street-smarts-arts-education/) on a modest scale.  Just finishing the first year - good results so far.\n\n\nGood idea.  We're doing much the same in San Francisco (see http://www.sfartscommission.org/CAE/category/arts-education/street-smarts-arts-education/) on a modest scale.  Just finishing the first year - good results so far.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-05-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Michael Repas", 
  "id": 20019, 
  "score": "1", 
  "tags": [
    "Local Culture", 
    "Police", 
    "Public Works"
  ], 
  "text": "\n\nOver the past few years, an entirely new kind of public works project has arisen in Washington, DC: they call it MuralsDC, and their work can be found here http://muralsdc.wordpress.com/.  As their website informs us, \n“The MuralsDC project is a program created by DC Councilmember Jim Graham as an effort to replace illegal graffiti with artistic works, to revitalize sites within the community and to teach young people the art of aerosol painting.  The goal of this initiative is to positively engage the District’s youth by teaching proper art techniques, providing supplies, and a legal means to practice and perform their skill in a way that promotes respect for public and private property and community awareness.   Site selection is based on areas of the District with high incidence of illegal graffiti as identified by the Department of Public Works (DPW) and other agencies.  Each mural reflects the character, culture and history of the neighborhoods in the District and interests from the business/residence owners.”\nIf this sounds a bit unlikely at first, it is worth noting that they have found a fair degree of success in their program – the website features any number of sample works by the kids involved, and serve to provide a sense of youth ownership over their community they might not otherwise receive.  It is also worth pointing out that a system that encourages community youth to express themselves artistically is good in itself; if this system can include local businesses as potential mural sites, this could reduce potential juvenile crime while bringing together two disparate groups in the community.\nIf this was possible in Washington, DC, perhaps it could be worth considering in other locations as well.  “Graffiti is merely a negative way of framing an artistic outlet and we need to encourage youth murals in our community as a positive approach to preventing graffiti,” one might claim: how might this claim work or not work in your community?  Do you see any way to potentially improve this system for a smaller area, or an area with more focused problems?\n\n", 
  "title": "Graffiti: Could the old enemy turn out to be a friend?", 
  "when": "24-05-2010"
}