{
  "answer_by": null, 
  "answers": [
    {
      "author": "Julie Herlands", 
      "score": "0", 
      "text": "\n\n(Apologies on duplicate response--I posted an answer on the other incentive question.) This type of analysis can be done with a fiscal/economic model--however, in my experience there are very few \"off-the-shelf\" models that can reflect a community's specific situation and the particular questions to be answered. My company, TischlerBise, specializes in this type of analysis. We build models to evaluate development projects--measuring fiscal (revenue generation vs. operating and capital needs and costs) and economic impacts tailored to the locality. The customized model can then be turned over to staff to evaluate future projects. See www.tischlerbise.com for project examples and feel free to contact me off-line if you would like to discuss further. We think that as the economy slowly recovers, there will be an increased demand for incentives--and thus an even greater need for localities to evaluate them to determine if they are a good deal for the jurisdiction.\n\n\n(Apologies on duplicate response--I posted an answer on the other incentive question.) This type of analysis can be done with a fiscal/economic model--however, in my experience there are very few \"off-the-shelf\" models that can reflect a community's specific situation and the particular questions to be answered. My company, TischlerBise, specializes in this type of analysis. We build models to evaluate development projects--measuring fiscal (revenue generation vs. operating and capital needs and costs) and economic impacts tailored to the locality. The customized model can then be turned over to staff to evaluate future projects. See www.tischlerbise.com for project examples and feel free to contact me off-line if you would like to discuss further. We think that as the economy slowly recovers, there will be an increased demand for incentives--and thus an even greater need for localities to evaluate them to determine if they are a good deal for the jurisdiction.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-02-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Toni Shope", 
  "id": 20799, 
  "score": "0", 
  "tags": [
    "Economic Development"
  ], 
  "text": "\n\nA locality is trying to develop a process/model to evaluate the value of economic development incentives for their City. There are two objectives: \n\nLook at incentives that have already been given and analyze them to determine the cost/return of the incentives.\nCreate a process by which to evaluate future potential development incentives, given the standards established by past ones.\n\nDo you have this in place or ideas for such a model to develop a type of objective indicator of the value of the investment? For example, if we could determine that every $1 we have given in incentives has produced $2 in return.\nThank You.\n\n", 
  "title": "Model to Develop Economic Development Incentives", 
  "when": "18-02-2011"
}