{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nWhat type of incentive funding are you referring to?  Is it grant funding or tax incentive funding?\nThere is a model for analysis for tax incentive funding whereas you can look at the value of a building pre-development vs. post development in relation to the amount of jobs created, tax loss during development period, and tax realization after the development period.\n\n\nWhat type of incentive funding are you referring to?  Is it grant funding or tax incentive funding?\n\nThere is a model for analysis for tax incentive funding whereas you can look at the value of a building pre-development vs. post development in relation to the amount of jobs created, tax loss during development period, and tax realization after the development period.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-02-2011"
    }, 
    {
      "author": "Julie Herlands", 
      "score": "0", 
      "text": "\n\nA fiscal model can do this; however, in my experience there are very few \"off-the-shelf\" models that can reflect a community's specific situation and the particular questions you will want to answer. My company, TischlerBise, specializes in this type of analysis. We build models to evaluate development projects--measuring fiscal (revenue generation vs. operating and capital needs and costs) and economic impacts tailored to the locality. The customized model can then be turned over to staff to evaluate future projects. See www.tischlerbise.com for project examples and feel free to contact me off-line if you would like to discuss further. We think that as the economy slowly recovers, there will be an increased demand for incentives--and thus an even greater need for localities to evaluate them.\n\n\nA fiscal model can do this; however, in my experience there are very few \"off-the-shelf\" models that can reflect a community's specific situation and the particular questions you will want to answer. My company, TischlerBise, specializes in this type of analysis. We build models to evaluate development projects--measuring fiscal (revenue generation vs. operating and capital needs and costs) and economic impacts tailored to the locality. The customized model can then be turned over to staff to evaluate future projects. See www.tischlerbise.com for project examples and feel free to contact me off-line if you would like to discuss further. We think that as the economy slowly recovers, there will be an increased demand for incentives--and thus an even greater need for localities to evaluate them.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-02-2011"
    }, 
    {
      "author": "Eric Keck", 
      "score": "0", 
      "text": "\n\nI agree with Julie's comments above.  You should be using a fiscal or economic impact model.  There is a difference between the two models.  We have been using an average cost approach model from a competing economic analysis firm out of Colorado, BBC Consulting, but it has its limitations.  The key to your analysis is the have a model calibrated for your specific community needs and this is why there are no pre-made models that will satisfy your needs.  You would probably do well to invest in one of the custom models created by a firm such as TischlerBise, BBC Consulting, or other economist.\n\n\nI agree with Julie's comments above.  You should be using a fiscal or economic impact model.  There is a difference between the two models.  We have been using an average cost approach model from a competing economic analysis firm out of Colorado, BBC Consulting, but it has its limitations.  The key to your analysis is the have a model calibrated for your specific community needs and this is why there are no pre-made models that will satisfy your needs.  You would probably do well to invest in one of the custom models created by a firm such as TischlerBise, BBC Consulting, or other economist.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-02-2011"
    }
  ], 
  "answers_count": 3, 
  "author": "Cassie Meyer", 
  "id": 20790, 
  "score": "0", 
  "tags": [
    "Housing & Community Development", 
    "Economic Development", 
    "Incentives"
  ], 
  "text": "\n\nWe are trying to develop some type of process/model to evaluate the value of economic development incentives our City.  There will essentially be two objectives here: \n1.  Look at incentives that have already been given and analyze them to determine the cost/return of the incentives.\n2.  Create a process by which to evaluate future potential development incentives, given the standards established by past ones.\nThis will require us to find and use some hard data (jobs created, average salary, property value/tax increases, sales tax revenue, cost of service on our end,…) as well as social and environmental factors. \nWhat ideas do you have for how we might create a model to put all of these things together and come up with some type of objective indicator of the value of the investment?  For example, if we could determine that every $1 we have given in incentives has produced $2 in return.\nHas anyone seen this done at the municipal level before?  Thanks!\nCassie Meyer\nCity of Collinsville, IL\n\n", 
  "title": "Evaluating Development Incentives", 
  "when": "15-02-2011"
}