{
  "answer_by": "09-08-2013", 
  "answers": [
    {
      "author": "Jim Latta", 
      "score": "0", 
      "text": "\n\nMr. Betts,\nThe City of Beverly Hills General Plan states that the city will provide a social services safety-net for the vulnerable members of this community.  As part of this safety-net Human Services provides assessment and referral for a number of services that are supported through the Community Assistance Grant Fund Process.  These services include shelter beds, permenant supportive housing, showers, health and case management.  The City of Beverly Hills has an homeless outreach team that engages and offers assistance to the homeless members of this community.  In addition to this service, we have no camping and aggressive panhandling ordinances. After offering assistance, we enforce the ordinances as a last resort.  We then work with the City prosecutor and County District Attorney to offer help instead of jail when the individual appears in court. To establish a consistent approach, we have a Homeless Collaboration that meets once a month made up of city employess (PD, Library, park maintenance, outreach team, parking), social service providers, faith-based organizations and interested residents to work together on the issue of hoomelessness. The collaboration allows for open communication about our local homeless and prevents duplication of services.  Please give me a call at (310) 285-2535 if you would like to hear more details. \nJim Latta, L.C.S.W.\n\n\nMr. Betts,\n\nThe City of Beverly Hills General Plan states that the city will provide a social services safety-net for the vulnerable members of this community.  As part of this safety-net Human Services provides assessment and referral for a number of services that are supported through the Community Assistance Grant Fund Process.  These services include shelter beds, permenant supportive housing, showers, health and case management.  The City of Beverly Hills has an homeless outreach team that engages and offers assistance to the homeless members of this community.  In addition to this service, we have no camping and aggressive panhandling ordinances. After offering assistance, we enforce the ordinances as a last resort.  We then work with the City prosecutor and County District Attorney to offer help instead of jail when the individual appears in court. To establish a consistent approach, we have a Homeless Collaboration that meets once a month made up of city employess (PD, Library, park maintenance, outreach team, parking), social service providers, faith-based organizations and interested residents to work together on the issue of hoomelessness. The collaboration allows for open communication about our local homeless and prevents duplication of services.  Please give me a call at (310) 285-2535 if you would like to hear more details. \n\nJim Latta, L.C.S.W.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-08-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Gregory Betts", 
  "id": 22656, 
  "score": "1", 
  "tags": [
    "Healthy Living", 
    "Parks and Recreation"
  ], 
  "text": "\n\nDear Colleagues,\nI am seeking your feedback on the following If applicable to your city:   \nHow has your city addressed the issue of homeless individuals camping out overnight at a public facility such as a community center or library?\nDo you have a regulation or ordinance that forbids overnight camping at a public facility?\nDo city staff or a social service partner do any outreach to the homeless who congregate at public facilities in your city?\nDo you have a “shower program” for the homeless at any of your sites and if so, how is it operated?\nThank you in advance for any feedback you have in regards to how your city addressed this issue.  Please respond directly to Minka.VanDerZwaag@CityofPaloAlto.org\nKind Regards,\nGreg Betts, Director\nCommunity Services Department\nCity of Palo Alto\n\n", 
  "title": "Camping at Public Facility - homeless", 
  "when": "22-07-2013"
}