{
  "answer_by": "15-07-2012", 
  "answers": [
    {
      "author": "Kathryn Gregory", 
      "score": "0", 
      "text": "\n\nThe City of Peoria, AZ does not have a specific policy on flyers placed in City facilities.  We do have guidelines that limit posting to city related events and businesses.  See attached administrative procedures.\n\n\nThe City of Peoria, AZ does not have a specific policy on flyers placed in City facilities.  We do have guidelines that limit posting to city related events and businesses.  See attached administrative procedures.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-07-2012"
    }, 
    {
      "author": "Izabela Cieszynski", 
      "score": "0", 
      "text": "\n\nWe have public bulletin boards in the libraries where the public can post announcements as space allows.  We do not distribute flyers or notices in the library for events other than library sponsored events.\n\n\nWe have public bulletin boards in the libraries where the public can post announcements as space allows.  We do not distribute flyers or notices in the library for events other than library sponsored events.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-07-2012"
    }, 
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nCity Hall has large bulletin boards in every stairwell landing (9 total) for public postings. Customers can see the posts, and employees also like to see what's going on. Concerts and events, classes, rentals and services. No formal policy.\n\n\nCity Hall has large bulletin boards in every stairwell landing (9 total) for public postings. Customers can see the posts, and employees also like to see what's going on. Concerts and events, classes, rentals and services. No formal policy.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-07-2012"
    }
  ], 
  "answers_count": 3, 
  "author": "Erin Bryce", 
  "id": 22003, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Innovation", 
    "Citizen Engagement", 
    "Citizen Education", 
    "Libraries", 
    "Partnerships"
  ], 
  "text": "\n\nDo you have a written policy in regards to the brochures, flyers, and printed publications that are allowed to be placed in your City Hall and/or facility? Perhaps you have a special part of City Hall dedicated to community brochures and flyers. Or, maybe you have a policy that dictates that only government agency material is allowed to be displayed. Do you allow newspapers, newsletters, and magazines to be placed on tables for distribution? The City of North Port is looking into creating a written policy that defines what material is allowed and not allowed on the tabletops and brochure spaces of City Hall. If you have a written policy, please share. If you have any personal experience, please share. Thank you for your help with this!\n\n", 
  "title": "Brochures in City Hall", 
  "when": "02-07-2012"
}