{
  "answer_by": "27-08-2010", 
  "answers": [
    {
      "author": "Richard Brown", 
      "score": "1", 
      "text": "\n\nElected officials will always \"talk\" to department heads.  In many cases they've known those people a lot longer than a manager that is new to the community.  My policy is that councilors can talk to department heads as would any other citizen and can ask questions but not direct or influence the department's activities.  I ask my department heads to let me know when they are contacted by a council member so that I'm not surprised at a later date.\nI've also asked council members to keep me in the loop when they talk to department heads.  That way I can ensure that items that concern them are addressed.   I also encourage our citizens and council members to use our on-line system to report problems and areas of concern.  That we we have a better record of work that is requested and it provides greater accountability.\n\n\nElected officials will always \"talk\" to department heads.  In many cases they've known those people a lot longer than a manager that is new to the community.  My policy is that councilors can talk to department heads as would any other citizen and can ask questions but not direct or influence the department's activities.  I ask my department heads to let me know when they are contacted by a council member so that I'm not surprised at a later date.\n\nI've also asked council members to keep me in the loop when they talk to department heads.  That way I can ensure that items that concern them are addressed.   I also encourage our citizens and council members to use our on-line system to report problems and areas of concern.  That we we have a better record of work that is requested and it provides greater accountability.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-08-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Barbara Adkins", 
  "id": 20338, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am looking for City Manager's that have put a policy in place as to how their Elected Officials shold be contacting city staff, i.e. Do you allow your Elected Officials to contact your \"front line\" staff directly; Can the Elected Officials contact your Department Heads Directly; or does your Elected Officials send all request through the City Managers Office?\nThanks\n\n", 
  "title": "Deputy City Manager", 
  "when": "24-08-2010"
}