{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jack Butler", 
      "score": "0", 
      "text": "\n\nNew twist to the question: Is it unethical for me to respond to a political poll asking for whom I intend to vote?\n\n\nNew twist to the question: Is it unethical for me to respond to a political poll asking for whom I intend to vote?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-10-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Jack Butler", 
  "id": 21400, 
  "score": "3", 
  "tags": [
    "Ethics"
  ], 
  "text": "\n\nIn addition to being a member of ICMA, I am the ethics officer of another professional association serving the public sector and recently used the example of ICMA's Code of Ethics in an article on the interaction of such codes when someone is a member of more than one association that has adopted a code of ethics.  This reference and the decision of a good friend to run for sheriff in a distant county led to a lot of personal thought and discussion regarding the implementation of Tenet 7.  Some of that discussion was with Martha Perego, ICMA's ethics director, who suggested that I pose the issue here for a wider discussion.\nTenet 7 says, \"Refrain from all political activities which undermine public confidence in professional administrators.  Refrain from participation in the election of the members of the employing legislative body.\"  In the ethics guidelines, this tenet has been interpreted as meaning that no ICMA member can participate in any candidate election in any way, anywhere.    \nThe tenet focuses its prohibition with regard to participation in the electoral process to the legislative body governing the member's employment.  This is an extension of the general prohibition regarding conflicts of interest.  Where I am having trouble is getting from this specific prohibition to the broad application to all elections everywhere.  Why does the tenet separately prohibit supporting elected officials within the member's own political unit?  It would seem that if the tenet actually provided a blanket prohibition in the first sentence, that such direction gets the job done.  Why make this distinction when the effective interpretation is that a member cannot support any candidate for any elective office?  \"Never\" would seem to remove the need for \"in this instance.\"\nI can understand having nothing to do with local elections, maybe even state and federal elections within which the employing local jurisdiction exists.  But how does my sending $50 to my friend in another county who is running for election as sheriff have any connection at all to my working on the other side of the state?  It might even be possible to argue that the guidelines are an unethical expansion of the Code of Ethics through their interference with the legal right of each member to participate in the political process as a citizen where a conflict of interest does not exist.  Perhaps it was decided that all elections present a conflict of interest?  If that is true, then it would seem that none of us could do any consulting work for other units of government; however, such work is explicitly permitted.\nLastly, as a point of grammar, I don't think that we can define \"refrain\" as being equivalent to \"shall not.\"  It is more analogous to \"try not to.\"  Besides, there is no ethical prohibition against participating in political causes.  Indeed, the ethical guidelines note, \"Members share with their fellow citizens the right and responsibility to vote and to voice their opinion on public issues.\"  It would seem that these can be as fraught with career dangers as personal elections and, indeed, often exist in the same venue.  Issues are rarely politically neutral.  I can't see the logical or ethical difference between participating in an issue campaign and participating in a political office campaign.\nThis is all a long way of getting to the general question: Can anyone help me understand the chain of logic that got us from \"Don't do this one thing\" to \"Don't do anything\"?  Thanks.\n\n", 
  "title": "Reconsideration of guidelines on Tenet 7", 
  "when": "05-10-2011"
}