{
  "answer_by": null, 
  "answers": [
    {
      "author": "Michael Silvestri", 
      "score": "0", 
      "text": "\n\nI would respectfully disagree with the proposal. I heartily concur with Phillip Munck's comments.  It would be an exercise to meet another GASB requirement that in many municipalities will result in useless numbers.  PA is also like Hew Hampshire where many small municipalities would have the same opinion.\n\n\nI would respectfully disagree with the proposal. I heartily concur with Phillip Munck's comments.  It would be an exercise to meet another GASB requirement that in many municipalities will result in useless numbers.  PA is also like Hew Hampshire where many small municipalities would have the same opinion.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-01-2012"
    }, 
    {
      "author": "Lee Erdmann", 
      "score": "0", 
      "text": "\n\nAs a former town manager, city manager, chief operating officer and currently a chief administrative and financial officer i have seen the value of multi-year financial forecasts. Although each successive year is that much less accurate, these forecasts do help to structure and stimulate a dialogue with elected policy leaders concerning financial trends and the financial policy choices being faced by the community. If not required, multi-year forecasts should at least be encouraged. Perhaps they should be required for communities with a history of financial problems.\n\n\nAs a former town manager, city manager, chief operating officer and currently a chief administrative and financial officer i have seen the value of multi-year financial forecasts. Although each successive year is that much less accurate, these forecasts do help to structure and stimulate a dialogue with elected policy leaders concerning financial trends and the financial policy choices being faced by the community. If not required, multi-year forecasts should at least be encouraged. Perhaps they should be required for communities with a history of financial problems.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-01-2012"
    }, 
    {
      "author": "Charles Dobbins", 
      "score": "0", 
      "text": "\n\nI am a retired City Manager residing in Michiagn and I support the GASB proposal for five year financial projections/plan.  The vast majority of my City Management career was in Hinsdale Illinois where we used five year finacial plans, updated each year, dating back to the early 80`s, as a very effective  management tool for anticipating the impact of revenue and expense trends on the financial condition of the Village. This allowed for making small course changes early on as oposed to more drastic ones in the future.  I think that five year financial plans should have been more widely used in recent years with the benefit  of helping communities to make fiscally sound  decisions and avoid the  financial problems some are now faced with. It is interesting to note that in Michigan there is a requirement that communities prepare, actually the Plan Commissons, a six year Capital Improvement   plan but no requirement for long range financial planning.\n\n\nI am a retired City Manager residing in Michiagn and I support the GASB proposal for five year financial projections/plan.  The vast majority of my City Management career was in Hinsdale Illinois where we used five year finacial plans, updated each year, dating back to the early 80`s, as a very effective  management tool for anticipating the impact of revenue and expense trends on the financial condition of the Village. This allowed for making small course changes early on as oposed to more drastic ones in the future.  I think that five year financial plans should have been more widely used in recent years with the benefit  of helping communities to make fiscally sound  decisions and avoid the  financial problems some are now faced with. It is interesting to note that in Michigan there is a requirement that communities prepare, actually the Plan Commissons, a six year Capital Improvement   plan but no requirement for long range financial planning.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-01-2012"
    }, 
    {
      "author": "Philip Munck", 
      "score": "0", 
      "text": "\n\nI heartily endorse the idea that multi-year plans should be made and particularly that they form the basis of sensitivity analyses.  I object to the notion that these should be a portion of a, presumably, auditable financial statement.  Most jurisdictions engage in some sort of capital improvement planning which involve a choice for the ensuring fiscal year and potential projects for the out years.  No sensible person views year 2 of such a plan as a binding commitment on the community much less the year 6 portion of the plan.\nThe issue is not whether long range planning should be a part of the management process but whether it should be mandated by GASB.\nI submit that it should not.\n\n\nI heartily endorse the idea that multi-year plans should be made and particularly that they form the basis of sensitivity analyses.  I object to the notion that these should be a portion of a, presumably, auditable financial statement.  Most jurisdictions engage in some sort of capital improvement planning which involve a choice for the ensuring fiscal year and potential projects for the out years.  No sensible person views year 2 of such a plan as a binding commitment on the community much less the year 6 portion of the plan.\nThe issue is not whether long range planning should be a part of the management process but whether it should be mandated by GASB.\nI submit that it should not.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-01-2012"
    }, 
    {
      "author": "Richard Brown", 
      "score": "0", 
      "text": "\n\nMulti-year forecasting is great tool for managing a community.  Even though the accuracy of the forecasts diminish in the out years it is an important tool for understanding the community's long term requirements.  This is especially important when analyzing the impacts of collective bargaining agreements.  Too often we have traded a one year no increase contract for many years of expenses that are unaffordable.  That being said this should be a management tool and not a GASB requirement.  GASB is becoming increasingly expensive and irrelevant to small communities .\n\n\nMulti-year forecasting is great tool for managing a community.  Even though the accuracy of the forecasts diminish in the out years it is an important tool for understanding the community's long term requirements.  This is especially important when analyzing the impacts of collective bargaining agreements.  Too often we have traded a one year no increase contract for many years of expenses that are unaffordable.  That being said this should be a management tool and not a GASB requirement.  GASB is becoming increasingly expensive and irrelevant to small communities .\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-01-2012"
    }, 
    {
      "author": "Susan Robertson", 
      "score": "0", 
      "text": "\n\nThere is value in multi-year forecasting, but the burden on small communities with limited staffing is too great to make it a GASB requirement.  Perhaps GASB should make a list of recommended best practices of which multi-year forecasting would be one.  At most, a statement acknowledging those best practices and indicating whether or not they're followed (and, if not, why) in the MD&A would be appropriate.\n\n\nThere is value in multi-year forecasting, but the burden on small communities with limited staffing is too great to make it a GASB requirement.  Perhaps GASB should make a list of recommended best practices of which multi-year forecasting would be one.  At most, a statement acknowledging those best practices and indicating whether or not they're followed (and, if not, why) in the MD&A would be appropriate.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-01-2012"
    }, 
    {
      "author": "Jim Saco", 
      "score": "0", 
      "text": "\n\nIn San Mateo County we've been doing five year forcasts since December 2007 and find it to be a very useful tool in determining how revenue and expenditure assumptions as well as past and present decisions will impact future budgets.  That said, this should NOT be a mandated requirement in the financial statements.\n\n\nIn San Mateo County we've been doing five year forcasts since December 2007 and find it to be a very useful tool in determining how revenue and expenditure assumptions as well as past and present decisions will impact future budgets.  That said, this should NOT be a mandated requirement in the financial statements.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-01-2012"
    }
  ], 
  "answers_count": 7, 
  "author": "Philip Munck", 
  "id": 21590, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting"
  ], 
  "text": "\n\nThe fundamental question that GASB needs to address is whether it is relevant to the real world any more.  As a manager (I am now retired) I could make a 100-year projection for my community if I so desired:  debt service will be whatever bonds are outstanding or will be voted, inflows (in New Hampshire) will be whatever is needed to cover the outflows which will be voted upon every year.\nIn New Hampshire there are 233 cities and towns plus village districts and school districts.  The median population municipality is about 2,200 souls.  Most towns look at GASB 34 and 45 and say, \"We don't need that.\"  Since non-compliance with GASB means a qualified audit opinion, why bother with audits at all.  Forecasting five-year cash flows at the local level is nonsense if the best economists in the world are barely able to forecast a month or two into the future much less a year.  Indeed, Congress is about to launch into yet another pig fight over spending levels after the last two-month battle.\nI can appreciate GASB wanting to have local governments look into the future to prevent debacles like Detroit's current plight but would Detroit have behaved any better with a five-year projection of being broke than it already has?\n\n", 
  "title": "GASB five-year cash flow projection proposal", 
  "when": "03-01-2012"
}