{
  "answer_by": null, 
  "answers": [
    {
      "author": "Christine Thompson", 
      "score": "0", 
      "text": "\n\nMark,\nWe are currently running an 8 week step contest and many of our elected officials are participating.  We may be a bit unique however in that we have several elected officials who are extremely active (marathons, biking, etc) and were former military.  We have 3 activity levels participants self designate.  One of our elected won the first week in the highest activity level. I do not personally see any downsides and I have yet to hear any from others.  We are in our 4th week.  Feel free to contact me if you'd like more information on our endeavors!\nChristine\n\n\nMark,\nWe are currently running an 8 week step contest and many of our elected officials are participating.  We may be a bit unique however in that we have several elected officials who are extremely active (marathons, biking, etc) and were former military.  We have 3 activity levels participants self designate.  One of our elected won the first week in the highest activity level. I do not personally see any downsides and I have yet to hear any from others.  We are in our 4th week.  Feel free to contact me if you'd like more information on our endeavors!\nChristine\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-10-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Mark Abeles-Allison", 
  "id": 22776, 
  "score": "0", 
  "tags": [
    "Healthy Living", 
    "Health"
  ], 
  "text": "\n\nOur county has put on a number of wellness competitions and other activities with employees.  I was wondering if anyone has experience involving elected board or council members?  It seems like it would be a great way to allow board members an opportunity to get first hand involvement in wellness/prevention programming.  This could help reinforce or strengthen support for such programs.  Before doing this I would like to get some feedback on what other communities may have experienced with this, specifically do you see any downsides?  Thanks.\n\n", 
  "title": "Wellness competitions with board or council members?", 
  "when": "12-10-2013"
}