{
  "answer_by": null, 
  "answers": [
    {
      "author": "Matthew McQuillen", 
      "score": "0", 
      "text": "\n\nInteresting question, my guess is Chief of Staff to the First Selectman.\n\n\nInteresting question, my guess is Chief of Staff to the First Selectman.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-06-2011"
    }, 
    {
      "author": "Mark Levin", 
      "score": "0", 
      "text": "\n\nIn our region of the Midwest their are several similar professional positions with the title Assistant to the Mayor. So, Assistant to the First Selectman.\n\n\nIn our region of the Midwest their are several similar professional positions with the title Assistant to the Mayor. So, Assistant to the First Selectman.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-06-2011"
    }, 
    {
      "author": "Jeff Butters", 
      "score": "0", 
      "text": "\n\nombudsman\n\n\nombudsman\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-06-2011"
    }, 
    {
      "author": "Gerard Driscoll", 
      "score": "0", 
      "text": "\n\nAdminstrative Assistant to the First Selectman.\n\n\nAdminstrative Assistant to the First Selectman.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-06-2011"
    }, 
    {
      "author": "Jay Gsell", 
      "score": "0", 
      "text": "\n\nAlso fairly common in CT Town Mtg local governments; I'm familiar with a current such professional in the CT Gold Coast area who someday wants to become one of us- ICMA CAO type.\n\n\nAlso fairly common in CT Town Mtg local governments; I'm familiar with a current such professional in the CT Gold Coast area who someday wants to become one of us- ICMA CAO type.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-06-2011"
    }, 
    {
      "author": "Philip Munck", 
      "score": "0", 
      "text": "\n\nThis position cannot be named without knowing at least the nominal duties and responsibilities of the mentioned Town Administrator.  It is hard to envision this being other than a move away from professional management.  Good luck!\n\n\nThis position cannot be named without knowing at least the nominal duties and responsibilities of the mentioned Town Administrator.  It is hard to envision this being other than a move away from professional management.  Good luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-06-2011"
    }
  ], 
  "answers_count": 6, 
  "author": "[Anonymous]", 
  "id": 21097, 
  "score": "0", 
  "tags": [
    "Hiring", 
    "Strategic Planning", 
    "Management", 
    "Organizational Development", 
    "Career Resources"
  ], 
  "text": "\n\nThis position supervises on a constant, ongoing basis the translation of the First Selectman’s management philosophy, goals, and objectives into active terms that directly benefit each resident. The incumbent will assist the First Selectman substantially and effectively in the task of providing leadership in developing, achieving, and maintaining the best possible programs and services. Reports to the First Selectman and works collaboratively as a member of the First Selectman’s Management Team. \nThis position coordinates activities of the Office of the First selectman with other divisions and departments. In addition, this position represents the First Selectman at meetings when required and appropriate; advises the First Selectman and Town Administrator, providing extensive professional assistance, project management, and recommendations on Town issues and performs highly responsible management work covering a broad range of municipal activities, including the supervision of staff assigned to the Office of the First Selectman. Work involves dealing with the public with tact and diplomacy, assisting the First Selectman with communications regarding citizen concerns and making independent decisions for the benefit of the organization. This is a professional position requiring extensive experience with policy development, legislation, intergovernmental relations, and lobbying, with exceptional analytical and communication skills.\nRules: You cannot use the words \"Assistant Town Administrator\"\nBonus: The title will be universally understood by future potential employers\nPrize: You get to know my identity and will be the recipient of my enduring professional admiration.  \nGo!\n\n", 
  "title": "Name this job:", 
  "when": "07-06-2011"
}