{
  "answer_by": null, 
  "answers": [
    {
      "author": "Sheri Campbell-Husband", 
      "score": "1", 
      "text": "\n\nWhile I agree that, under the right circumstances, there is value in 'going through the process' of applying and interviewing for jobs you're not sure you'd get, I don't think I'd advise taking that approach within the organization that currently employs you (and with which you presumably wish to stay).  Take the time you need and decide if this really is a position you'd be interested in.  Take the time to formulate ideas about how you would address the morale issue if you got the position 'over' sitting department heads.  Then determine whether applying for the position is right for you.\nJust because you're not a department director now doesn't mean you're not qualified for the job; especially if you've been an administrator before.  If you're really worried about the department heads' responses, think about whether there are members of that group with whom you'd feel comfortable discussing the issue before you make your decision.  (Especially if there are directors you KNOW don't plan to apply for the CM job themselves.)  It's admirable to be concerned about the organizational dynamic, but if you feel your service as CM could bring value to the community and the organization, maybe you'd be helping, more than hurting the City if you applied and made a real effort to be appointed.  You just have to plan for how you'd handle yourself and your relationships with your co-workers AFTER the appointment, no matter who ends up with the job.\n\n\nWhile I agree that, under the right circumstances, there is value in 'going through the process' of applying and interviewing for jobs you're not sure you'd get, I don't think I'd advise taking that approach within the organization that currently employs you (and with which you presumably wish to stay).  Take the time you need and decide if this really is a position you'd be interested in.  Take the time to formulate ideas about how you would address the morale issue if you got the position 'over' sitting department heads.  Then determine whether applying for the position is right for you.\n\nJust because you're not a department director now doesn't mean you're not qualified for the job; especially if you've been an administrator before.  If you're really worried about the department heads' responses, think about whether there are members of that group with whom you'd feel comfortable discussing the issue before you make your decision.  (Especially if there are directors you KNOW don't plan to apply for the CM job themselves.)  It's admirable to be concerned about the organizational dynamic, but if you feel your service as CM could bring value to the community and the organization, maybe you'd be helping, more than hurting the City if you applied and made a real effort to be appointed.  You just have to plan for how you'd handle yourself and your relationships with your co-workers AFTER the appointment, no matter who ends up with the job.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-08-2010"
    }, 
    {
      "author": "John Garvison", 
      "score": "1", 
      "text": "\n\nI just went through something similar in my organization, about two months after I was hired as the Chief Financial Officer (CFO) of my organization, the District Manager resigned. I thought long and hard about applying for the position of District Manager and struggled with many of the same issues it sounds like you are struggling with. I waited until the last day the recruitment was open to decide I did not want to apply. I mainly waited to see if there would be some credible candidates, which there were. Once, I saw there were credible candidates applying, it made my decision easier to not apply for the post of District Manager.\nI believe I made the right decision for myself and my family because the new district manager seems to be the right 'fit' and I am not sure if I would have been in this organization. It is a highly personal decision and one I hope you find the guidance necessary to make the right decision for you, your family, and your organization.\nGood luck!\n\n\nI just went through something similar in my organization, about two months after I was hired as the Chief Financial Officer (CFO) of my organization, the District Manager resigned. I thought long and hard about applying for the position of District Manager and struggled with many of the same issues it sounds like you are struggling with. I waited until the last day the recruitment was open to decide I did not want to apply. I mainly waited to see if there would be some credible candidates, which there were. Once, I saw there were credible candidates applying, it made my decision easier to not apply for the post of District Manager.\n\nI believe I made the right decision for myself and my family because the new district manager seems to be the right 'fit' and I am not sure if I would have been in this organization. It is a highly personal decision and one I hope you find the guidance necessary to make the right decision for you, your family, and your organization.\n\nGood luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-08-2010"
    }, 
    {
      "author": "Robert Carty", 
      "score": "0", 
      "text": "\n\nTeam chemistry is certainly something to consider, and valuable to preserve. At the same time, if you apply for this position and are hired in a competitive process I think that should validate your credentials, regardless of where you're sitting now. If the department heads are team players, they should welcome and support you into the new position.\nThat said, I agree with John and Sheri's comments as well. If you are having feelings like this might not be the right move (or you're not sure you even want the position), explore that more. Sometimes I like to work out issues using +/- charts, listing all the things that would be good/great about the question at hand and all the negatives. Then you can see that sometimes, quite clearly, the good outweighs the bad. If you want to get creative you can even add values/weights to the items listed so that one bad item might outweigh all the good (or visa-versa).\nAlso, decisions like this should definitely be made with your family (if you're in that position). As you've been an administrator before, you're aware of the stability issue. Good luck!\n\n\nTeam chemistry is certainly something to consider, and valuable to preserve. At the same time, if you apply for this position and are hired in a competitive process I think that should validate your credentials, regardless of where you're sitting now. If the department heads are team players, they should welcome and support you into the new position.\n\nThat said, I agree with John and Sheri's comments as well. If you are having feelings like this might not be the right move (or you're not sure you even want the position), explore that more. Sometimes I like to work out issues using +/- charts, listing all the things that would be good/great about the question at hand and all the negatives. Then you can see that sometimes, quite clearly, the good outweighs the bad. If you want to get creative you can even add values/weights to the items listed so that one bad item might outweigh all the good (or visa-versa).\n\nAlso, decisions like this should definitely be made with your family (if you're in that position). As you've been an administrator before, you're aware of the stability issue. Good luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-08-2010"
    }
  ], 
  "answers_count": 3, 
  "author": "[Anonymous]", 
  "id": 20299, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nOur current CM has recently announced he will retiring within the next six months.  I have been with this city for the last four years in a managment/analysts role.  Before I came here I was an administrator with another community for three years.  I came to this position for the stability.\nSince our current CM is retiring, I have given the thought of applying for the position, but I am not sure if it is an appropriate course of action.  First off, I am not worried, but maybe concerned, about the reaction.  How would it look if a non-department head applied for the CM position?  If I were fortunate enough to get the job, would this put the department heads in a really uncomfortable position and throw off team chemistry (which is highly valued here).  \nSecond, while this announcement has been made, I haven't fully digested whether I want this job or not.  There is still a good deal of thinking, talking, praying, that needs to go on.  But, even if I don't necessarily want the job, to go through the process of putting myself out there is something I see some value in, or at least gain some valuable insights from, because I do know I would like to have a CM job someday.\nI am sure there are folks with a lot of thoughts and I am interested in hearing them.\n\n", 
  "title": "What should I do?", 
  "when": "06-08-2010"
}