{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nDavid, unfortunately a 2008 feasibility study sits precariously on the precipice of having no value.  Such feasibility studies usually have a shelf life of value of no more than 4 years and many are considered outdated in 3 years.  The reality of accomplishing what you describe is that there will a need for a public investment as an inducement to generate private investing in a hotel/conference facility.  The public investment can take the form of land banking to make available ready to build land, a property tax break through a TIF, public infrastructure improvements to a site (i.e. new roads, water/sewer lines, etc.).  In this aggressive market place, if a hotel has not been built then to make it happen will need public contribution.  Finally, it is of value to look hard in a 30 mile radius to see what name brand hotels are already operating because even with a good feasibility study the market may appear saturated, again, without public inducements.\n\n\nDavid, unfortunately a 2008 feasibility study sits precariously on the precipice of having no value.  Such feasibility studies usually have a shelf life of value of no more than 4 years and many are considered outdated in 3 years.  The reality of accomplishing what you describe is that there will a need for a public investment as an inducement to generate private investing in a hotel/conference facility.  The public investment can take the form of land banking to make available ready to build land, a property tax break through a TIF, public infrastructure improvements to a site (i.e. new roads, water/sewer lines, etc.).  In this aggressive market place, if a hotel has not been built then to make it happen will need public contribution.  Finally, it is of value to look hard in a 30 mile radius to see what name brand hotels are already operating because even with a good feasibility study the market may appear saturated, again, without public inducements.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-02-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "David Dillner", 
  "id": 22411, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Housing & Community Development", 
    "Incentives", 
    "Economic Development"
  ], 
  "text": "\n\nThe City would like to attract a new hotel to the community due of a lack of quality hotels. A hotel feasibility study was done in 2008 and it determined that it was feasible to open a new hotel in the community. Despite this determination, a new hotel has yet to locate in the community. The City is still interested in recruiting a hotel, ideally with a small convention center to allow for a better meeting venue. \nIn my observation, the major setbacks are lack of local investors and the price of land. Does anyone have any good ideas for addressing the price of land when it is presumable priced too high and will not sell? This is obviously a private market issue, but without the price of the land being reduced, the prime locations for a hotel will not become productive.\nAdditionally, what should the City's role, if any, be with respect to recruiting local investors? Do you have any advice for recruiting a hotel? Did you offer any incentives? What role did your Convention and Visitors Bureau have in recruiting the hotel?\nThanks.\n\n", 
  "title": "Hotel Development", 
  "when": "05-02-2013"
}