{
  "answer_by": null, 
  "answers": [
    {
      "author": "Martha Marshall", 
      "score": "1", 
      "text": "\n\nIn the late 1990s I ran the Innovation Awards program while an internal consultant for Prince William County VA.  We had a pretty successful chain of events over 3 or 4 years but the initiative was not sustained for a variety of reasons...some budgetary, some top leadership turnover...some need for \"re-energizing\".   Years later (older and wiser?) I see the biggest key to long term success is to focus less on events and more on how to sustain a culture of innovation.  There's a lot of exciting information available on this topic.   You need a team of champions from top leadership willing to assess the organization's current capacity for innovation and develop specific strategies to nurture it on a sustained basis.  An event is a potential way to get started but you need a framework for innovation to get lasting results.  I'd be hapy to share some additional ideas on leading innovation if this topic is of interest to you.\n\n\nIn the late 1990s I ran the Innovation Awards program while an internal consultant for Prince William County VA.  We had a pretty successful chain of events over 3 or 4 years but the initiative was not sustained for a variety of reasons...some budgetary, some top leadership turnover...some need for \"re-energizing\".   Years later (older and wiser?) I see the biggest key to long term success is to focus less on events and more on how to sustain a culture of innovation.  There's a lot of exciting information available on this topic.   You need a team of champions from top leadership willing to assess the organization's current capacity for innovation and develop specific strategies to nurture it on a sustained basis.  An event is a potential way to get started but you need a framework for innovation to get lasting results.  I'd be hapy to share some additional ideas on leading innovation if this topic is of interest to you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-07-2013"
    }, 
    {
      "author": "William Lutz", 
      "score": "0", 
      "text": "\n\nMercy...we tried this earlier this year with our department heads.  We brought in an outside party to help lead the discussion and there was good buzz about the event leading up to it.  However, during the event, it became clear that many of the department heads were not big on the \"innovation ideas\" as some their comments came across as negative and could easily be described as disruptive.  I think the lesson we learned is that in order for us to be more innovative, we are going to have to do a lot of hand holding with some folks.\n\n\nMercy...we tried this earlier this year with our department heads.  We brought in an outside party to help lead the discussion and there was good buzz about the event leading up to it.  However, during the event, it became clear that many of the department heads were not big on the \"innovation ideas\" as some their comments came across as negative and could easily be described as disruptive.  I think the lesson we learned is that in order for us to be more innovative, we are going to have to do a lot of hand holding with some folks.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-07-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Mercy Montgomery", 
  "id": 22623, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Innovation", 
    "Ethics", 
    "Career Resources", 
    "Organizational Development", 
    "Partnerships", 
    "Personnel Matters"
  ], 
  "text": "\n\nWe're working to create and implement an internal innovation event that involves City employees to promote creativity and collaboration in addressing challenges or taking advantage of opportunities identified by City employees.\nParticipants will be encouraged to work across levels and departments to foster creative ownership that transcends traditional divides within the organizational structure.\nHas anyone implemented a similar program in their City, County, community, or organization? \nIf so, what were the barriers? What were the extremely successful elements? \nDo you have any policies, forms, or competition handbooks that worked well that you would be willing to share? What would you consider to be the \"take-away\" from implementing the program?\nWe're still in the beginning stages of shaping the structure of the contest, but are hoping to start the competition soon so that winning projects have the possibility of funding for the next budget cycle. \nAny advice, feedback, or information would be greatly appreciated!\nThanks,\nMercy Montgomery\n\n", 
  "title": "Innovation Event for City Employees", 
  "when": "01-07-2013"
}