{
  "answer_by": null, 
  "answers": [
    {
      "author": "Kevin Duggan", 
      "score": "0", 
      "text": "\n\nHi John:\nThanks for your question.  It is difficult to suggest a particular range for your area since so much depends on the cost of living and other factors that are specific to a particular location.  As background, I suggest you take a look at ICMA's Compensation Guidelines.  This document can be found in the Knowledge Network collection (if you have any difficulty finding it, just e-mail me at kduggan@icma.org).  As noted in the guidelines, local comparability  (to other public service professionals) is a very important factor as is the local cost of living.  While I suggest you take a look at the other city/county managers in your state (though size comparability may well be an issue), you may also need to look at other public service professionals such as school superintendents or certain positions of comparable responsibility in state government (using number of employees, size of budget, etc. in the comparison). \nAnd, of course, it will be critical to consider how much money is likely to be saved by having a professional manager on board.  it would be unusual for the cost of a city or county manager not to pale in comparison to the cost savings realized via increased efficiency, more effective economic development initiatives, etc.  \nI hope this information is of assistance.  If you would like to talk to me about this, give me a call at 650-888-5850.\nKevin C. Duggan\nWest Coast Regional Director, ICMA\n\n\nHi John:\n\nThanks for your question.  It is difficult to suggest a particular range for your area since so much depends on the cost of living and other factors that are specific to a particular location.  As background, I suggest you take a look at ICMA's Compensation Guidelines.  This document can be found in the Knowledge Network collection (if you have any difficulty finding it, just e-mail me at kduggan@icma.org).  As noted in the guidelines, local comparability  (to other public service professionals) is a very important factor as is the local cost of living.  While I suggest you take a look at the other city/county managers in your state (though size comparability may well be an issue), you may also need to look at other public service professionals such as school superintendents or certain positions of comparable responsibility in state government (using number of employees, size of budget, etc. in the comparison). \n\nAnd, of course, it will be critical to consider how much money is likely to be saved by having a professional manager on board.  it would be unusual for the cost of a city or county manager not to pale in comparison to the cost savings realized via increased efficiency, more effective economic development initiatives, etc.  \n\nI hope this information is of assistance.  If you would like to talk to me about this, give me a call at 650-888-5850.\n\nKevin C. Duggan\nWest Coast Regional Director, ICMA\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-06-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "John Hoff", 
  "id": 22611, 
  "score": "0", 
  "tags": [
    "Human Resources"
  ], 
  "text": "\n\nI would like some kind of an idea as to how much a County Manager would expect to receive for a community of approximately 65,000 population that has about 1 million visitors per year.  The location would be Kaua'i, Hawaii.\nThere is talk on our island from many voters interested in hiring a County Manager.  I am starting from \"square 1\" at this present moment.  Can you give me a range of salaries that would attract a responsible County Manager?  I understand that there are a lots of factors that must be considered but right now I am looking for an range of salary that would be legitimate, realistic.\nJohn Hoff\nKaua'i, Hawaii\n\n", 
  "title": "Party needing info for a County Manager in Hawaii", 
  "when": "24-06-2013"
}