{
  "answer_by": null, 
  "answers": [
    {
      "author": "Amanda Dodge", 
      "score": "0", 
      "text": "\n\nHi Brian,\nUnfortunately since I am not a local government leader I am unable to provide you with any personal experience on the matter.  I’ve tried to compile a few other examples of public-private partnerships that seem relevant to your ideas. \nThe city of Reno, Nevada was nominated for an award based on its efforts with local hotel-casinos to develop a “bridge loan” to fund the creation of a whitewater recreation park. This park brought new community recreational opportunities, enhanced the quality of life for residents and visitors, and added new life to the downtown area. This program appeared similar to some of your ideas: \nhttp://bit.ly/hx5B7w\nAdditionally, the city of Rolling Meadows, Illinois created a partnership with a business called 3Com to aid in the redevelopment of a vacant lot and to foster new partnerships. \nhttp://bit.ly/eoXO2r\nI hope these are helpful in getting you started!\nAmanda Dodge\nInternational City/County Management Association\nKnowledge Network Intern\n202-962-3699\nadodge@icma.org\n\n\nHi Brian,\n\nUnfortunately since I am not a local government leader I am unable to provide you with any personal experience on the matter.  I’ve tried to compile a few other examples of public-private partnerships that seem relevant to your ideas. \n\nThe city of Reno, Nevada was nominated for an award based on its efforts with local hotel-casinos to develop a “bridge loan” to fund the creation of a whitewater recreation park. This park brought new community recreational opportunities, enhanced the quality of life for residents and visitors, and added new life to the downtown area. This program appeared similar to some of your ideas: \nhttp://bit.ly/hx5B7w\n\nAdditionally, the city of Rolling Meadows, Illinois created a partnership with a business called 3Com to aid in the redevelopment of a vacant lot and to foster new partnerships. \nhttp://bit.ly/eoXO2r\n\nI hope these are helpful in getting you started!\nAmanda Dodge\nInternational City/County Management Association\nKnowledge Network Intern\n202-962-3699\nadodge@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-04-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Brian Wilson", 
  "id": 20966, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting"
  ], 
  "text": "\n\nI know that there are many examples floating around of public/private partnerships to fund/build infrastructure.  I am looking for an example of something a little different.  \nHaving recently completed a Downtown Revitalization Plan, two proposed improvements are near a manufacturing area.  One involves a historic train depot and the other is a major intersection which serves as an entry way to downtown.  One industrial business owns and operates a plant that sits at one corner of the intersection and whose property surrounds the depot area.  I'd like to figure out a way to complete these two improvements through some type of partnership with the business owner as the city does not have the funding available to begin either project.  Grant funds and other funds are being prioritized directly in downtown.\nThe company in question bought the manufacturing plant and only occupies about one-third of the space.  They have attempted to find other tenants to move in and utilize the remaining space to no avail.  The owners of the plant cite location and appearance of the surrounding area as some of the hurdles to overcome.  This is another reason why I believe these two improvement projects could be of value to the business; to make the area more attractive.  It would also help tourism to the depot.  \nMy first impulse was the use of a TIF, but I'm not certain if the improvements would generate enough of an increment to make it practical.  \nAnother aspect of the situation concerns utility rates for the manufacturer.  Through an agreement with the previous City Council, they were paying a reduced rate on their demand electricity.  The current Council wants to revoke the ordinance which established the rate.  This incentive was worth about $54,000 a year to the manufacturer.  They want to reach some kind of agreement to reduce their operating costs.  \nI have two ideas for how to 1) provide an incentive to the manufacturer and beautify the surroundings while 2) providing a tangible project that will move our total Revitalization Plan forward.\nThe first is to ask the manufacturer to fund the improvements while the city repays the costs back over time through a credit on their electricity bill.  We would work out an agreement to credit a set monthly amount to the manufactuer for a period of 4-6 years.  Should they close the plant or drop below a certain level of activity, then they will forfeit the credit during those months.  Otherwise, they will be paid their investment back with a modest return while realizing the benefits of the local improvements.  \nThe second idea will not require as much risk on the part of the manufacturer, but I think creates more questions from an accounting standpoint.  I would propose that the city and manufacturer enter into an agreement to create a joint escrow account to complete the two projects.  The manufacturer will be billed the normal electric rate, but a percentage of their monthly payment to the city will be placed into escrow.  As the funding levels in the account build, work will begin on the projects.  For example, once adequate funds are in place to fund the engineering, the city and manufacturer will interview and hire an engineer to create the specs for the projects.  Both entities will be required to sign-off on any disbursements from the escrow account.  Should the plant be sold or closed, the escrow account's assets revert to the city.  \nI know that both plans have their own sets of risks and benefits, but are there any examples of such arrangements being used on projects?  \nAdvice and feedback on these ideas would be greatly appreciated!\n\n", 
  "title": "Public/Private Partnerships to fund public improvements", 
  "when": "20-04-2011"
}