{
  "answer_by": null, 
  "answers": [
    {
      "author": "UMMI KALTHUM SHUIB", 
      "score": "0", 
      "text": "\n\nI was in the MFTC programme. The question was asked by Mr Rudolph from Indonesia. We may not have something which is directly related to any charges to climate change. But in many countries, tax exemption is given to company which had spent on anything related to 'green Projects'. \nLocal Government can actually revise their charges on business licensing or even the property tax, in which a % of charges can be included if an entity does not adapt to any kind of environmental/green protection of their premises. On the hand, discount should be given to the entities which had implemented the kind of protections. Thanks\n\n\nI was in the MFTC programme. The question was asked by Mr Rudolph from Indonesia. We may not have something which is directly related to any charges to climate change. But in many countries, tax exemption is given to company which had spent on anything related to 'green Projects'. \nLocal Government can actually revise their charges on business licensing or even the property tax, in which a % of charges can be included if an entity does not adapt to any kind of environmental/green protection of their premises. On the hand, discount should be given to the entities which had implemented the kind of protections. Thanks\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-07-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Laura Hagg", 
  "id": 21992, 
  "score": "0", 
  "tags": [
    "Emergencies & Disasters", 
    "Climate Change", 
    "International Development", 
    "Sustainability", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nICMA is delivering a five-course Municipal Finance Training Certification program on behalf of a regional Infrastructure Finance Network (IFN) established by the World Bank in partnership with the Association of Southeast Asian Nations(ASEAN). During a session on local revenue generation, a participant from the Philippines asked about examples for charging climate change/disaster mitigation fees.  The participant was looking to develop a revenue source for supporting debt service on major flood mitigation projects.  \nIn the U.S. I know we have fees on water bills to support watershed protection, there is the Regional Greenhouse Gas Reduction Fund and some states have assessed a small fee on homeowners insurance to support disaster mitigation. Do you have any other examples to share?\nThanks!\n\n", 
  "title": "Funds to support climate change/disaster mitigation", 
  "when": "28-06-2012"
}