{
  "answer_by": "05-06-2013", 
  "answers": [
    {
      "author": "Julius Suchy", 
      "score": "0", 
      "text": "\n\nMilton, the big question for your board is what do they hope to accomplish with this type of information? I have seen communities that have a registration and charged a fee but they didn't do anything with the information and essentially it became a small revenue source with no teeth or enforcement. I have actually disbanded this type of registration program in a previous community because it served no purpose and was just another headache for the administration.\nIs the information going to be used for public safety purposes (building layouts, chemical inventory, etc)? If you determine what the purpose is of the registration it may help your board determine whether you need one or not.\n\n\nMilton, the big question for your board is what do they hope to accomplish with this type of information? I have seen communities that have a registration and charged a fee but they didn't do anything with the information and essentially it became a small revenue source with no teeth or enforcement. I have actually disbanded this type of registration program in a previous community because it served no purpose and was just another headache for the administration.\n\nIs the information going to be used for public safety purposes (building layouts, chemical inventory, etc)? If you determine what the purpose is of the registration it may help your board determine whether you need one or not.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-06-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Milton Agay", 
  "id": 22574, 
  "score": "0", 
  "tags": [
    "Planning"
  ], 
  "text": "\n\nMy board is going back and forth on the issue of enacting a business registration ordinance / license / permitting processes.  They have looked at many other communities, and have reviewed the typical public safety and economic development paragraphs contained in most.  What I am looking for is if anyone has done any kind of in depth look at the pros and cons of doing so as we've gone back and forth on this issue far to long and some guidance is needed as far as what it will help long term; as they municipality is in the process of extending water and sewer services out to the highway interchange and expects economic growth over time.  Plus they have no idea as to what types of businesses are being operated out of peoples homes.  We are reviewing all our ordinances, which for many have not been updated in years, and years.\n\n", 
  "title": "Business Registration Ordinance", 
  "when": "29-05-2013"
}