{
  "answer_by": null, 
  "answers": [
    {
      "author": "Tad McGalliard", 
      "score": "0", 
      "text": "\n\nHey Bob, When the city of Hampton, Virginia created their 311 customer contact center, they customer service staff from the departments that received the heaviest call volumes into the call center.  It provided an opportunity to identify the best support staff for that particular function.  The person that was most involved and is still the most knowledgeable about the transition was Liz Nisley who is now the call center manager.\n\n\nHey Bob, When the city of Hampton, Virginia created their 311 customer contact center, they customer service staff from the departments that received the heaviest call volumes into the call center.  It provided an opportunity to identify the best support staff for that particular function.  The person that was most involved and is still the most knowledgeable about the transition was Liz Nisley who is now the call center manager.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-02-2012"
    }, 
    {
      "author": "Cory Fleming", 
      "score": "0", 
      "text": "\n\nJust a quick note to say that Liz Nisley has retired, but DJ Russell could answer any questions about Hampton's 311 Contact Center.\n\n\nJust a quick note to say that Liz Nisley has retired, but DJ Russell could answer any questions about Hampton's 311 Contact Center.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-02-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Robert Harrison", 
  "id": 21673, 
  "score": "0", 
  "tags": [
    "Innovation", 
    "Management", 
    "Organizational Development", 
    "Personnel Matters", 
    "Shared Services", 
    "Strategic Planning", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nWe are exploring the creation of a shared services group.  Currently all support services are allocated within departments.  We are going to begin a pilot consolidating all support services in our Planning, Building, and Engineering Departments.  These staff would be brought under a shared services manager and cross trained across departments with assignments to the various departments based on work flow and needs.  If successful, we may implement City wide.\nI'm wondering if any other cities have consolidated their support services and shared them across the City or across departments.  How does it work for your city?  How have you allocated costs?  What successes and challenges have you experienced?  \nThanks,\nBob\n\n", 
  "title": "Support Services - Creating a shared services group", 
  "when": "10-02-2012"
}