{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Timothy, \nTo answer your question there are a few other local governments that have posted their parking ordinances on the Knowledge Network which you may find useful. \n\n\"Unified Development Code City of Dubuque, Iowa\" This has a wealth of information and you may find page 225 and onward useful. icma.org/Documents/Document/Document/301423\n-\"Automobile Parking Requirements\" goes over the City of Santa Barbra's parking ordinance. \n\nI hope you find these documents useful and that once you make a decision about what to do you post your case study to the Knowledge Network. From your previous questions it appears that this is a situation other communities are facing. \nBest, \nRobin Saywitz \nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nHi Timothy, \n\nTo answer your question there are a few other local governments that have posted their parking ordinances on the Knowledge Network which you may find useful. \n\n\n\"Unified Development Code City of Dubuque, Iowa\" This has a wealth of information and you may find page 225 and onward useful. icma.org/Documents/Document/Document/301423\n-\"Automobile Parking Requirements\" goes over the City of Santa Barbra's parking ordinance. \n\n\nI hope you find these documents useful and that once you make a decision about what to do you post your case study to the Knowledge Network. From your previous questions it appears that this is a situation other communities are facing. \n\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-11-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Timothy McLean", 
  "id": 22822, 
  "score": "0", 
  "tags": [
    "Planning"
  ], 
  "text": "\n\nResidents parking vehicles on the grass in front yards has been an issue for a few years now. There are some that have more than adequate parking and choose to do this anyway. And in other cases, we have lots that dont have much in the way of parking spaces. Many of our residents dont even have what would be considered an \"improved surface.\" I'm interested in hearing from communities with 5,000 or less residents. How have you gone about issues of yard parking? If this was just a case of folks having adequate space to park and parking on grass anyway, this would be easy to solve. The residents who have very little parking and no access to parking on the street are where it gets difficult. Has anyone encountered something like this?\n\n", 
  "title": "Residential Yard Parking", 
  "when": "07-11-2013"
}