{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHello Kathryn, \nHere are a few resources which I believe may help you find the mentor or job you are looking for. \n•   Try joining a few more groups like the “Careers in Local Government” group. In this group there is a mix of local government practitioners and those looking to get into local government. Additionally you can search through all of the groups to find ones focused on a specific region or state and join those groups on the east coast. While most of those groups are closed if you ask for approval you may get it if you explain your situation. The groups can be found here. \n•   Try browsing through the jobs section on the Knowledge Network. The jobs on this board are from all over the country and encompass a wide range of local government positions. \n•   Use the Who’s Who tool to find local government officials in the communities in which you would like to work and reach out to them. The search function is easy to use and on the lower left hand side of the screen. \nBest of luck in finding a mentor! I hope these resources help to get you started.\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nHello Kathryn, \nHere are a few resources which I believe may help you find the mentor or job you are looking for. \n•   Try joining a few more groups like the “Careers in Local Government” group. In this group there is a mix of local government practitioners and those looking to get into local government. Additionally you can search through all of the groups to find ones focused on a specific region or state and join those groups on the east coast. While most of those groups are closed if you ask for approval you may get it if you explain your situation. The groups can be found here. \n•   Try browsing through the jobs section on the Knowledge Network. The jobs on this board are from all over the country and encompass a wide range of local government positions. \n•   Use the Who’s Who tool to find local government officials in the communities in which you would like to work and reach out to them. The search function is easy to use and on the lower left hand side of the screen. \nBest of luck in finding a mentor! I hope these resources help to get you started.\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-09-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Kathryn Sinnott", 
  "id": 22736, 
  "score": "0", 
  "tags": [
    "Next Generation of Managers"
  ], 
  "text": "\n\nI am a career-changer and have been a member of the ICMA for several years.  I was a clinical social worker for approx. 10 years.  I rec'd my PHD in Educational Policy, Planning, and Leadership to obtain employment as a medical educator and worked in two med schools.  I obtained my MPA and experienced the internship and developed my own externship.  My skill set is varied, yet intertwined, allowing me to be a well-rounded person.\nI currently reside in Tucson, AZ, yet am seeking to return to the East Coast (from NJ down to SC are my preferences).  Unfortunately, the people with whom I'm associated iin the South West are not familiar with folks on the East.\nIs anyone interested in being a mentor to assist me in obtaining a position on the East (and returning home)?\nPlease email me at:  ksinnott_65@yahoo.com.  Thank you!\nKathryn Sinnott\n\n", 
  "title": "seeking a mentor", 
  "when": "17-09-2013"
}