{
  "answer_by": "05-08-2013", 
  "answers": [
    {
      "author": "Quentin McPhatter", 
      "score": "1", 
      "text": "\n\nI think your clerk is deserving of a pay raise in consideration of her new duties.  I do not think her pay should be anywhere near what your departing manager received, especially when you noted that your clerk is still seeking qualifications for her current position.  My thought on the Asst. to the Manager is that this person should receive a raise, especially if this person is taking on the duties of more than one staff person (and if the work is likely to remain with this staff person).\nJust my thoughts.....\n\n\nI think your clerk is deserving of a pay raise in consideration of her new duties.  I do not think her pay should be anywhere near what your departing manager received, especially when you noted that your clerk is still seeking qualifications for her current position.  My thought on the Asst. to the Manager is that this person should receive a raise, especially if this person is taking on the duties of more than one staff person (and if the work is likely to remain with this staff person).\n\nJust my thoughts.....\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-07-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Barbara Watts", 
  "id": 22660, 
  "score": "1", 
  "tags": [
    "Human Resources", 
    "Personnel Matters"
  ], 
  "text": "\n\nOur Village's Manager is leaving for another job.  We are thinking of having the Clerk serve as Interim Manager, with the current Assistant to the Manager helping out in the filed.  She'll get secretarial help if needed.  How do we determine her salary during tihs period?  She doesn't have the qualifications of a Manager (no degree, still working on qualifications to officially become a clerk).  Should we base it on the departing Manager's current salary (she rec'd big raise last year) or from the from her salary of 2012?  Also, should the Assistant to the Manager be given a temporary pay raise or a bonus?  \nAny advice would be appreciated, ASAP! Today would be great, but within the next week would be fine.\nThanks!\n\n", 
  "title": "Salary for an in-house appointment of Acting Manager", 
  "when": "23-07-2013"
}