{
  "answer_by": null, 
  "answers": [
    {
      "author": "Sam Anselm", 
      "score": "0", 
      "text": "\n\nIf your role in the CMO is one of policy developer/organizational analyst, I imagine that would present opportunities for you to get involved in a project that is/was created by one of the policies you worked on.  If a particular policy that you developed turns into a project or program, ask the CM if you can participate in some of the nuts & bolts aspects of the program. \nThat will demonstrate some initiative on your part, but also give you some of the ground-level experience you'll need to run a smaller city, if that's the route you decide to pursue.  Best of luck!\n\n\nIf your role in the CMO is one of policy developer/organizational analyst, I imagine that would present opportunities for you to get involved in a project that is/was created by one of the policies you worked on.  If a particular policy that you developed turns into a project or program, ask the CM if you can participate in some of the nuts & bolts aspects of the program. \n\nThat will demonstrate some initiative on your part, but also give you some of the ground-level experience you'll need to run a smaller city, if that's the route you decide to pursue.  Best of luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-06-2011"
    }, 
    {
      "author": "Eric Norenberg", 
      "score": "0", 
      "text": "\n\nI agree with Sam.  Volunteering to participate on projects, cross-departmental teams, special assignments, etc. is a great way to get hands on experience in a large organization.  During my career with a large city organization, I was fortunate to be able to make lateral moves, to ask for and be assigned to special cross-departmental teams, and receive special assignments and projects that gave me experience understanding and working with departments I would not otherwise have worked in.  Other suggestions include volunteering with professional organizations, community events and non-profits, and participating in community activities.  All of these things gave me the foundation to make the transition to City Manager.  Good luck!\n\n\nI agree with Sam.  Volunteering to participate on projects, cross-departmental teams, special assignments, etc. is a great way to get hands on experience in a large organization.  During my career with a large city organization, I was fortunate to be able to make lateral moves, to ask for and be assigned to special cross-departmental teams, and receive special assignments and projects that gave me experience understanding and working with departments I would not otherwise have worked in.  Other suggestions include volunteering with professional organizations, community events and non-profits, and participating in community activities.  All of these things gave me the foundation to make the transition to City Manager.  Good luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-07-2011"
    }, 
    {
      "author": "Timothy Hacker", 
      "score": "0", 
      "text": "\n\nIn addition to volunteering within your own organization, look for ways to enhance your skills by volunteering in community organizations or service clubs. These groups often thirst for your level of expertise and would be thrilled with help putting together a budget on Excel, or putting data together in a database program to provide analysis they hadn't had time or expertise to do. I too have served in smaller organizations and sometimes felt like a one man show, or one armed paper hanger, however even when I could enjoy a dedicated assistant or technical/professional staff I always looked for ways to keep my skills fresh either within or outside the organization and would suggest you do the same!\n\n\nIn addition to volunteering within your own organization, look for ways to enhance your skills by volunteering in community organizations or service clubs. These groups often thirst for your level of expertise and would be thrilled with help putting together a budget on Excel, or putting data together in a database program to provide analysis they hadn't had time or expertise to do. I too have served in smaller organizations and sometimes felt like a one man show, or one armed paper hanger, however even when I could enjoy a dedicated assistant or technical/professional staff I always looked for ways to keep my skills fresh either within or outside the organization and would suggest you do the same!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "19-07-2011"
    }
  ], 
  "answers_count": 3, 
  "author": "[Anonymous]", 
  "id": 21174, 
  "score": "0", 
  "tags": [
    "Next Generation of Managers", 
    "Career Resources"
  ], 
  "text": "\n\nI'm really enjoying my new job in the City Manager's Office of a larger city (150,000 pop.) and am buying-in to this bigger organization environment, which is a fairly stark contrast from my first work experience in smaller city (15,000 pop.). I'm valuing the staff expertise and specialties here that were all a one man show - the City Manager - in that smaller city. At the same time, I'm now seeing in my larger organization that I'm not going to learn the nitty gritty skills that would enable me to become a small town manager and so I suppose I either need to develop them in my spare time or plan on staying in larger organizations.\nFor example, some of my cohorts' duties as assistants in the City Manager's Office of smaller cities include database administration, website maintenance, contract management, budget preparation (intensely Excel) - whereas here, we have entire departments dedicated to those tasks - IT Dept for database/web, 8 staff attorneys for contract management, etc. And at the level I'm at the in City Manager's Office, I don't see myself getting the task/opportunity of crunching numbers on Excel (in fact we have our own in house budget software designed specially for the City).\nSo how well will my experience with policy development and organizational analysis for 2,000 employees translate to a smaller organization/city if all I can say is \"Uhh.. I don't know know to do that. We had entire divisions and departments take care of that for us in _ City - I've never built a website, created a budget from scratch, etc. myself.\" \nHow many of you out there are getting ground-level skills working at your desk and how many are in \"30,000 feet elevation\" meetings where you're discussing policy and organizational matters? I'm enjoying the 30,000 feet view and could conceivably stay at this level, but I just worry that I'll be in trouble one day if I decide to go down to ground-level with a new job in a smaller organization.\nThanks in advance for your insight and responses..\n\n", 
  "title": "Hard Skills/Soft Skills - Small City/Big City", 
  "when": "30-06-2011"
}