{
  "answer_by": null, 
  "answers": [
    {
      "author": "Aaron Burkett", 
      "score": "0", 
      "text": "\n\nOur policy requires certain positions to serve on call on a rotating basis. On call duties are scheduled for a one week rotation. The employee is paid 1 hour base pay for every 8 hours on call. normal work hours do not count. therfore a standard week and employee would receive 16 hour standby pay. The employee also receives pay for time worked responding to calls after hours. If they require assistance they can call in additional employees. Those employees do not receive stand by pay. This requirement is spelled out within their job description. They are required to respond to after hours emergencies when needed. If an employee becomes ill during their on call rotation and cannot perform the duties required they do not receive standby pay for the time they give up their on call duties. That time is paid to the employee who performs the on call/ standby duties in their stead.\n\n\nOur policy requires certain positions to serve on call on a rotating basis. On call duties are scheduled for a one week rotation. The employee is paid 1 hour base pay for every 8 hours on call. normal work hours do not count. therfore a standard week and employee would receive 16 hour standby pay. The employee also receives pay for time worked responding to calls after hours. If they require assistance they can call in additional employees. Those employees do not receive stand by pay. This requirement is spelled out within their job description. They are required to respond to after hours emergencies when needed. If an employee becomes ill during their on call rotation and cannot perform the duties required they do not receive standby pay for the time they give up their on call duties. That time is paid to the employee who performs the on call/ standby duties in their stead.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-01-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Stephen Ashley", 
  "id": 22471, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Public Works"
  ], 
  "text": "\n\nThe City has established basic policy for providing weekly \"On'Call\" Pay to public works employees who make themselves available to come in after hours for emergency repairs.   Recently, the City encountered an issue where the on-call employee became ill was not available and a different employee had to cover for him.  Both employees wanted wanted on-call pay for that week, but neither were on-call for the full week. The City pro-rated the on-call pay and paid each employee for their allotted number of days on-call.  However, neither employee was pleased, especially the one employee who covered for one day, as a single pro-rated day of on-call pay isn't much.  How are other cities handling their on-call pay with public works employees?\n\n", 
  "title": "On-Call Pay", 
  "when": "14-03-2013"
}