{
  "answer_by": null, 
  "answers": [
    {
      "author": "Pamela Caskie", 
      "score": "0", 
      "text": "\n\nI guess it would depend on what message you want to send to your community's empoyers and to your volunteer fire fighters.  If you want to show the business's that you are supportive of the volunteer service and encourage them to do so as well, I would pay him for his time as a City Employee and not pay him the stipend.  In the past, when I have had that situation, I have required that employee who was the firefighter speak with his supervisor about the kinds of work times when he could be released and when he couldn't.  And if he left to fight a fire under approriate conditions, we paid him his city wages.  We encouraged our businesses to provide release time and when possible to support that by paying their wages.  Some did, some didn't but we set the example.  Volunteers are becoming harder and harder to come by so anything we could do to support them was seen as a positive because not having them is definately more expensive.\n\n\nI guess it would depend on what message you want to send to your community's empoyers and to your volunteer fire fighters.  If you want to show the business's that you are supportive of the volunteer service and encourage them to do so as well, I would pay him for his time as a City Employee and not pay him the stipend.  In the past, when I have had that situation, I have required that employee who was the firefighter speak with his supervisor about the kinds of work times when he could be released and when he couldn't.  And if he left to fight a fire under approriate conditions, we paid him his city wages.  We encouraged our businesses to provide release time and when possible to support that by paying their wages.  Some did, some didn't but we set the example.  Volunteers are becoming harder and harder to come by so anything we could do to support them was seen as a positive because not having them is definately more expensive.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-04-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Gregory Camp", 
  "id": 21822, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Personnel Matters"
  ], 
  "text": "\n\nWe have a current city employee (public works laborer) who also serves on our volunteer fire department.  Last week, he responded to a major structure fire during his regular duty hours.  Subsequently, he has inquired about turning in those \"firefighter\" hours on his city time sheet.  It should be noted that we have a call stipend for our volunteer firefighters.  This has never come up before - initial reaction would be to not pay him for the time he was not working as a public works laborer.\nI am looking for policy/precedent - any input appreciated!\n\n", 
  "title": "Volunteer Firefighter & Employee", 
  "when": "12-04-2012"
}