{
  "answer_by": null, 
  "answers": [
    {
      "author": "Adam Carpenetti", 
      "score": "0", 
      "text": "\n\nInteresting timing... We currently have one page but are getting ready to expand to a couple others.  The pages will be set up under an account of the \"main\" person's email that will be doing the posting, thus making them the administrator.  As you need an email account to create a facebook page, you also need a facebook profile page to create a fan page.  However, the administrator will not be entering information for their facebook profile page, just the fan page they are administering.  I hope this makes sense.\nIn addition, all of the pages will also have our PIO as a co-administrator.\n\n\nInteresting timing... We currently have one page but are getting ready to expand to a couple others.  The pages will be set up under an account of the \"main\" person's email that will be doing the posting, thus making them the administrator.  As you need an email account to create a facebook page, you also need a facebook profile page to create a fan page.  However, the administrator will not be entering information for their facebook profile page, just the fan page they are administering.  I hope this makes sense.\nIn addition, all of the pages will also have our PIO as a co-administrator.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-03-2012"
    }, 
    {
      "author": "Connor Read", 
      "score": "0", 
      "text": "\n\nMy town has one main FB page that encompasses all of our community news, volunteer organizations, general news, etc. A few of our other boards have made their own page, but for the most part we manage outreach through one municipality page. Part of my position is managing the social media, but a few other Town officials have admin access. \nAnother good idea is to have the Police Chief (or someone in the Department) have admin access for the purposes of posting photos/updates when natural disasters strike. Hope this helps.\n\n\nMy town has one main FB page that encompasses all of our community news, volunteer organizations, general news, etc. A few of our other boards have made their own page, but for the most part we manage outreach through one municipality page. Part of my position is managing the social media, but a few other Town officials have admin access. \n\nAnother good idea is to have the Police Chief (or someone in the Department) have admin access for the purposes of posting photos/updates when natural disasters strike. Hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-03-2012"
    }, 
    {
      "author": "Courtney Hayden", 
      "score": "0", 
      "text": "\n\nThis has been a difficult question for us as well. Not just how to manage it, but also, more philosophically the question, \"Should departments have their own facebook pages?\"  We have one department that would like to have their own facebook page, the Police Department. Neighboring townships have also started their own police facebook pages. I agree with Adam's way of managing the administration of facebook pages by department, but what do people think about whether or not there should be departmental pages in the first place?\n\n\nThis has been a difficult question for us as well. Not just how to manage it, but also, more philosophically the question, \"Should departments have their own facebook pages?\"  We have one department that would like to have their own facebook page, the Police Department. Neighboring townships have also started their own police facebook pages. I agree with Adam's way of managing the administration of facebook pages by department, but what do people think about whether or not there should be departmental pages in the first place?\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-12-2012"
    }
  ], 
  "answers_count": 3, 
  "author": "Penny Burciaga", 
  "id": 21750, 
  "score": "0", 
  "tags": [
    "Social Media"
  ], 
  "text": "\n\nOur county has 22 departments of which 7 of those depts. have already created FB pages and some of those have been created under personal or work email accounts.  I'm interested in knowing how other government agencies have set-up their FB pages - Do you create one main account and then multiple pages and assign admins to each or do you allow each one of your depts. to set-up their own?\nWe also have some departments like Parks who want to create multiple pages for their lakes and campgrounds - so my same question above applies here...is it better to create a separate account for each lake and campground or add pages under one?\n\n", 
  "title": "What's the best way to create FB pages for Govt. Depts?", 
  "when": "09-03-2012"
}