{
  "answer_by": null, 
  "answers": [
    {
      "author": "Donald Gloo", 
      "score": "1", 
      "text": "\n\nJessica,\nThank you for your message regarding the CPM data collection platform.  Your comments are very helpful, and they will be included with similar comments from other participants.  Taken together, they will help to guide CPM as we make improvements for the FY13 data cycle. Responses to your specific concerns are below.\n(1) We heard from several jurisdictions that the ability to print out the survey, with their responses, was important to them.  Our initial installation of the survey platform did not allow this. As a work-around, we installed the PRINT PAGE option, which allows a respondent to print specific pages of the survey. After the Mid-Year Data Collection, we also added a feature that allows the jurisdiction to print the entire survey, with their responses, immediately upon submitting the survey to CPM. For FY13, we are looking for solutions that will allow for printing the entire survey with responses prior to data submission.\n(2) As a general rule, we advise jurisdictions to report their performance on the services that they provide.  If you don't offer a specific service, you should simply skip the questions related to that service.  If you do offer a service, but you are unable to respond to the questions related to it (e.g., you count your output differently than the way it is asked), then you should simply skip those questions.\nWe recognize that there are many important services and programs that your jurisdiction offers that we don't ask about. For the sake of comparability, our surveys are intended to gauge your performance in a few, universal services that nearly every jurisdiction offers. This is not intended to diminish the fine work that is being done throughout your organization.\n(3) We have heard numerous comments about the survey navigation this year. In some cases (as you noted), certain questions are skipped based on your response to a prior question. For example, if you tell us that your jurisdiction does not operate a jail, then all of the jail-related questions are skipped.\nThe other reason that some questions appear to be skipped is that the built-in navigation logic of the survey platform assumes that users are entering all of their available data at once, after having collected their data on paper first. (Even though we always tell jurisdictions to do it this way, we now know that this is frequently not the case.) Because of this, after you pass through a page of the survey, the navigation logic places a check mark next to that page under the assumption that you are finished with it.  It does this intentionally so you don't have to go through every page of the survey just to get to the pages you haven't answered yet. That is a long-winded explanation, and having said all of that, it's clear now that we need to re-visit the navigation for FY13 so it reflects that way that our respondents use the surveys.\nThank you again for taking the time to offer detailed comments and suggestions about the surveys.  We are already working on making improvements for the FY13 data cycle, and we are sure that you will notice the improvements.\nPlease don't hesitate to contact us at CPMSurveys@icma.org if you wish to discuss these issues further.\n\n\nJessica,\n\nThank you for your message regarding the CPM data collection platform.  Your comments are very helpful, and they will be included with similar comments from other participants.  Taken together, they will help to guide CPM as we make improvements for the FY13 data cycle. Responses to your specific concerns are below.\n\n(1) We heard from several jurisdictions that the ability to print out the survey, with their responses, was important to them.  Our initial installation of the survey platform did not allow this. As a work-around, we installed the PRINT PAGE option, which allows a respondent to print specific pages of the survey. After the Mid-Year Data Collection, we also added a feature that allows the jurisdiction to print the entire survey, with their responses, immediately upon submitting the survey to CPM. For FY13, we are looking for solutions that will allow for printing the entire survey with responses prior to data submission.\n\n(2) As a general rule, we advise jurisdictions to report their performance on the services that they provide.  If you don't offer a specific service, you should simply skip the questions related to that service.  If you do offer a service, but you are unable to respond to the questions related to it (e.g., you count your output differently than the way it is asked), then you should simply skip those questions.\n\nWe recognize that there are many important services and programs that your jurisdiction offers that we don't ask about. For the sake of comparability, our surveys are intended to gauge your performance in a few, universal services that nearly every jurisdiction offers. This is not intended to diminish the fine work that is being done throughout your organization.\n\n(3) We have heard numerous comments about the survey navigation this year. In some cases (as you noted), certain questions are skipped based on your response to a prior question. For example, if you tell us that your jurisdiction does not operate a jail, then all of the jail-related questions are skipped.\n\nThe other reason that some questions appear to be skipped is that the built-in navigation logic of the survey platform assumes that users are entering all of their available data at once, after having collected their data on paper first. (Even though we always tell jurisdictions to do it this way, we now know that this is frequently not the case.) Because of this, after you pass through a page of the survey, the navigation logic places a check mark next to that page under the assumption that you are finished with it.  It does this intentionally so you don't have to go through every page of the survey just to get to the pages you haven't answered yet. That is a long-winded explanation, and having said all of that, it's clear now that we need to re-visit the navigation for FY13 so it reflects that way that our respondents use the surveys.\n\nThank you again for taking the time to offer detailed comments and suggestions about the surveys.  We are already working on making improvements for the FY13 data cycle, and we are sure that you will notice the improvements.\n\nPlease don't hesitate to contact us at CPMSurveys@icma.org if you wish to discuss these issues further.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-03-2013"
    }, 
    {
      "author": "Robert Woods", 
      "score": "1", 
      "text": "\n\nIn response to the data entry scenario discussed, we decentralize the operations to lean them out. The person closest to the data collection does the entry.  Review is done on-line electronically.\nPassing paper copies up the chain of command adds unnecessary steps and turns submission into a large batch operation. That is why it is critical to us to be able to download the final submission.\n\n\nIn response to the data entry scenario discussed, we decentralize the operations to lean them out. The person closest to the data collection does the entry.  Review is done on-line electronically.\n\nPassing paper copies up the chain of command adds unnecessary steps and turns submission into a large batch operation. That is why it is critical to us to be able to download the final submission.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-03-2013"
    }, 
    {
      "author": "Jessica Melton", 
      "score": "0", 
      "text": "\n\nDear Mr. Gloo,\nThank you so much for your detailed response. It means a lot to the primary coordinators that CPM considers feedback so carefully. I am looking forward to seeing improvements on the CPM platform next year. \nAlso, I agree with Mr. Woods comment. Organizational culture is moving away from paper trails and submissions to utilizing electronics portals. It may be beneficial to view all questions, regardless of responses. \nThank you, \nJessica\n\n\nDear Mr. Gloo,\n\nThank you so much for your detailed response. It means a lot to the primary coordinators that CPM considers feedback so carefully. I am looking forward to seeing improvements on the CPM platform next year. \nAlso, I agree with Mr. Woods comment. Organizational culture is moving away from paper trails and submissions to utilizing electronics portals. It may be beneficial to view all questions, regardless of responses. \nThank you, \nJessica\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "19-03-2013"
    }
  ], 
  "answers_count": 3, 
  "author": "Jessica Melton", 
  "id": 22441, 
  "score": "2", 
  "tags": [
    "Performance Management and Analytics"
  ], 
  "text": "\n\nThe Center for Performance Measurement's data collection process was very different last year. There was new software used that was visually appealing but had a few programming flaws. I would like to read up on what to expect for next year.\nThe following are my comments from last year's collection process:\n(1) Last year, the data collection survey was more relatively user friendly. The questions were more clear and concise, which made responses more accurate and easier to provide. Although, there needs to be a way to print and/or PDF the survey in its entirety as one document because (1) it saves a great amount of time, (2) it allows for sound and standard record keeping, (3) it saves paper, and (4) it allows the survey to be dispersed throughout the department. This was a feature in the 2011 survey and this year, with the implementation of a new data collection method, it was not.  I do not understand why this feature was removed. We would like for it to be incorporated back into the survey process.\n(2) In addition to the printing concern, we also believe the ‘not applicable’ and ‘not available’ selection should be available. There are many elements and services we measure, but for the elements and services we do not measure, we must have a ‘not applicable’ option available. Not having this option leaves elements and services the city provides confusing and the results do not properly represent the actual performance. Not having this as an option should make one question the validity of the future comparisons using this data collection model. \n(3) The navigation between questions was not as smooth as last year’s survey which made it difficult to come back to specific questions. The survey also skipped questions depending on responses, which made it difficult to review for completion. \nThank you for taking the time to read our feedback and comments. Please contact me if your have any follow up questions or suggestions.\nSincerely, \nJessica Melton\nICMA Government Fellow\nCity of Smyrna\nWork Phone: 678.631.5406\nEmail: jmelton@smyrnaga.gov\n\n", 
  "title": "2013 - What to expect for CPM collection?", 
  "when": "25-02-2013"
}