{
  "answer_by": null, 
  "answers": [
    {
      "author": "Wally Bobkiewicz", 
      "score": "0", 
      "text": "\n\nWe allow bee keeping in Evanston, Illinois.  We are an urban/suburban community immediately north of Chicago.  At this point it is just one beekeeper in a largely residential neighborhood.  After the initial outcry, things have been pretty quiet.  Happy to get you more particulars directly.\n\n\nWe allow bee keeping in Evanston, Illinois.  We are an urban/suburban community immediately north of Chicago.  At this point it is just one beekeeper in a largely residential neighborhood.  After the initial outcry, things have been pretty quiet.  Happy to get you more particulars directly.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "27-05-2010"
    }, 
    {
      "author": "Michael Matthes", 
      "score": "0", 
      "text": "\n\nWe allow bee keeping in Des  Moines as well - if you have enough acreage.  Like Wally, we experience occaissional flair-ups but generally speaking it's a very small number of folks engaged in bee-keeping and they are pretty good neighbors.\n\n\nWe allow bee keeping in Des  Moines as well - if you have enough acreage.  Like Wally, we experience occaissional flair-ups but generally speaking it's a very small number of folks engaged in bee-keeping and they are pretty good neighbors.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-09-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "Michael Repas", 
  "id": 20032, 
  "score": "0", 
  "tags": [
    "Healthy Living", 
    "Sustainability", 
    "Environment"
  ], 
  "text": "\n\nIn a recent article by the Epoch Times (http://www.theepochtimes.com/n2/content/view/36075/), the wonders of urban beekeeping have been laid out for everyone to see.  Although we all learned in elementary school how bees pick up pollen from plants and then spread it around to keep the plants able to produce seedlings, not as many of us have heard about the alarming reality of Colony Collapse Disorder, a worldwide and unexplained phenomenon that sees entire colonies of bees dying at once.\nUrban beekeeping seems to offer a working solution to that problem – by providing sheltered areas like rooftops or corners of properties for the colony to reside, we can start to rebuild the honeybee numbers and thus ensure their vital pollen-carrying duties can be done.  Even better, this will also yield organic honey for all local keepers, which is both sustainability-conscious and health-conscious too: natural honey is much healthier for human beings than the various fructose corn syrup-based artificial sweeteners in everything we eat. \nArmed with these possibilities, how might this practice be reworked for suburban or rural areas?  Also, as bee-sting allergies can be very dangerous, how might the zoning or placement urban beekeeping be planned to avoid putting anyone in danger of a potential allergic reaction?\nDoes anyone already have this practice in their community?  How is it working?\n\n", 
  "title": "Urban Beekeeping - Has anyone tried implementing this?", 
  "when": "27-05-2010"
}