{
  "answer_by": null, 
  "answers": [], 
  "answers_count": 0, 
  "author": "Jared Dailey", 
  "id": 21327, 
  "score": "0", 
  "tags": [
    "Innovation", 
    "Economic Crisis", 
    "Management", 
    "Finance and Budgeting", 
    "Organizational Development", 
    "Partnerships"
  ], 
  "text": "\n\nLess than two weeks until the kickstart of the 2011 ICMA Annual Conference in Milwaukee.  Chock full of educational sessions, special sessions, and keynotes, the Conference provides attendees the chance to learn, teach, and network with others in local government.  And just when you thought you had gone to every session, along comes another way to participate -- the roundtables!\nRoundtables are informal hour-long discussions revolving around a specific topic overseen by a facilitator.  There are no presentations.  Just the opportunity to exchange ideas and experiences with your colleagues face-to-face.  We have 29 roundtables this year covering an array of topics like pensions, unions, employee training, and social media.  \nTwo roundtables being held on Monday don't have facilitators.  The times and descriptions are below.  If your local government has had some experience in new methods of generating revenue or increasing staff morale in tough times, you'd be perfect to facilitate.  Please email me (jdailey@icma.org) if you're interested and already attending the Conference.  Hint: Facilitating is really simple.  Thanks!\nShow Me the Money\nMonday, 11:30a – 12:30p\nEconomists say that the economy is rebounding. Really? Many local governments still struggle to balance high costs with insufficient revenues, requiring drastic and sometimes unpopular cost-cutting techniques. Instead of relying on cutting-to-balance, what methods have local government been able implement, other than the normal user fees and property taxes, to increase revenues? One recent idea has been to tax nonprofits. Share your revenue-generating ideas; your CFO and manager will thank you later.\nNo More Pulling Out Their Hair\nMonday, 4:00p – 5:00p\nTooth marks crater pencils as fists clench squishy rubber balls. Reduced staffing levels, stagnate pay levels, tightened budgets, and increased workloads create stress and sometimes tension throughout city hall. Providing employees with a variety of coping and de-stressing mechanisms can work to your community’s advantage without breaking the piggybank. Come and share the methods that you have used or initiated to regain the yen and smiles of your office.\n\n", 
  "title": "Another Chance to Participate in the Annual Conference - Roundtable Facilitation", 
  "when": "06-09-2011"
}