{
  "answer_by": null, 
  "answers": [
    {
      "author": "Laura Nuhaan", 
      "score": "0", 
      "text": "\n\nI work for Parkmobile a company that provides digital parking solutions. I think pay by phone parking could provide you with some solutions that I'm happy to discuss with you. Pls check our website at www.parkmobile.com as well.\nLaura\n\n\nI work for Parkmobile a company that provides digital parking solutions. I think pay by phone parking could provide you with some solutions that I'm happy to discuss with you. Pls check our website at www.parkmobile.com as well.\nLaura\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-06-2010"
    }, 
    {
      "author": "Jonathan Lynn", 
      "score": "0", 
      "text": "\n\nWe have utilized Pay and Display machines here (Tybee Island, GA) where parking is at a premium throughout the City being a beach destination and such. These machines all users to park all day and they buy tickets and display them on their dash. These machines are solar powered and can be moved around as necessary throughout the season. This was a definite upgrade for us from the coin only meters. These machines take both cash and cards so it makes it real easy for those visitors parking. If you want to discuss more, I can get some info together for you, jlynn@cityoftybee.org.\n\n\nWe have utilized Pay and Display machines here (Tybee Island, GA) where parking is at a premium throughout the City being a beach destination and such. These machines all users to park all day and they buy tickets and display them on their dash. These machines are solar powered and can be moved around as necessary throughout the season. This was a definite upgrade for us from the coin only meters. These machines take both cash and cards so it makes it real easy for those visitors parking. If you want to discuss more, I can get some info together for you, jlynn@cityoftybee.org.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-06-2010"
    }, 
    {
      "author": "Peter Anderes", 
      "score": "0", 
      "text": "\n\nHave you reviewed automated parking? We have been working with many local governments to help provide solutions to this exact problem, although all situations are different. My company designs, engineers and builds robotic parking. We have installations all of the world and have been building them for over 25 years. There are several in the US solving your exact problem. Let me know if I can help panderes@autoparklogistics.com\n5 minutes ago\n\n\nHave you reviewed automated parking? We have been working with many local governments to help provide solutions to this exact problem, although all situations are different. My company designs, engineers and builds robotic parking. We have installations all of the world and have been building them for over 25 years. There are several in the US solving your exact problem. Let me know if I can help panderes@autoparklogistics.com\n\n5 minutes ago\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-07-2010"
    }, 
    {
      "author": "Pam Broviak", 
      "score": "0", 
      "text": "\n\nThe smaller cities (less than 25K) I have worked in created the 3-hour parking, and it seemed to work best. The pay stations seem to work well in larger cities.\n\n\nThe smaller cities (less than 25K) I have worked in created the 3-hour parking, and it seemed to work best. The pay stations seem to work well in larger cities.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-08-2010"
    }, 
    {
      "author": "Charles DeBow", 
      "score": "0", 
      "text": "\n\nYou have a capacity problem. There only two ways to treat this problem. 1- Increase capacity by adding spaces. SInce you stated that is not an option, then option 2 is  needed. Option 2 is to price your parking, which will decrease demand, therefore opening up spaces for the customers. Simple rule is the more conveinant the parking, the higher the price should be. The kiosks are the most attractive way to do this. This takes a big time commitment and the business owners will not like this. But do the research, turnover of parking spaces creates a healthy business district.  Feel free to contact me directly next week......unless Bama beats Penn State badly..( I am the Parking Manager for the Borough of State College, which is the home of Penn State.)\n\n\nYou have a capacity problem. There only two ways to treat this problem. 1- Increase capacity by adding spaces. SInce you stated that is not an option, then option 2 is  needed. Option 2 is to price your parking, which will decrease demand, therefore opening up spaces for the customers. Simple rule is the more conveinant the parking, the higher the price should be. The kiosks are the most attractive way to do this. This takes a big time commitment and the business owners will not like this. But do the research, turnover of parking spaces creates a healthy business district.  Feel free to contact me directly next week......unless Bama beats Penn State badly..( I am the Parking Manager for the Borough of State College, which is the home of Penn State.)\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-09-2010"
    }
  ], 
  "answers_count": 5, 
  "author": "J. Munger", 
  "id": 20066, 
  "score": "0", 
  "tags": [
    "Planning", 
    "Strategic Planning", 
    "Transportation"
  ], 
  "text": "\n\nI am trying to help formulate a focused plan to change parking regulations in a mixed use restaurant/retail commercial district.  We currently have a fixed number of spaces, a two-hour parking limit, and no clear delineation between employee and customer parking.  The city and the chamber of commerce have spent a large sum in advertising to draw shoppers to our unique setting, in the hopes that they will come for lunch and then patronize the numerous boutique retail establishments.  However, numerous patrons have obliged our ad campaign only to return to their car to find a parking ticket.  The current perimeter all-day parking is intended for employees and for customers intending to stay longer than two hours.  But the cramped setting makes these parking areas on average about 1/5th of a mile away from the center of the commercial district.\nWe are trying to craft a solution that does not add ugly parking lots or parking meters, allows two-stop customers the freedom to dine and shop unencumbered by tickets, and does so without tying-up spaces for one-stop customers unlikely to reach the two-hour limit.\nCurrently there are three different possibilities: the status quo of the two-hour limit and perimeter parking, increasing the limit to three hours, or installing multi space parking kiosks where patrons can purchase parking time.  Each of these have their own pros and cons that make this decision less than simple.\nAny ideas or suggestions?  Has anyone else faced a similar problem?\n\n", 
  "title": "Limited Space Parking Solutions", 
  "when": "06-06-2010"
}