{
  "answer_by": null, 
  "answers": [
    {
      "author": "Chase Carlile", 
      "score": "0", 
      "text": "\n\nMy understanding is that the USDA trained employees of the Public Works department in Auburn, NY a couple of years ago on crow dispersal techniques. Since then, the city has been responsible for the program.  I was unable to find program specifics, but the phone number for Auburn's Public Works Department is 315-255-4737.\n\n\nMy understanding is that the USDA trained employees of the Public Works department in Auburn, NY a couple of years ago on crow dispersal techniques. Since then, the city has been responsible for the program.  I was unable to find program specifics, but the phone number for Auburn's Public Works Department is 315-255-4737.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-05-2011"
    }, 
    {
      "author": "Paul Scher", 
      "score": "0", 
      "text": "\n\nThe dispersal of passerine roosts is of vital import to the maintenance of both public safety and public health in urban areas. Whether these passerines are blackbirds, crows, or starlings, their odor, noise and filth of large roosts can deface equipment and property, damage to trees, and cause histoplasmosis: fungal spores that can cause human respiratory disease. The following advisory article was composed by Ron Johnson, Extension Wildlife Specialist at the University of Nebraska Cooperative Extension at Lancaster. It was retrieved from http://lancaster.unl.edu/enviro/pest/factsheets/076-99.htm and is hopefully of some use.\n\n\nThe dispersal of passerine roosts is of vital import to the maintenance of both public safety and public health in urban areas. Whether these passerines are blackbirds, crows, or starlings, their odor, noise and filth of large roosts can deface equipment and property, damage to trees, and cause histoplasmosis: fungal spores that can cause human respiratory disease. The following advisory article was composed by Ron Johnson, Extension Wildlife Specialist at the University of Nebraska Cooperative Extension at Lancaster. It was retrieved from http://lancaster.unl.edu/enviro/pest/factsheets/076-99.htm and is hopefully of some use.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-05-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Elliott Nelson", 
  "id": 21028, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nThe City of Watertown, NY has an issue with large flocks consisting of thousands of crows roosting in the City during the winter months. Over the past few years we have contracted with USDA to come in and use dispersal tactics to try and encourage the flock to move elsewhere. The USDA efforts are effective but are results are dependant on the weather conditions shortly thereafter. As such, we are thinking of taking on this project in house. \nHas anyone else out there developed a plan to disperse crow flocks in house? Is it more const effective to take on the crow flock with city personnel, or to continue to contract with USDA, or some combination thereof? Does anyone have an in house plan?  Thank you.\n\n", 
  "title": "Crow Dispersal", 
  "when": "16-05-2011"
}