{
  "answer_by": null, 
  "answers": [
    {
      "author": "Scott Lazenby", 
      "score": "2", 
      "text": "\n\nPart of the answer to this (real) dilemma might require new thinking about entry level positions and career paths. Specifically, we should consider hiring generalists (individuals who have prepared themselves through a graduate degree, internships, etc.) for some of the positions that have historically been filled by specialists. These areas could include transit, economic development, utility management, libraries, parks and recreation, and many others.  The individual would need to be able to learn quickly, and be genuinely interested in the area. But I think we would find that capable generalists with strong management training & skills might be better for our organization than individuals with more narrow technical knowledge. I tried this approach with our Finance Director position (filled by ICMA member Seth Atkinson) and have been very pleased with the outcome.\n\n\nPart of the answer to this (real) dilemma might require new thinking about entry level positions and career paths. Specifically, we should consider hiring generalists (individuals who have prepared themselves through a graduate degree, internships, etc.) for some of the positions that have historically been filled by specialists. These areas could include transit, economic development, utility management, libraries, parks and recreation, and many others.  The individual would need to be able to learn quickly, and be genuinely interested in the area. But I think we would find that capable generalists with strong management training & skills might be better for our organization than individuals with more narrow technical knowledge. I tried this approach with our Finance Director position (filled by ICMA member Seth Atkinson) and have been very pleased with the outcome.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2010"
    }, 
    {
      "author": "Scott Bowles", 
      "score": "1", 
      "text": "\n\nI agree with Mr. Davidson's comments.  While a student at Arizona State University's MPA program, I went from city-to-city offering my assistance pro-bono without success for over three months.  It wasn't until John Kross, Town Manager at Queen Creek, finally saw the passion I had for this field and facilitated an opportunity for me to work with his public works staff.  This simple gesture opened numerous doors for me in this profession, but I am still troubled to this day that it took me months of pleading with numerous managers to find pro-bono experience.  There is definitely room for improvement with our current managers and universities to facilitate opportunities for our future community leaders.\n\n\nI agree with Mr. Davidson's comments.  While a student at Arizona State University's MPA program, I went from city-to-city offering my assistance pro-bono without success for over three months.  It wasn't until John Kross, Town Manager at Queen Creek, finally saw the passion I had for this field and facilitated an opportunity for me to work with his public works staff.  This simple gesture opened numerous doors for me in this profession, but I am still troubled to this day that it took me months of pleading with numerous managers to find pro-bono experience.  There is definitely room for improvement with our current managers and universities to facilitate opportunities for our future community leaders.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-10-2010"
    }, 
    {
      "author": "Thomas Hart", 
      "score": "1", 
      "text": "\n\nThis is an issue that has concerned me for some time.  When I started many years ago there were plenty of opportunities for young people wanting a career in city management.  You could find jobs in the manager's office that would lead to an ACM or CM position.  This is not the case in todays times.\nWe must be proactive in this issue.  Some examples are we changed one of three ACM positions in our city to an Asst. to the Manager position and made it a three year position.  You come in work hard for three years and contribute to the organization while you learn our profession and then you leave.  So do not take this job unless you have the guts to know you do not have a job after three years.  We think you should be ready fo an ACM position or a CM position in a smaller city.\nAnother program we have implemented is a program called ILEAD.  We take applications and select about 15 staff to be in a one year training program.  We are grooming future leaders and managers in our organization.\nWe also need to pick up the phone and call other managers that have openings when one of these young great individuals is roadblocked in our organization.  Since there are not many jobs in the managers office anymore, we must identify young  quality professionals in other departments and help them move into our profession even if it is not in our own organization. \nThere are great people out there.  We need to help them get in the door.\n\n\nThis is an issue that has concerned me for some time.  When I started many years ago there were plenty of opportunities for young people wanting a career in city management.  You could find jobs in the manager's office that would lead to an ACM or CM position.  This is not the case in todays times.\n\nWe must be proactive in this issue.  Some examples are we changed one of three ACM positions in our city to an Asst. to the Manager position and made it a three year position.  You come in work hard for three years and contribute to the organization while you learn our profession and then you leave.  So do not take this job unless you have the guts to know you do not have a job after three years.  We think you should be ready fo an ACM position or a CM position in a smaller city.\n\nAnother program we have implemented is a program called ILEAD.  We take applications and select about 15 staff to be in a one year training program.  We are grooming future leaders and managers in our organization.\n\nWe also need to pick up the phone and call other managers that have openings when one of these young great individuals is roadblocked in our organization.  Since there are not many jobs in the managers office anymore, we must identify young  quality professionals in other departments and help them move into our profession even if it is not in our own organization. \n\nThere are great people out there.  We need to help them get in the door.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2010"
    }, 
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nI would encourage you to look into the Preparing the Next Generation Program started in California by Frank Benest and now an National ICMA program.  It agrees with and addresses your points.\n\n\nI would encourage you to look into the Preparing the Next Generation Program started in California by Frank Benest and now an National ICMA program.  It agrees with and addresses your points.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-10-2010"
    }, 
    {
      "author": "Kevin Carter", 
      "score": "0", 
      "text": "\n\nGiven the difficult and straining times facing many communities, I think managers have put mentoring and \"preparing the next generation\" on hold. It's certainly a shame that managers think that they don't have time to mentor/train a recent grad - especially when he is willing to work for free.\nI hope managers realize that preparing the next generation of talent is just as important as building up a rainy-day fund or forming a sustainable budget.\nI'm in favor of institutionalizing mentoring opportunities through the use of annual fellowships, etc. It's a lot easier to say yes to someone like Scott when managing a fellowship is part of your work's mission.\nI'm lucky to be serving as a Presidential Management Fellow. And I can say that the success of the program is a result of very clearly defined expectations. PMFs must do 80 hours of class room training per year for the two years. PMFs have to create a plan that explains what skills they will develop during those two years. And PMFs even have to map out their federal career paths and list two years out which position they hope to fill after serving as fellows.\n\n\nGiven the difficult and straining times facing many communities, I think managers have put mentoring and \"preparing the next generation\" on hold. It's certainly a shame that managers think that they don't have time to mentor/train a recent grad - especially when he is willing to work for free.\n\nI hope managers realize that preparing the next generation of talent is just as important as building up a rainy-day fund or forming a sustainable budget.\n\nI'm in favor of institutionalizing mentoring opportunities through the use of annual fellowships, etc. It's a lot easier to say yes to someone like Scott when managing a fellowship is part of your work's mission.\n\nI'm lucky to be serving as a Presidential Management Fellow. And I can say that the success of the program is a result of very clearly defined expectations. PMFs must do 80 hours of class room training per year for the two years. PMFs have to create a plan that explains what skills they will develop during those two years. And PMFs even have to map out their federal career paths and list two years out which position they hope to fill after serving as fellows.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-10-2010"
    }, 
    {
      "author": "Brent Hinson", 
      "score": "0", 
      "text": "\n\nI agree with much of what has already been said.  Each manager should take time to assess whether they are willing and able to take on an intern.  I have hosted two interns in my five years as a manager, but am surprised at how many longtime managers with great knowledge & experience don't make this a regular practice.  Additionally, in hiring during the downturn, managers should consider young & ambitious MPA's for clerical-type positions for which they are \"overeducated\".  While in good times this might be a recipe for job-hopping, in our current times it may be the only way to effectively cultivate the next generation by allowing our future leaders to gain relevant experience.  The young & inexperienced will make more mistakes and require more supervision at first, but I've found that their enthusiasm and critical-thinking & people skills can often more than make up for any shortfalls.  Finally, I'd love to see a \"Teach for America\" scale program to introduce young people to local government service as a career field.\n\n\nI agree with much of what has already been said.  Each manager should take time to assess whether they are willing and able to take on an intern.  I have hosted two interns in my five years as a manager, but am surprised at how many longtime managers with great knowledge & experience don't make this a regular practice.  Additionally, in hiring during the downturn, managers should consider young & ambitious MPA's for clerical-type positions for which they are \"overeducated\".  While in good times this might be a recipe for job-hopping, in our current times it may be the only way to effectively cultivate the next generation by allowing our future leaders to gain relevant experience.  The young & inexperienced will make more mistakes and require more supervision at first, but I've found that their enthusiasm and critical-thinking & people skills can often more than make up for any shortfalls.  Finally, I'd love to see a \"Teach for America\" scale program to introduce young people to local government service as a career field.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2010"
    }, 
    {
      "author": "James Mullen", 
      "score": "0", 
      "text": "\n\nOne of the most effective things the ICMA board could do enhance the future of our profession is to become more effectively involved in the fight to preserve the council manager plan in communities where it is under attack. One such campaign has been going on in my city , Colorado Springs, and ICMA as well as the state managers association and range riders have totally ignored the opportunity to speak up and get involved in our fight to retain the form of government. Maybe the association should spend less time and money on 'programs' and become more of an advocate for good government, as it was established to do in the first place. More council manager cities means more jobs and that is what the younger generation needs and wants.\n\n\nOne of the most effective things the ICMA board could do enhance the future of our profession is to become more effectively involved in the fight to preserve the council manager plan in communities where it is under attack. One such campaign has been going on in my city , Colorado Springs, and ICMA as well as the state managers association and range riders have totally ignored the opportunity to speak up and get involved in our fight to retain the form of government. Maybe the association should spend less time and money on 'programs' and become more of an advocate for good government, as it was established to do in the first place. More council manager cities means more jobs and that is what the younger generation needs and wants.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-10-2010"
    }, 
    {
      "author": "Dan Weinheimer", 
      "score": "0", 
      "text": "\n\nMMASC is the assistant-level organization for Southern California. We inhabit that link between MPA and undergrad programs and the first couple jobs. In San Diego we are trying out a new model to reach out and inhabit that space as a resource to future MMASC members by having a lunch session dedicated to the MPA/undergrads of San Diego State University. We are offering speed coaching and three breakout sessions - resume tips, interview tips and networking tips. The goal is that we get the graduates ready to enter the profession - setting and managing expectations. This MMASC event is the first of its kind and I hope that all MMASC regions will do similar programs. As an organization we can be indispensable to those new to the profession and help set a standard for their conduct and performance. Sometimes ICMA and our California City Managers' organizations forget about MMASC and MMANC in developing Next Gen programming but we can be very effective ambassadors.\n\n\nMMASC is the assistant-level organization for Southern California. We inhabit that link between MPA and undergrad programs and the first couple jobs. In San Diego we are trying out a new model to reach out and inhabit that space as a resource to future MMASC members by having a lunch session dedicated to the MPA/undergrads of San Diego State University. We are offering speed coaching and three breakout sessions - resume tips, interview tips and networking tips. The goal is that we get the graduates ready to enter the profession - setting and managing expectations. This MMASC event is the first of its kind and I hope that all MMASC regions will do similar programs. As an organization we can be indispensable to those new to the profession and help set a standard for their conduct and performance. Sometimes ICMA and our California City Managers' organizations forget about MMASC and MMANC in developing Next Gen programming but we can be very effective ambassadors.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-10-2010"
    }, 
    {
      "author": "Loré Chambers", 
      "score": "0", 
      "text": "\n\nI have the good fortune to have a manager who is very instrumental in my development as an Assistant City Administrator.  We meet each Monday and review programs, processes, iniatives and brainstorm solutions to any issues we are facing.  We also review the City Council agendas for work sessions and meetings to ensure we are prepared for questions.  I have an excellent mentor who is interested in my development.  There is a challenge to developing this position that has existed for four years, in that there is no standardization as to how this position should be recognized within the organization.  As a professional with years of experience and academic excellence, it is important that the position of ACA/ACM be institutionalized to ensure that future leaders have a level of security, in order to develop into the leaders our governments need to move citizen service provision to the next level.  I sincerely hope that the Next Generation Managers group will review and consider ways to ensure that top talent is retained for our group.\n\n\nI have the good fortune to have a manager who is very instrumental in my development as an Assistant City Administrator.  We meet each Monday and review programs, processes, iniatives and brainstorm solutions to any issues we are facing.  We also review the City Council agendas for work sessions and meetings to ensure we are prepared for questions.  I have an excellent mentor who is interested in my development.  There is a challenge to developing this position that has existed for four years, in that there is no standardization as to how this position should be recognized within the organization.  As a professional with years of experience and academic excellence, it is important that the position of ACA/ACM be institutionalized to ensure that future leaders have a level of security, in order to develop into the leaders our governments need to move citizen service provision to the next level.  I sincerely hope that the Next Generation Managers group will review and consider ways to ensure that top talent is retained for our group.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "19-11-2010"
    }
  ], 
  "answers_count": 9, 
  "author": "Robert Carty", 
  "id": 20489, 
  "score": "1", 
  "tags": [
    "Career Resources", 
    "Next Generation of Managers"
  ], 
  "text": "\n\nGilbert Davidson, Town Manager, Marana, Arizona, wrote an article in the June 2010 issue of AZ Management about the importance of building the capacity of the next generation. In it, he reminds us that:\n\"The success of our communities rests with the talent and skill of our workforce. It is in our best interest as an Association and as individual members to develop and expand our partnership with our state universities. We must ensure that talent is being developed and that universities are partners in this important endeavor.\"\nand…\n\"Cities and towns across the state have faced a number of recessionary challenges over the past several years. Most communities have confronted fiscal realities by reducing expenditures and modifying services and programs provided to the general populous. The identification of core services and programs has become a pressing priority.\"\nMr. Davidson closes with a call to engage tomorrow’s managers:\n\"We must do everything possible as an Association to encourage the best and brightest college students to take advantage of opportunities in public service. The fiscal challenges we face are not going away any time soon. They will require the commitment of a whole new generation of leaders who have knowledge and experience. ACMA should do all it can to give today's college students a head-start on solving tomorrow's problems. In the end, everyone will benefit.\"\nThere’s no countering the fact that times are bad. Budgets are tighter than ever, even after resorting to the drastic measures of layoffs, furloughs, cutting services, or taking on debt. None of these measures are sustainable.\nAt the same time, member stories and a future of opportunity are attracting a new generation of graduates to the profession. The big puzzle piece missing is for a place they can land after graduating, or even concurrent with their studies. Many students and career changers have told stories that they cannot find even unpaid internships, a heavy burden to bear on top of loans, living costs, and in many cases family.\nNow is the time for creative thinking. How can we at the national, state, school, and jurisdiction levels help build capacity in the next generation, engage them in the profession, and give them meaningful experiences that will help them succeed not only to benefit our communities today, but ready them for when today’s managers move on?\n\n", 
  "title": "A moment for the future of the profession", 
  "when": "07-10-2010"
}