{
  "answer_by": "11-07-2011", 
  "answers": [
    {
      "author": "Randy Webster", 
      "score": "0", 
      "text": "\n\nHere in Portland, Oregon we have been conducting park user surveys for a number of years. We use both intercept surveys of park users and random sample surveys of the general population. Both surveys ask about park use experiences, preferences, and priorities. We have an arrangement with the local university's public opinion research department. Other options would be good public opinion research firm. Dr. John Crompton of Texas A&M has written on effective parks use surveys. In short, beginning with public opinion/marketing research approach has worked well for us.\n\n\nHere in Portland, Oregon we have been conducting park user surveys for a number of years. We use both intercept surveys of park users and random sample surveys of the general population. Both surveys ask about park use experiences, preferences, and priorities. We have an arrangement with the local university's public opinion research department. Other options would be good public opinion research firm. Dr. John Crompton of Texas A&M has written on effective parks use surveys. In short, beginning with public opinion/marketing research approach has worked well for us.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-06-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Lydia Rossiter", 
  "id": 21163, 
  "score": "0", 
  "tags": [
    "Parks and Recreation", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nThe City has a recreation area with a lake that has seen a big drop in attendance (long story short we can't stock the lake anymore). We want a consultant to explore new uses and types of facilities for the recreation area and make recommendations. This would include some type of community input, probably community meetings and a survey.\nBecause this is a use study rather than a master plan, there is a question of what kind of consultant to solicit - a management consultant or someone who specializes in parks and recreation?\nAny advice or lessons from an RFP you've conducted? Any consultant you've worked with on this type of study that you particularly liked?\n\n", 
  "title": "Recreation Area Use Study - what kind of consultant?", 
  "when": "28-06-2011"
}