{
  "answer_by": null, 
  "answers": [
    {
      "author": "Wes Hare", 
      "score": "0", 
      "text": "\n\nHannah,\nI think this problem is common throughout the developing world and will only get worse as people abandon traditional agriculture and move to cities or larger villages that have no infrastructure to meet their needs.  Consequently, there are on-line resources that offer examples of what similarly situated places are doing.  You might want to explore waste reduction policies that include concepts like home composting, banning plastic bags etc., in addition to finding suitable locations for dumps and neighborhood collection systems.  If you need some specific on-line sites or do not have reliable Internet service, let me know and I will be glad to do some research.  I worked on the issue a couple of years ago in Gambella, Ethiopia and found conditions very similar to what you describe. wes.hare@cityofalbany.net.\n\n\nHannah,\nI think this problem is common throughout the developing world and will only get worse as people abandon traditional agriculture and move to cities or larger villages that have no infrastructure to meet their needs.  Consequently, there are on-line resources that offer examples of what similarly situated places are doing.  You might want to explore waste reduction policies that include concepts like home composting, banning plastic bags etc., in addition to finding suitable locations for dumps and neighborhood collection systems.  If you need some specific on-line sites or do not have reliable Internet service, let me know and I will be glad to do some research.  I worked on the issue a couple of years ago in Gambella, Ethiopia and found conditions very similar to what you describe. wes.hare@cityofalbany.net.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-07-2011"
    }, 
    {
      "author": "Jaime Villasana Dávila", 
      "score": "0", 
      "text": "\n\nHello Hannah, ICMA has done some projects in that topic. However those projects have been funded by International Organizations. As Wes said, there is lot of material on Internet about this, even on www.icma.org/international you can find some cases (English). This manual (in spanish) about basic landfills could be useful. http://www.bancomundial.org.ar/lfg/Archivos/SW/RellenosSanitariosManuales_parte1.pdf  Take care.\n\n\nHello Hannah, ICMA has done some projects in that topic. However those projects have been funded by International Organizations. As Wes said, there is lot of material on Internet about this, even on www.icma.org/international you can find some cases (English). This manual (in spanish) about basic landfills could be useful. http://www.bancomundial.org.ar/lfg/Archivos/SW/RellenosSanitariosManuales_parte1.pdf  Take care.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-07-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Hannah Freedman", 
  "id": 21209, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am a Peace Corps volunteer serving in the community of San Pedro del Ycuamandyyu, and I am working on a project to bring solid waste managment to the city and surrounding areas.  To give a short background picture, there is not a single sanitary solid waste management program in the country, and that includes a lack of management at the federal level.  The outcome is that responsibility for waste management has been delegated to the bankrupt and impressively corrupt municipalities, which in turn either ignore the problem, or, as is the case here in San Pedro, build open dumps.  Because there is a charge for using the municipal dump, a culture has developed nation-wide in which people either throw their garbage in the streets or burn it at the household level.  Both the municipal and household solutions are legitimately non-functional, and are contributing to serious public health problems.  For example, most people burn their garbage before rain storms, and the smoke of hundreds of trash fires makes the air hard to breathe for hours.\nThe attached photos show the current \"waste management\" system.  The basic approach is to dig a hole until they hit the first groundwater table (at approximately 5-6 meters), fill the hole partially with garbage (from the hospital, households, restaurants, etc.), burn the garbage to compact it, and repeat the process.  I don't have access to any water testing equipment to know the specific toxicity of the leachate, but a visual inspection is enough to know that it is highly toxic.  Adding to this is the fact that the dump itself sits less than 100 meters from the local Rio Jejui, which is a recreational river and a prospective, probably very hypothetical, tourist site.  \nThe municipality approached me to help them plan a new system, largely because the dump will be full within two years.  I am not, however, an engineer of any sort, and do not feel comfortable providing technical suggestions or completing grant applications when I am largely unsure about how to procede.  As such, I have a few questions about how would be best to get started.\n1. There is an overall paucity of educated people in this part of Paraguay, and there most certainly no solid waste engineers.  Any ideas how I can get a technical expert to do an evaluation and make suggestions?  What kinds of data should I be collecting?\n2. Would a waste-to-energy plant be too risky/unrealistic for a place like San Pedro?\n3. Is there any way to clean up the current dump in a remotely cost-effective manner?  It looks to me like what would be a Superfund site in America, and the sandy soils and high water table seem to be major impediments, but it seems pretty dangerous to simply leave the dump as it is.\nThank you for any and all help you can provide!\n\n", 
  "title": "Solid waste management in Paraguay", 
  "when": "14-07-2011"
}