{
  "answer_by": null, 
  "answers": [
    {
      "author": "William Goetz", 
      "score": "0", 
      "text": "\n\nAddendum: A bicycle friendly system would be a possibility. It is problematic because the sub-tropical climate would cause considerable sweating during rides to and from work. It would necessitate public and/or private showers at or near destinations.\n\n\nAddendum: A bicycle friendly system would be a possibility. It is problematic because the sub-tropical climate would cause considerable sweating during rides to and from work. It would necessitate public and/or private showers at or near destinations.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-01-2012"
    }, 
    {
      "author": "Alexandra Iannolo", 
      "score": "0", 
      "text": "\n\nHello,\nI found some articles and study that may be a helpful start for your research.\nThis article, “Harnessing the Transportation/Land-Use Relationship,” discusses the balance between those two issues.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/2617/Harnessing_the_TransportationLandUse_Relationship\nThis report from the EPA and HUD describe transportation control measures that can be used to make systems more sustainable. \nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/2617/Harnessing_the_TransportationLandUse_Relationship\nThis plan from Sarasota County, FL details their sustainable plan for land use and transportation.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/20838/Planning_A_Sustainable_Future_Connecting_Land_Use_and_Transportation\nA similar report addresses the way in which municipalities must tailor transportation systems planned for cars to include pedestrians, bikers, and mass transit users. \nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/6347/Complete_the_Streets_for_Smart_Growth\nThis article details best practices for designing pedestrian friendly thoroughfares.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/301538/Designing_Walkable_Urban_Thoroughfares\nDetroit has considered creating a light rail system. You can read more about some of the issues that arose while planning their new system here.\nhttp://icma.org/en/Article/100424/Detroits_Proposed_Light_Rail_System\nAli Iannolo\nKnowledge Network Intern\naiannolo@ICMA.org\n\n\nHello,\n\nI found some articles and study that may be a helpful start for your research.\nThis article, “Harnessing the Transportation/Land-Use Relationship,” discusses the balance between those two issues.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/2617/Harnessing_the_TransportationLandUse_Relationship\nThis report from the EPA and HUD describe transportation control measures that can be used to make systems more sustainable. \nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/2617/Harnessing_the_TransportationLandUse_Relationship\nThis plan from Sarasota County, FL details their sustainable plan for land use and transportation.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/20838/Planning_A_Sustainable_Future_Connecting_Land_Use_and_Transportation\nA similar report addresses the way in which municipalities must tailor transportation systems planned for cars to include pedestrians, bikers, and mass transit users. \nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/6347/Complete_the_Streets_for_Smart_Growth\nThis article details best practices for designing pedestrian friendly thoroughfares.\nhttp://icma.org/en/icma/knowledge_network/documents/kn/Document/301538/Designing_Walkable_Urban_Thoroughfares\nDetroit has considered creating a light rail system. You can read more about some of the issues that arose while planning their new system here.\nhttp://icma.org/en/Article/100424/Detroits_Proposed_Light_Rail_System\n\nAli Iannolo\nKnowledge Network Intern\naiannolo@ICMA.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-01-2012"
    }, 
    {
      "author": "William Goetz", 
      "score": "0", 
      "text": "\n\nThank you very much for your prompt and extensive reply. I'll review them and see if they help. Thanks again.\n\n\nThank you very much for your prompt and extensive reply. I'll review them and see if they help. Thanks again.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-01-2012"
    }, 
    {
      "author": "Wayne Coutinho", 
      "score": "0", 
      "text": "\n\nPortland, Oregon is one of the best transit cities I have seen in the Canada and the USA.  TriMet System .... The city re-hauled the entire system, and I believe had strong corporate  support to minimize infrastructure costs to residential tax payers.  The accolades certainly are well deserved. Quick, cheap, or in business  core is free and comfortable.  Convenient and bicycle friendly, and resulted in removing a lot of vehicle traffic. It should be a model for other cities.\n\n\nPortland, Oregon is one of the best transit cities I have seen in the Canada and the USA.  TriMet System .... The city re-hauled the entire system, and I believe had strong corporate  support to minimize infrastructure costs to residential tax payers.  The accolades certainly are well deserved. Quick, cheap, or in business  core is free and comfortable.  Convenient and bicycle friendly, and resulted in removing a lot of vehicle traffic. It should be a model for other cities.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-01-2012"
    }
  ], 
  "answers_count": 4, 
  "author": "William Goetz", 
  "id": 21605, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Climate Change", 
    "Railroads, Ports, Airports", 
    "Finance and Budgeting", 
    "Economic Development", 
    "Sustainability", 
    "Transportation", 
    "Citizen Engagement"
  ], 
  "text": "\n\nIs anyone aware of a county or municipality whose transit infrastructure was originally built virtually entirely to accommodate  geographically spread-out residents driving individual vehicles, but which has now successfully built and converted at reasonable costs and logistics to a mass-transit system which residents enthusiastically use?\nLike most of Florida, Fort Lauderdale,, Fl (pop. 175K), and Boward County have a transit infrastructure almost totally devoted to accommodate individual private and commercial gas or diesel powered motor vehicles. The roads and transit infrastructures were never designed to take into account pedestrians, bicyclist, or mass transit. \nThe city and county are making reasonable strides to accommodate pedestrians and cyclist.\nHowever, because the business centers and residential areas are so spread out geographically, redesigning sustainable mass transmit to transport people from near their residences to their places of business is quite problematic, both financially and logistically. \nThis is particularly true for those who reside in the far western suburban housing developments 5-8 miles inland who must travel to the easterly located city center, itself about a mile from the coast. In addition, there are many residents in all areas of the county who must travel several miles north-south to their places of employment\nOne of the busiest ports in the nation is located  in the city, and services extremely high volume passenger ships,, as well as container ships. There is no connecting east-west rail line serving it, so the container ships are serviced only be trucks..\nOne of the nation's fastest growing airports is located near the port (most cruise-ship passengers enter here), but there are currently no mass transit lines servicing it to the port or other areas.\nThee is only one mass transit rail system going north-south, which is located about 3-4 miles inland, and parallels an over-burdened interstate. The number of stops is relatively limited, as are the scheduled east-west bus routes serving the stops. Because of the economy, cuts have further limited some bus routes.\nAnother north-south rail line is closer to the coast, but at present is used only for commercial transport. Negotiations are underway to convert it to a mass transit line.\nThe county is instituting a dedicated fast bus lane system, that currently runs north-south along only one major inland county highway, but it is even further from the coast. East-west transfer travel off this line is also problematic.\nDue to a high water table, underground transit is not feasible.\nOnly one east-west light-rail line has been proposed, but monies have not yet been allocated, and it is unclear whether it will ever be built. \nTo make matters more difficult, there are almost no sheltered bus stops, and many lack benches, forcing potential riders to stand in Florida's hot sun. \nThe whole thing seems like a macro-economic version of the chicken-egg dilema. Not to mention finances and logistics.\nAny successful system off a similar infrastructure?\nAny advice?\nDr. Bill\n\n", 
  "title": "Building a sustainability-friendly mass transit system", 
  "when": "06-01-2012"
}