{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jay Gsell", 
      "score": "0", 
      "text": "\n\nCory-count me in. Genesee County has been trying to inculcate this concept and reality into our county Comprehensive plan and its 10 focus groups along with our 10 yr old Smart growth plan which came as part of our County Wide water project initiative which had us invest $27million in water mains in cooperation with 2 adjoining metro counties(ERie and MOnroe, NY) to promote making potable municipal water available to more people in our 500 sq mile rural County in WNY. It has now taken on a more \"urgent\" tone with the recent enactment of a NYS property tax cap on all units of local government that by necessity will foster and result in m ore cooperation, collaboration and consolidation of our 19th century NYS local government/school \"system\".\n\n\nCory-count me in. Genesee County has been trying to inculcate this concept and reality into our county Comprehensive plan and its 10 focus groups along with our 10 yr old Smart growth plan which came as part of our County Wide water project initiative which had us invest $27million in water mains in cooperation with 2 adjoining metro counties(ERie and MOnroe, NY) to promote making potable municipal water available to more people in our 500 sq mile rural County in WNY. It has now taken on a more \"urgent\" tone with the recent enactment of a NYS property tax cap on all units of local government that by necessity will foster and result in m ore cooperation, collaboration and consolidation of our 19th century NYS local government/school \"system\".\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-08-2011"
    }, 
    {
      "author": "Scott Bowles", 
      "score": "0", 
      "text": "\n\nThis is a very interesting question.  It is difficult to universally define \"livability\" because, at least in my opinion, this term is affected by ethnic, geographic, financial, and other contributing factors.  We could develop a type of 'hierarchy of livability-needs' when addressing the core issues of smart growth and sustainability, but it is definitely no small feat.  Count me in.\n\n\nThis is a very interesting question.  It is difficult to universally define \"livability\" because, at least in my opinion, this term is affected by ethnic, geographic, financial, and other contributing factors.  We could develop a type of 'hierarchy of livability-needs' when addressing the core issues of smart growth and sustainability, but it is definitely no small feat.  Count me in.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-08-2011"
    }, 
    {
      "author": "PATRICK COUGHLIN", 
      "score": "0", 
      "text": "\n\nI prefer to compare towns in terms of \"quality of life\" instead of livability. To me, livability connotes minimum requirements, where quality of life connotes a town's ability to offer services that improve livability. Examples are libraries, parks and recreation, beautification projects, etc.\nIn my career as a fire chief, I became aware that fire protection: 1) was the second-highest cost of municipal services and, 2) that each dollar spent on fire protection left less to spend on quality of life projects. There are ways to increase efficiencies in fire protection (and thus release more funds for quality of life projects). If you are interested, see my post titled \"Sustainable Fire Protection\" at www.fdexcelence.com.\nPat\n\n\nI prefer to compare towns in terms of \"quality of life\" instead of livability. To me, livability connotes minimum requirements, where quality of life connotes a town's ability to offer services that improve livability. Examples are libraries, parks and recreation, beautification projects, etc.\n\nIn my career as a fire chief, I became aware that fire protection: 1) was the second-highest cost of municipal services and, 2) that each dollar spent on fire protection left less to spend on quality of life projects. There are ways to increase efficiencies in fire protection (and thus release more funds for quality of life projects). If you are interested, see my post titled \"Sustainable Fire Protection\" at www.fdexcelence.com.\n\nPat\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-10-2011"
    }
  ], 
  "answers_count": 3, 
  "author": "Cory Fleming", 
  "id": 21271, 
  "score": "1", 
  "tags": [], 
  "text": "\n\nHow do we create livable communities?  What factors contribute to a livable community?  How should one define \"livability?\" \nThese are just a few of the questions ICMA is working on answering as a member of the Livability Intergovernmental Advisory Group, a new project being managed by the National Association of Regional Councils (NARC).  Funded by the U.S. Department of Transportion, the project is looking at how to translate Federal agency livability principles into practical resources and tools for local governments and communities. Because this topic is so closely related to smart growth and sustainability, we're asking for ICMA members with an interest in these topics to consider participating on the Advisory Group which meets via conference call once a month.\nIf you'd like to be a part of this ongoing discussion, please contact Cory Fleming at cfleming@icma.org for more information.\n\n", 
  "title": "Help Define \"Livability\"", 
  "when": "05-08-2011"
}