{
  "answer_by": "03-11-2013", 
  "answers": [
    {
      "author": "Mark Abeles-Allison", 
      "score": "1", 
      "text": "\n\nI am sure Martha Perego will respond to your specific question regarding the code of ethics requirements.  My personal opinion is that you do not need to share this before the interview, however it should be noted during the interview.  On a more general note I would ask you several questions.  What impact does your personal financial situation have on your ability to manage a city?  Does it limit your administrative abilities? Has the event helped you at all?  During the interview I would make sure and discuss what the experience has provided you from a learning perspective and how you may be better prepared at this point in time...  Good luck.\n\n\nI am sure Martha Perego will respond to your specific question regarding the code of ethics requirements.  My personal opinion is that you do not need to share this before the interview, however it should be noted during the interview.  On a more general note I would ask you several questions.  What impact does your personal financial situation have on your ability to manage a city?  Does it limit your administrative abilities? Has the event helped you at all?  During the interview I would make sure and discuss what the experience has provided you from a learning perspective and how you may be better prepared at this point in time...  Good luck.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-11-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "[Anonymous]", 
  "id": 22811, 
  "score": "0", 
  "tags": [
    "Ethics", 
    "Career Resources"
  ], 
  "text": "\n\nI had to file for personal bankruptcy nine months ago.  It was an excruciating decision, but I had virtually no options after having been unemployed as a ICMA MIT since July 2010...and after accumulating significant medical debts and being forced to serve as a primary caregiver to an elderly parent.  \nI continue current employment as a part-time adjunct instructor at a local community college Recently (past three years), but a mutual friend guided a local elected official to me as a possible candidate for a city administrator position.  I interview this coming Monday evening.  I feel compelled to call the interview committee to share this personal matter with its chairman, before this meeting takes place.  IS THIS DISCLOSURE ADVISABLE AT THIS INITIAL STAGE IN THE PROCESS (OR IS IT , IN FACT, ACTUALLY AN ETHICS REQUIRMENT PER ICMA MEMBERSHIP)?\n\n", 
  "title": "Personal Bankruptcy", 
  "when": "01-11-2013"
}