{
  "answer_by": null, 
  "answers": [
    {
      "author": "Michael Repas", 
      "score": "1", 
      "text": "\n\nHi Christal:\nI have found a report from Portland, OR, that offers 5 case studies of PFP being successfully-implemented at the local government level (I put the document on the Knowledge Network: http://icma.org/en/icma/knowledge_network/documents/kn/Document/301413/Issues_to_Consider_in_Implementing_a_PayForPerformance_Program and the case studies start on page 17 of the report).  This local governments include:\n1) Baltimore County, MD\n2) Concord, CA\n3) City of Coral Springs, FL\n4) City of Las Vegas, NV\n5) City of Shreveport, LA\nFrom this report and list of case studies, it seems that Concord CA focused heavily on management employees being rewarded for exceptional performance, which is something you mentioned interest in.  Additionally, Las Vegas NV also had a strong focus on the possibilities offered by PFP for leadership positions, although with an approach geared more towards the setting and achieving of personal management goals.  Finally, Shreveport LA might be worth contacting, as they have achieved a balance of management and employee PFP that has worked for them very well.\nIt seems like contacting any of these local governments directly would be your best bet, as you can pose your specific questions directly to them.\nI hope this helps!\n\n\nHi Christal:\n\nI have found a report from Portland, OR, that offers 5 case studies of PFP being successfully-implemented at the local government level (I put the document on the Knowledge Network: http://icma.org/en/icma/knowledge_network/documents/kn/Document/301413/Issues_to_Consider_in_Implementing_a_PayForPerformance_Program and the case studies start on page 17 of the report).  This local governments include:\n\n1) Baltimore County, MD\n2) Concord, CA\n3) City of Coral Springs, FL\n4) City of Las Vegas, NV\n5) City of Shreveport, LA\n\nFrom this report and list of case studies, it seems that Concord CA focused heavily on management employees being rewarded for exceptional performance, which is something you mentioned interest in.  Additionally, Las Vegas NV also had a strong focus on the possibilities offered by PFP for leadership positions, although with an approach geared more towards the setting and achieving of personal management goals.  Finally, Shreveport LA might be worth contacting, as they have achieved a balance of management and employee PFP that has worked for them very well.\n\nIt seems like contacting any of these local governments directly would be your best bet, as you can pose your specific questions directly to them.\n\nI hope this helps!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-06-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Christal Laswell", 
  "id": 20155, 
  "score": "2", 
  "tags": [], 
  "text": "\n\nAre there any organizations currently out there that are utilizing any form of a \"Pay for Performance\" Program.  I am sure there are many forms of this type of program; however, I am more specifically interested in the use of performance bonuses.  Instead of providing annual salary increases, the focus would be that of adjusting salaries determined by what it takes in a particular labor market to attract and keep employees, and bonuses would be used to reward performance.  Esentially, an employee could be rewarded a percentage of their salary for contributing to performance improvements and/or that meet a certain percentage of their performance indicators or performance targets predetermined through a performance contract.  \nThe focus of this initiative would primarily be on Leadership or Department Heads.  Our purpose in looking in this direction is to start holding the Leadership Team accountable to their performance measures and using those to make decisions and truly manage performance.\nWe are certainly in our preliminary stages of research and any help, recommendations, experiences, feedback is very much appreciated. \nIf you do have such experience or programs that you are currently utilizing, I would be interested in how it is specifically utilized and administered within your organization.  \nAdditional questions may also include:  \nWhat is the process of developing performance contracts?\nHow do you budget for it?\nI can also be contacted at claswell@collinsvilleil.org.  Thank you so much!\n\n", 
  "title": "Pay for Performance Initiatives", 
  "when": "22-06-2010"
}