{
  "answer_by": null, 
  "answers": [
    {
      "author": "Christopher Anderson", 
      "score": "0", 
      "text": "\n\nI wouldn’t get too hung up over this process.  If they select candidate #2, would you really want to work for a Council that selects their top official based on apparent personal connections?\nI was once passed over for a position and the Council hired a local guy.  He didn’t last long.  Not getting hired was one of the best things that could have happened.  I soon took a better position elsewhere.\nI’d keep in mind that having a list of accomplishments is important, but not the whole picture.  In my experience, having a Council that is comfortable with you personally is at least as important as the specific tasks you are performing.\nI’ve been very effective in my community, largely due to great relationships with elected officials, staff and community leaders.  I’d be an utter failure is some other communities where my style and approach would not be a good fit.\nAgain, I wouldn’t get too hung up over how you compete against other candidates.  The most qualified candidate isn’t necessarily the best candidate for a specific position.  Our profession has a long history of great, efficient managers being fired for reasons unrelated to their technical competence.  Your long-term success will be based on how well you fit with the community, and that’s where I’d keep my focus during this process.\n\n\nI wouldn’t get too hung up over this process.  If they select candidate #2, would you really want to work for a Council that selects their top official based on apparent personal connections?\nI was once passed over for a position and the Council hired a local guy.  He didn’t last long.  Not getting hired was one of the best things that could have happened.  I soon took a better position elsewhere.\nI’d keep in mind that having a list of accomplishments is important, but not the whole picture.  In my experience, having a Council that is comfortable with you personally is at least as important as the specific tasks you are performing.\nI’ve been very effective in my community, largely due to great relationships with elected officials, staff and community leaders.  I’d be an utter failure is some other communities where my style and approach would not be a good fit.\nAgain, I wouldn’t get too hung up over how you compete against other candidates.  The most qualified candidate isn’t necessarily the best candidate for a specific position.  Our profession has a long history of great, efficient managers being fired for reasons unrelated to their technical competence.  Your long-term success will be based on how well you fit with the community, and that’s where I’d keep my focus during this process.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-02-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Unknown", 
  "id": 20793, 
  "score": "0", 
  "tags": [
    "Career Resources"
  ], 
  "text": "\n\nLate 2010 I was asked to resign from my first municipal management job.  Despite real and demonstrated success in the community, the Board decided to move in another direction.  As with these sudden terminations/resignations, I was left blindsided.  Thanks to the ICMA resources, I was able to negotiate a severance and the like and continue to search for employment.\nI am pleased to say that I have made it far in two highly competitive communities which are/were seeking to to replace their manager.  The first community decided to proceed with a candidate that had more experience.  I took a level of confidence away from that process despite not being offered the position/appointment.\nThis second community is another competitive process.  There are three candidates...\n(1) Me--education and professional experience that is line with the position.  The feedback that I've received from the consultant has been nothing but positive regarding my stance as a candidate.\n(2)  Candidate 2--This candidate was disqualified during the initial stages, however, is well known with the officials and remains in the standing.  Their experience and history are not in line professionally for the position but the Council has requested they say in the final round\n(3)  Candidate 3-- This candidate has more experience than me which I respect.  However, this candidate was unable to build the rapport with the officials the same way I was.  While I understand the experience level between this candidate and I are not parallel, I think successes are measurable regardless of time (or with time, perhaps!)\nMy question is two-fold:\n(1)  Have you ever been put in a situation like this?  I'm more concerned at this juncture about the second candidate than the third because of the fact that I was able to succeed so well in a limited amount of time.\n(2)  What approach would you take?\nThanks for your feedback!\n\n", 
  "title": "Two hills to climb: Next Gen Manager (young) against well known but not qualified canididate", 
  "when": "15-02-2011"
}