{
  "answer_by": null, 
  "answers": [
    {
      "author": "Michael Quillen", 
      "score": "0", 
      "text": "\n\nThe City of Clearwater uses project signs similar to what you describe.  They include project info, contact information & funding source.  For more details go to the City web site-  www.myclearwater.com, then to the Engineering Dept., then Documents & Publications, then Contract Specifications, General Conditions Section 23, Project Information Signs.\n\n\nThe City of Clearwater uses project signs similar to what you describe.  They include project info, contact information & funding source.  For more details go to the City web site-  www.myclearwater.com, then to the Engineering Dept., then Documents & Publications, then Contract Specifications, General Conditions Section 23, Project Information Signs.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-08-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Sarah Saunders", 
  "id": 21272, 
  "score": "0", 
  "tags": [
    "Housing & Community Development", 
    "Planning", 
    "Public Works"
  ], 
  "text": "\n\nThe City of Tamarac, Florida is interested in learning if any municipalities currently REQUIRE announcing or project signs to be placed at the location of Capital Improvement Projects to inform the public about the project (in instances where there is no other requirement/obligation, i.e. grant funded). Our City currently does not have a requirement to do so, however as a way to promote transparency we have posted signs at some locations. These signs state what type of project is occurring and provide contact information, the City logo, and Commissioners' names. We are interested in learning if other municipalities require this, and your responses would be greatly appreciated. Additionally, if it is possible, please provide a copy of the code/ordinance that requires such signage. \nWe look forward to your responses!\nThank you!\n\n", 
  "title": "CIP Announcement/Project Sign Requirements", 
  "when": "08-08-2011"
}