{
  "answer_by": null, 
  "answers": [
    {
      "author": "Pamela Muse", 
      "score": "0", 
      "text": "\n\nDoug - a thought ... How about using the dept of motor vehicle registration classifications?  \nGood luck!\nPam Muse\n\n\nDoug - a thought ... How about using the dept of motor vehicle registration classifications?  \n\nGood luck!\nPam Muse\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-01-2011"
    }, 
    {
      "author": "David Morgan", 
      "score": "0", 
      "text": "\n\nDoug,\nWe've updated most of our parking related ordinances within the last few years.  We've found most resident complaints are about the size and quantity of vehicles on the property.  Our ordinances prohibit parking of certain types of vehices (box truck, box van, tow truck, etc...) and also prohibits motor vehicles (truck, van, bus, etc...) over a certain size.  The size is 23 ft in length, eight ft in width and ten ft in height.  I don't recommend you use weight or towing capacity.  We also have another code for trailers and for recreational vehicles.  The trailer ordinance prohibits most types.  The recreational vehicle ordinance requires them to be stored behind the front building wall and screened from view of the street by a wood fence or living screen.  There are also provisions for temporarily parking the vehicle in the driveway if you're preparing for a trip.  Lastly, we prohibit overnight parking on the street unless it's directly adjacent to your property.  Let me know if you need any of these ordinances.\n-David\n\n\nDoug,\n\nWe've updated most of our parking related ordinances within the last few years.  We've found most resident complaints are about the size and quantity of vehicles on the property.  Our ordinances prohibit parking of certain types of vehices (box truck, box van, tow truck, etc...) and also prohibits motor vehicles (truck, van, bus, etc...) over a certain size.  The size is 23 ft in length, eight ft in width and ten ft in height.  I don't recommend you use weight or towing capacity.  We also have another code for trailers and for recreational vehicles.  The trailer ordinance prohibits most types.  The recreational vehicle ordinance requires them to be stored behind the front building wall and screened from view of the street by a wood fence or living screen.  There are also provisions for temporarily parking the vehicle in the driveway if you're preparing for a trip.  Lastly, we prohibit overnight parking on the street unless it's directly adjacent to your property.  Let me know if you need any of these ordinances.\n\n-David\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-02-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Douglas Lewis", 
  "id": 20724, 
  "score": "0", 
  "tags": [
    "Planning"
  ], 
  "text": "\n\nThe CIty of Painesville, Ohio currently regulates the types of oversized vehicles permitted in residential district by naming them.  Below is a copy of the section in the ordinance.  We have looked into and most seem to regulate by lenght, height, width and weight.   If you have other suggestions, I would be interested.  Thank you!\n(b)     No person shall park or store a commercial tractor, school bus, bus, semitrailer, pole trailer, dump vehicle, tow truck, or flat bed within the residential districts of the City, either on public or private property, including a public street or highway, except to make deliveries, pickups or for the loading or unloading of persons, unless such commercial tractor, school bus, bus, semitrailer, pole trailer, dump vehicle, tow truck or flat bed is parked or stored in a completely enclosed structure. \nThank you in advance.  \nDoug Lewis, Assistant City Manager/Community Development Director\nCity of Painesville, Ohio\n\n", 
  "title": "Residential Parking of Overweight Vehicles", 
  "when": "25-01-2011"
}