{
  "answer_by": null, 
  "answers": [
    {
      "author": "Lawrence Di Re", 
      "score": "1", 
      "text": "\n\nMy sympathies are with citizens' interest in how the employees on their payroll are providing public services.  If some of these citizens consider themselves journalists it is perhaps best left to the respective reader to determine that.  In other words, passing an ordinance attempting to define \"journalist\" is a path best avoided.  If the public servants are performing public duties on compensated time what's the problem with citizens recording such duties as long as public safety or public health is not compromised?  Otherwise, does your organization not have specific staff positions identified as those who functions as spokesperson\\information officer for the respective departments?  Every water meter reader should not be expected to provide policy debate and analysis while carrying out those duties.  It might be beneficial to remind staff that policy is set by the governing board who meet regularly in open, public meeting.  If citizens have interests in why public employees are doing what they are doing then that might be the best venue to direct those questions.\n\n\nMy sympathies are with citizens' interest in how the employees on their payroll are providing public services.  If some of these citizens consider themselves journalists it is perhaps best left to the respective reader to determine that.  In other words, passing an ordinance attempting to define \"journalist\" is a path best avoided.  If the public servants are performing public duties on compensated time what's the problem with citizens recording such duties as long as public safety or public health is not compromised?  Otherwise, does your organization not have specific staff positions identified as those who functions as spokesperson\\information officer for the respective departments?  Every water meter reader should not be expected to provide policy debate and analysis while carrying out those duties.  It might be beneficial to remind staff that policy is set by the governing board who meet regularly in open, public meeting.  If citizens have interests in why public employees are doing what they are doing then that might be the best venue to direct those questions.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-11-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "[Anonymous]", 
  "id": 22835, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am trying to identify best practices to provide our employees when they encounter aggressive \"citizen journalists,\" who film personnel without consent. There are no ordinances that prevent the citizen journalists from filming in areas open to the public, so I am looking for internal policies, recommendations, tools, etc.  Does anyone have advice or documents that they would be willing to share?\nThank you.\n\n", 
  "title": "Policies on responding to \"citizen journalists\"", 
  "when": "14-11-2013"
}