{
  "answer_by": "16-11-2010", 
  "answers": [
    {
      "author": "Caitlyn Mitchell", 
      "score": "0", 
      "text": "\n\nHere is a website that describes hundreds of consolidation efforts between cities and counties in the state of New York. \nThe first page is a listing of the types of consolidation efforts. In the upper, left hand corner, there are links for a final report, information about the commission, and for the individual local initiatives as well as accesses to the resources that led to the findings in the final report. The final report will include some cost/benefit analysis, predicting $1billion is savings over the next 25 years. Hope it helps.\nhttp://www.nyslocalgov.org/local_initiatives_county.asp\n\n\nHere is a website that describes hundreds of consolidation efforts between cities and counties in the state of New York. \nThe first page is a listing of the types of consolidation efforts. In the upper, left hand corner, there are links for a final report, information about the commission, and for the individual local initiatives as well as accesses to the resources that led to the findings in the final report. The final report will include some cost/benefit analysis, predicting $1billion is savings over the next 25 years. Hope it helps.\n\nhttp://www.nyslocalgov.org/local_initiatives_county.asp\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "15-11-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Otis Hollar", 
  "id": 20589, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am trying to find information on consolidation of maintenance activities.  Such as Public Works Department, Water Department, Parks and Recreation.  Question is; Would consolidatoin of maintenance activities provide for more efficient use of current equipment, vehicles, and people.  Is there cost savings?  Specifically, combining multiply department maintenance organizations into one for a large county government.  Is there any information that I could read or web-site that could provide information concerning this issue?  Please advise.  Request responses by 16 Nov 2010.  Thank you\nOtis Lea Hollar\n\n", 
  "title": "Manager, HillsboroughCounty Public Works", 
  "when": "12-11-2010"
}