{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jonathan Walker", 
      "score": "0", 
      "text": "\n\nScott,\nI work with several communities as the provider of this service and am happy to provide you with contacts at the cities to talk with.   I would also be happy to answer any general questions you may have.  I will forward the contact information to you soon.\n\n\nScott,\n\nI work with several communities as the provider of this service and am happy to provide you with contacts at the cities to talk with.   I would also be happy to answer any general questions you may have.  I will forward the contact information to you soon.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-08-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Scott Huizenga", 
  "id": 22094, 
  "score": "0", 
  "tags": [
    "Planning"
  ], 
  "text": "\n\nI apologize if this request is a bit advanced for this forum.  I seek some responses to a brief survey regarding Building Inspections services.  If you cannot answer the questions specifically, I am interested more generally in how cities with populations between approximately $5000-$10,000 handle building inspections services.\nEast Grand Forks, Minnesota, population 8601, is deciding how or if to replace its Building Official in the wake of a pending retirement.  The City once had one building official, one building inspector, and one permit technician.  The inspector position was eliminated after a previous retirement due to declining activity following the “bubble” and after post-flood recovery.  Currently, we have one Building Official and one Permit Technician.\nWith continued reduced activity, we are deciding whether or not to keep the position \"in-house,\" and if so, how to organize the position.  If your city has not yet received this survey, I appreciate your help.  I apologize if this message is duplicative.  We are happy to compile and share the results.  We are targeting primarily cities with 5000-10,000 in population.  But, we'll take all input. \n\nIf your City has internal staff, how many positions do you have and what are their job titles?\nTo whom does the building official report?  Is building inspections its own department or within another department?\nIf your City outsources all or part of building inspections, what firm(s) do you use?\nIf your City outsources all or part of building inspections, how is the firm(s) reimbursed (i.e. hourly rate, a portion of inspections fees)?\nIf your City outsources all or part of building inspections, who is the internal contact for coordinating permit and inspections activities?\nHow many building permits did you issue in the following categories in 2011.  \na.  New single family dwellings\nb.  New commercial\nc.  Garages\nd.  Residential repair\ne.  Commercial repair\nf.  Other\nDoes your inspections office enforce rental codes/inspections?\nDoes your inspections office enforce property code violations?\n\n\n", 
  "title": "Building Inspections Survey", 
  "when": "14-08-2012"
}