{
  "answer_by": null, 
  "answers": [
    {
      "author": "Charles Jordan", 
      "score": "0", 
      "text": "\n\nIn Largo, we are allowed to overspend within line items, but not within our programs.  We utilize a program based budget that breaks down our services within our organizational units.  These programs are broken down into Personnel, Operating, Capital, and Other.  As long as the total expended within the program is less than the budget at the end of the fiscal year, we are ok.\nIf we need to transfer funds outside of programs, we can do so with Budget Transfers (under $25,000, in the same department and the same funding source) with just the City Manager's approval.  Anything more, or over departments / funds requires a City Commission approved Budget Amendment.\n\n\nIn Largo, we are allowed to overspend within line items, but not within our programs.  We utilize a program based budget that breaks down our services within our organizational units.  These programs are broken down into Personnel, Operating, Capital, and Other.  As long as the total expended within the program is less than the budget at the end of the fiscal year, we are ok.\n\nIf we need to transfer funds outside of programs, we can do so with Budget Transfers (under $25,000, in the same department and the same funding source) with just the City Manager's approval.  Anything more, or over departments / funds requires a City Commission approved Budget Amendment.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-09-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "J. Munger", 
  "id": 23307, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting"
  ], 
  "text": "\n\nBroward County, FL is in the midst of a transition into an Enterprise Resource Planning project, meaning within the next few years all of the agencies’ systems will have some level of integration. The Office of Management in Budget is considering using this time to evaluate some of our processes and policies to see if they are too restrictive or permissive compared to other entities. \nRight now, we generally have object code control, meaning that each line item—generally—are not allowed to be overspent. This means divisions, departments, and our office are frequently making transfers from one line item to another to keep each agency within its appropriation. Other counties I have contacted have “appropriation group” control, meaning that each division has categories of line items (personal services, operating expenses, capital, debt service, etc.). As long as these groups are whole at year-end, the individual line items can be over spent. \nAdditionally, we have thresholds for transfer amounts or dollar ranges that trigger increasing levels of approval—from the division level, to the department level, to the OMB level. \nSo my questions:\n-At what level do different entities enforce expenditure control? Line item, “appropriation group,” division, department, fund? \n-What are your policies for budget transfers not requiring board/council action? \nThanks in advance.\n\n", 
  "title": "Budget Transfer Thresholds", 
  "when": "12-09-2014"
}