{
  "answer_by": null, 
  "answers": [
    {
      "author": "Randy Webster", 
      "score": "0", 
      "text": "\n\nWe prepare a biennial cost of service report on all recreation activities that charge fees as in-house analysts. We have also completed a pricing analysis, though more limited in scope. This work can be done in house with good financial and management analysts. Using consulting services would be a good way to jump start the work. Here are links to our reports for review and comparison. \nhttp://www.portlandonline.com/parks/index.cfm?a=331803&c=38306\n\n\nWe prepare a biennial cost of service report on all recreation activities that charge fees as in-house analysts. We have also completed a pricing analysis, though more limited in scope. This work can be done in house with good financial and management analysts. Using consulting services would be a good way to jump start the work. Here are links to our reports for review and comparison. \nhttp://www.portlandonline.com/parks/index.cfm?a=331803&c=38306\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-09-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Kevin Safine", 
  "id": 22156, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Parks and Recreation", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nThe City of Walnut Creek, California is pursuing an assessment of our arts and recreation programs, with the goal of increasing cost recovery. We are interested in defining our direct and indirect costs, identifying current revenues and cost recovery results, exploring alternate policies to achieve different cost recovery targets, and establishing a pricing policy consistent with these goals. Here’s my question: we are considering the use of a consultant for this project and wonder, do you have any RFP or RFQ documents that that you have issued for similar projects?  If so, I would be happy to receive or discuss them with you, along with your successes/learnings that came as a result of the project.  Thanks very much!\n\n", 
  "title": "RFPs Used for Consultants to Assist with Cost Recovery?", 
  "when": "18-09-2012"
}