{
  "answer_by": null, 
  "answers": [
    {
      "author": "Scott Akrie", 
      "score": "0", 
      "text": "\n\nElliot, \nI can't speak for other vendors, but we ( NetLogix) offer free vendor agnostic seminars/webinars on the types of technology that we offer - no sales pitch. The reason is because we believe that an informed , knowledgeable city decision maker or influencer is better and this results in better RFPs/RFQs and better technology implementation. A failed project is bad for business even if we're not the vendor as a successful project is good for business; and frankly - we've had to fix a lot of the failed projects. I've spoken to my technology partners and they support initiatives like these as well and often times underwrite them ( with no strings attached no advertising no banners, etc.) I think that this is something that Munis must require of the vendor community especially with the economic challenges you face today.\n\n\nElliot, \nI can't speak for other vendors, but we ( NetLogix) offer free vendor agnostic seminars/webinars on the types of technology that we offer - no sales pitch. The reason is because we believe that an informed , knowledgeable city decision maker or influencer is better and this results in better RFPs/RFQs and better technology implementation. A failed project is bad for business even if we're not the vendor as a successful project is good for business; and frankly - we've had to fix a lot of the failed projects. I've spoken to my technology partners and they support initiatives like these as well and often times underwrite them ( with no strings attached no advertising no banners, etc.) I think that this is something that Munis must require of the vendor community especially with the economic challenges you face today.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-06-2011"
    }, 
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nScott is correct, many vendors provide free training on line and in class room settings.  If you have some real technological challenged people like me, the best training commercial on line programs I have ever used is Linda.com, even i can figure it out.  My response to technology is \" I love technology, it just doesn't love me back.\"\n\n\nScott is correct, many vendors provide free training on line and in class room settings.  If you have some real technological challenged people like me, the best training commercial on line programs I have ever used is Linda.com, even i can figure it out.  My response to technology is \" I love technology, it just doesn't love me back.\"\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-06-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Elliott Nelson", 
  "id": 21122, 
  "score": "0", 
  "tags": [
    "Technology"
  ], 
  "text": "\n\nThe City of Watertown is exploring ways to better train staff in order to address gaps in our technology training. We have many software packages in place and desire to use them as effectively as possible but without spending a lot of money sending individuals to training seminars or relying on faceless manuals.\nHas anyone out there explored this issue in their municipality, and can you relay how you increased your staffs’ technological proficiency? What did you find most effective, and what did you find that was ineffective? Any information on past and current practices would be helpful and appreciated.\n\n", 
  "title": "Technology Training", 
  "when": "13-06-2011"
}