{
  "answer_by": null, 
  "answers": [
    {
      "author": "Robert Carty", 
      "score": "0", 
      "text": "\n\nGiven that I've recently read about MPAs obtaining small town manager jobs shortly after graduate school, I would say (just on your brief description of your experience) you have enough experience to be competitive for an assistant position at a minimum. Definitely draw the skills from your past experience that can boost your profile and help you fit the skills needed in the manager's office. You might even reach out to your current manager's office and see if there are any special projects you might take on to round out any skills that need a boost, or just to add work for the manager's office to your resume.\nAlso, there are some great answers to other career questions in the Career Resources and Next Generation topics - give them a browse. Check out the \"Career Compass\" column under the news section as well.\n\n\nGiven that I've recently read about MPAs obtaining small town manager jobs shortly after graduate school, I would say (just on your brief description of your experience) you have enough experience to be competitive for an assistant position at a minimum. Definitely draw the skills from your past experience that can boost your profile and help you fit the skills needed in the manager's office. You might even reach out to your current manager's office and see if there are any special projects you might take on to round out any skills that need a boost, or just to add work for the manager's office to your resume.\n\nAlso, there are some great answers to other career questions in the Career Resources and Next Generation topics - give them a browse. Check out the \"Career Compass\" column under the news section as well.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-09-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Steven Wright", 
  "id": 20367, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am currently a department-level administrative analyst with a municipal government serving 440,000 citizens.  Prior to my current position, I spent just under two years as Quality Assurance/Improvement (program evaluation) Program Manager with a county-level human services agency and 3.75 years as Director of Communications (i.e. public relations)/At-Risk Programs Coordinator for a small public school district.  My educational background includes the requisite MPA degree, along with an additional 36 semester hours of doctoral-level public administration course work.  My desire is to \"break into\" the town manager field.  Would the aforementioned experiential and educational backgrounds be sufficient, typically speaking, for me to secure an ATM position?  I have no desire to, ultimately, secure a CM position in a large city.  I merely desire to utilize my skills and knowledge to secure high-level management positions in smaller municipal organizations.  (Small town management is simply a personal preference.)  I am more than willing to relocate for the right position.  \nAny advice from the town management folks out there would be greatly appreciated.\n\n", 
  "title": "Securing an Assistant Town Manager position", 
  "when": "01-09-2010"
}