{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roderick Wood", 
      "score": "0", 
      "text": "\n\nI'm sure it varies by State.  In California all government and not-for-profit entities are exempt from property taxes.  There is no offset for this lose of taxes and yes the city must provide all the normal services like police and fire.  The exception is if the property is being used for a non-government or non-nonprofit purpose such as rented out for income, then the tenent pays the property tax in the form called possessor interest tax.  I do not know the specific codes that define non-government use.  I would contact any of the county assessor offices in California and ask them which codes apply.\n\n\nI'm sure it varies by State.  In California all government and not-for-profit entities are exempt from property taxes.  There is no offset for this lose of taxes and yes the city must provide all the normal services like police and fire.  The exception is if the property is being used for a non-government or non-nonprofit purpose such as rented out for income, then the tenent pays the property tax in the form called possessor interest tax.  I do not know the specific codes that define non-government use.  I would contact any of the county assessor offices in California and ask them which codes apply.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-05-2011"
    }, 
    {
      "author": "Robert Nanni", 
      "score": "0", 
      "text": "\n\nFlorida is similar to California, in that the tax exempt government property must not utilize the property for profit, if that happens the property is taxable. In Florida, County Property Appraisers follow State statutes, I do not recall the statute. Yes, local governments must provide services such as Polic, Fire, Public Works and Administration etc. Fees and taxes from taxable fee paying areas offset the cost of services to tax exempt areas. By the way, in Florida some fees, such as Stormwater Utility Fees are paid by tax exempt agencies for those services through interlocal agreements.\n\n\nFlorida is similar to California, in that the tax exempt government property must not utilize the property for profit, if that happens the property is taxable. In Florida, County Property Appraisers follow State statutes, I do not recall the statute. Yes, local governments must provide services such as Polic, Fire, Public Works and Administration etc. Fees and taxes from taxable fee paying areas offset the cost of services to tax exempt areas. By the way, in Florida some fees, such as Stormwater Utility Fees are paid by tax exempt agencies for those services through interlocal agreements.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-05-2011"
    }
  ], 
  "answers_count": 2, 
  "author": "Peter Staples", 
  "id": 21060, 
  "score": "0", 
  "tags": [
    "Public Policy", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nI am a PhD student studying public policy and am trying to find what states do (if anything) to reimburse for lost revenues due to property tax exemptions on state-owned property.  For example, in a university town, a large portion of the property may be exempt from property taxes because it is owned by the state.  However, the municipality still may have spend money to provide local services to it.  I have tried Lexis-Nexis and some of the other legal references but am not coming up with anything.  Also, I would be interested in finding sources listing state criteria for what is exempt and what is not exempt from local property taxes.  \nThanks,\nPeter\n\n", 
  "title": "Compensation from the state for lost property tax revenues from state-owned property", 
  "when": "25-05-2011"
}