{
  "answer_by": null, 
  "answers": [
    {
      "author": "Gerald Young", 
      "score": "0", 
      "text": "\n\nTask forces are all set to discuss public works and other services as ICMA rolls out its new performance management initiatives.  Even if you're not on a task force, we'd still value your input.  Please take this brief survey to note your comparative data priorities: \nhttps://www.surveymonkey.com/s/RS25CMV\n\n\nTask forces are all set to discuss public works and other services as ICMA rolls out its new performance management initiatives.  Even if you're not on a task force, we'd still value your input.  Please take this brief survey to note your comparative data priorities: \n\nhttps://www.surveymonkey.com/s/RS25CMV\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-03-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Gerald Young", 
  "id": 22990, 
  "score": "0", 
  "tags": [
    "Infrastructure Planning", 
    "Water & Sanitation", 
    "Fleets", 
    "Public Works", 
    "Sustainability", 
    "Performance Management and Analytics"
  ], 
  "text": "\n\nHow do you communicate with residents about road quality?\nIs recycling assessed by net revenues or diversion rates?\nIs vehicle replacement driven by this year’s budget pressures or projected maintenance costs? \nOver the last 12 months, ICMA has been conducting significant evaluation, research, and design efforts to restructure its performance management activities and facilitate the analysis of just such issues.  High level changes include: \n\nStreamlined service areas and a focus on core and outcome measures, shifting the data collection burden from roughly 5,000 individual measures to 500\nNew, state of the art software platform with improved reporting and analytic capabilities\nNew service levels that appropriately focus on the performance management and analytic activities undertaken by your community and provide a clear course for development\n\nTo inform our survey update efforts, ICMA is creating short-term task forces on this and other service clusters to ensure that we build our revised performance management program on the metrics most relevant and meaningful to local government decision-making.  Task force members would be chosen to ensure broad geographic representation and various local government types.  Those selected would be asked to commit to attend two web conferences.  The task force will meet on Thursday, March 20, at 3pm EDT. \nPlease email  Gerald Young  at gyoung@icma.org if you are interested in serving on this task force.\n\n", 
  "title": "Measuring Maintenance, Infrastructure and Utilities", 
  "when": "21-02-2014"
}