{
  "answer_by": null, 
  "answers": [
    {
      "author": "Eric Palm", 
      "score": "0", 
      "text": "\n\nHey Brent!\nWe went to a monthly stipend for management employees of $40 to cover voice and data.  The only Village issued cell phones are for our ambulance and engineer tech that is used during construction season.  Also as an FYI, currently IRS rules state that these stipends are not taxed.  I attached a copy of our policy.\n\n\nHey Brent!\nWe went to a monthly stipend for management employees of $40 to cover voice and data.  The only Village issued cell phones are for our ambulance and engineer tech that is used during construction season.  Also as an FYI, currently IRS rules state that these stipends are not taxed.  I attached a copy of our policy.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-08-2012"
    }, 
    {
      "author": "Jessica Roth", 
      "score": "0", 
      "text": "\n\nWe transitioned to a stipend program in 2008 for many of the same reasons.  Employees do have the option of still having a City-issued phone, but it is for business use ONLY; I think we only have 1 employee who elected for that option.  We have three tiers of reimbursement for the stipend; the amount is improved by the supervisor.\n$35/month - City  use is projected to be 400 minutes or less\n$55/month - City use is projected to be greater than 400 minutes\n$40/month - data services for employees who are regularly away from the office and/or who are needed in after-hours or emergency situations.  This is in addition to the stipend for minutes.\nSuwanee's policy is attached.\n\n\nWe transitioned to a stipend program in 2008 for many of the same reasons.  Employees do have the option of still having a City-issued phone, but it is for business use ONLY; I think we only have 1 employee who elected for that option.  We have three tiers of reimbursement for the stipend; the amount is improved by the supervisor.\n\n$35/month - City  use is projected to be 400 minutes or less\n$55/month - City use is projected to be greater than 400 minutes\n$40/month - data services for employees who are regularly away from the office and/or who are needed in after-hours or emergency situations.  This is in addition to the stipend for minutes.\n\nSuwanee's policy is attached.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-08-2012"
    }, 
    {
      "author": "Erick Lee", 
      "score": "0", 
      "text": "\n\nHere's the City of Beverly Hills' policy.\n\n\nHere's the City of Beverly Hills' policy.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "30-08-2012"
    }
  ], 
  "answers_count": 3, 
  "author": "Brent Eichelberger", 
  "id": 22118, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Human Resources", 
    "Telecommunications", 
    "Finance and Budgeting"
  ], 
  "text": "\n\nOur municipality currently provides cell phones to many employees. Phones/plans range from rugged, basic use phones for field personnel to smart phones for some upper management. We have several employees that carry both their work phone and a personal phone with them at all times. (We allow for a limited amount of personal use during the work day.)\nWe are thinking it may be more effecient for some employees, and more cost effective for the Village, to reimburse employees if they use their personal phone as their business phone. We would establish a flat monthly reimbursement amount based on what the Village currently pays for the applicable plan. Employees would have to make the phone number available as if it was a work issued phone. The employees benefit as they get reimbursement toward the cost of their personal phone and the Village benefits as we are not paying for the phone itself. \nDoes anyone have a policy for this that you can share?\n\n", 
  "title": "Cell Phone - Village Issue or Personal Reimbursed?", 
  "when": "30-08-2012"
}