{
  "answer_by": null, 
  "answers": [
    {
      "author": "Kenneth Decker", 
      "score": "0", 
      "text": "\n\nIn our area, municipal budgets have been crushed by state budget cuts, falling property assessments and other revenue losses.  We do not have adequate resources for core municipal functions.  The federal government is teetering on insolvency and our state government has a $2b structural deficit.  If you want to tell us something useful, explain where exactly we're going to find the money to comply with the EPA's mandate on TMDLs.\n\n\nIn our area, municipal budgets have been crushed by state budget cuts, falling property assessments and other revenue losses.  We do not have adequate resources for core municipal functions.  The federal government is teetering on insolvency and our state government has a $2b structural deficit.  If you want to tell us something useful, explain where exactly we're going to find the money to comply with the EPA's mandate on TMDLs.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "31-03-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Grant Sparks", 
  "id": 20906, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nStorm water runoff can pollute drinking water, habitats for fish and wildlife, and water recreation areas in local communities and have an adverse affect on the quality of life. Additionally, local governments must comply with U.S. EPA storm water permitting and pollution prevention plans (SWPPPs) that effectively reduce or prevent the discharge of pollutants into receiving waters. ICMA is planning a web conference for local officials on the impacts of storm water runoff pollution and the tools and resources available to help them prevent pollution and comply with EPA regulations. We want to hear from you about the challenges you face, so please let us know.\n\nWhat challenges are you facing in preventing pollution from storm water runoff?  What information/resources would help? \nIf you need assistance complying with EPA storm water permitting and pollution prevention plans, what information/resources would help?\n\n\n", 
  "title": "Managing Storm Water Runoff Pollution", 
  "when": "25-03-2011"
}