{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jill Cornett", 
      "score": "0", 
      "text": "\n\nSavannah, Mo., converted to automated water metering about three years ago. The current system only collects data for billing. We have eliminated the need for manual reading. But Savannah is only 3.5 square miles, so I’m not certain the return on investment has proven beneficial. We have not reduced staff as a result of AMR.\nWe merely have the backbone of a full-blown Automated Metering Infrastructure (AMI). The system has not been built out to take advantage of all of the functions that are possible with AMI, such as making daily readings/usage available to customers through a website.  Customers cannot monitor usage to determine the best methods for cost savings on their bills.\nI believe the City would have been better off investing the money in distribution system improvements. We have spent a great deal  of time and money in the past year repairing water lines as a result of this dry weather. Replacing old lines would actually result in a better ROI than the metering program has.\nJILL\n\n\nSavannah, Mo., converted to automated water metering about three years ago. The current system only collects data for billing. We have eliminated the need for manual reading. But Savannah is only 3.5 square miles, so I’m not certain the return on investment has proven beneficial. We have not reduced staff as a result of AMR.\n\nWe merely have the backbone of a full-blown Automated Metering Infrastructure (AMI). The system has not been built out to take advantage of all of the functions that are possible with AMI, such as making daily readings/usage available to customers through a website.  Customers cannot monitor usage to determine the best methods for cost savings on their bills.\n\nI believe the City would have been better off investing the money in distribution system improvements. We have spent a great deal  of time and money in the past year repairing water lines as a result of this dry weather. Replacing old lines would actually result in a better ROI than the metering program has.\n\nJILL\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-04-2013"
    }, 
    {
      "author": "Michael Van Milligen", 
      "score": "0", 
      "text": "\n\nPaul,\nI do not have all the details here at home, but if you send me an e-mail (ctymgr@cityofdubuque.org) I will put you in touch with our Utility Billing Supervisor Rose Hoerner. We are very happy with our system. We replaced all 22,000 water meters in 2009 - 2010 when we installed the new meter reading system. The system automatically sends hourly reads to the city. We also installed UFR devices that batch low flow leaks, so all water is metered. The system we put in has an internet connection so that customers can observe their own water use. We can also detect leaks and we notify the customers before they know they have a leak. We then pay 50% of the repair to avoid wasted water. We did a pilot program with IBM on water conservation and had pilot households reducing their water use between 4% - 7%. \nMike Van Milligen\n Dubuque, Iowa\n\n\nPaul,\n\nI do not have all the details here at home, but if you send me an e-mail (ctymgr@cityofdubuque.org) I will put you in touch with our Utility Billing Supervisor Rose Hoerner. We are very happy with our system. We replaced all 22,000 water meters in 2009 - 2010 when we installed the new meter reading system. The system automatically sends hourly reads to the city. We also installed UFR devices that batch low flow leaks, so all water is metered. The system we put in has an internet connection so that customers can observe their own water use. We can also detect leaks and we notify the customers before they know they have a leak. We then pay 50% of the repair to avoid wasted water. We did a pilot program with IBM on water conservation and had pilot households reducing their water use between 4% - 7%. \n\nMike Van Milligen\n Dubuque, Iowa\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-04-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Paul Brake", 
  "id": 22519, 
  "score": "0", 
  "tags": [
    "Public Works", 
    "Utilities"
  ], 
  "text": "\n\nI am a city manager of a small city (population 8,200) in southeast Michigan and we are considering different options for water meter reading systems.  We currently use a combination of a touch gun instrument and manually reading water meters.  I am interested in learning about communities who use an automated system, such as a fixed based antenna or radio read system.  For those using such a system, what type of system did you use previously (and what you using now)?  Were water meters replaced as part of the project?  How long ago did you take on this project or how old is the current meter reading system?  Have you experienced any irregularities in the billing or complaints about the system (e.g. inaccurate reads, meters calibrated incorrectly, etc.)?  How often have you had to upgrade the software for the reader system and/or billing program?  Has any of the hardware or software components become obsolete over the life of the system?  Have you experience any problems with your system?\nThanks so much for your time and willingness to share your knowledge about such systems.\nPaul J. Brake\nCity Manager\nCity of Grand Blanc\n\n", 
  "title": "Water Meter Reading Systems", 
  "when": "16-04-2013"
}