{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Amanda,\nAlthough I cannot help you be taking your survey I have provided a link below that is related to the questions on your survey. I hope you find these useful as you continue your research. \n•   Here is a presentation given at the Annual ICMA Conference a few weeks ago by a BigBelly Solar representative. http://webapps.icma.org/conference_Handouts/handouts2013/Sustainable%20Innovations%20presentation.pdf\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nHi Amanda,\nAlthough I cannot help you be taking your survey I have provided a link below that is related to the questions on your survey. I hope you find these useful as you continue your research. \n•   Here is a presentation given at the Annual ICMA Conference a few weeks ago by a BigBelly Solar representative. http://webapps.icma.org/conference_Handouts/handouts2013/Sustainable%20Innovations%20presentation.pdf\nBest, \nRobin Saywitz\nICMA Knowledge Network Intern\nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-10-2013"
    }, 
    {
      "author": "Toby Cotter", 
      "score": "0", 
      "text": "\n\nAmanda - You have developed a very comprehensive survey. I would suggest that you send it directly to Public Works Directors, Engineers and Sanitary professionals. You are requesting information that is very specific and would require a fair amount of time to research. Most CMs will not have the time available to complete the survey.\n\n\nAmanda - You have developed a very comprehensive survey. I would suggest that you send it directly to Public Works Directors, Engineers and Sanitary professionals. You are requesting information that is very specific and would require a fair amount of time to research. Most CMs will not have the time available to complete the survey.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-10-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Amanda Stratton", 
  "id": 22790, 
  "score": "0", 
  "tags": [
    "Hiring", 
    "Infrastructure Planning", 
    "Housing & Community Development", 
    "Water & Sanitation", 
    "Solar Energy", 
    "Finance and Budgeting", 
    "Technology", 
    "Planning", 
    "Police", 
    "Contracts", 
    "Lean Government", 
    "Parks and Recreation", 
    "Sustainability", 
    "Performance Management and Analytics", 
    "Public Works", 
    "Economic Development", 
    "Energy Efficiency"
  ], 
  "text": "\n\nWe are seeking information about pedestrian area trash collection and the effects of different collection methods on municipal productivity. Specifically, we are interested in hearing from municipalities who use traditional trash cans, those who use new technology-based trash cans (especially those who have used BigBelly Solar), and those who have implemented other new collection methods. We would appreciate your help in learning more about this topic by taking an online survey at the link provided below. There is a series of questions that apply to all municipalities who provide pedestrian area trash collection and a more comprehensive set of questions for those who have utilized alternative trash collection technology. It should take you approximately 20-30 minutes to complete the survey.  If you would prefer to talk with us privately about your experience, please feel free to send an Inbox message or send us an email at sherrod1@live.unc.edu . We would be happy to talk over the phone about this subject as well. If you prefer to remain anonymous when answering the questions, that is a possibility. We just ask that you provide a few demographic indicators about your municipality. This information will be used solely for a class project and will not be published. The only people reviewing this work will be select faculty in the University of North Carolina at Chapel Hill’s Master of Public Administration program. \nSurvey Link:\nhttps://unc.az1.qualtrics.com/SE/?SID=SV_6SxQUeRLEcti2Vf\n\n", 
  "title": "Pedestrian Area Trash Collection Methods", 
  "when": "21-10-2013"
}