{
  "answer_by": null, 
  "answers": [
    {
      "author": "Brian Yerges", 
      "score": "0", 
      "text": "\n\nI’m not a CPA but here is how I would summarize it.\nA cost of an enterprise fund not typically included in the operating budget is the depreciation of the fixed assets and infrastructure of the utility.  However, depreciation may be part of the overall budget and depreciation is usually factored into the charges and fees for the utility.  The depreciation is the annual expense associated to using the assets and infrastructure in a given year or period.  If you are budgeting outstanding debt service, then depreciation is usually not included in the budget.  If you are paying cash from net-operating income for fixed assets and infrastructure, then you would include depreciation as a budgeted item for purposes of determining charges and fees.  If assets are being depreciated, at some point you need to have funds to reinvest in the utility.  As a result, depreciation could be budgeted.  Resources for asset investment are debt, cash, or other intergovernmental revenues such as CDBG grants for infrastructure upgrades.  You could either budget the debt service or budget depreciation for the asset.  You can't expense it twice (debt service and depreciation).\n\n\nI’m not a CPA but here is how I would summarize it.\nA cost of an enterprise fund not typically included in the operating budget is the depreciation of the fixed assets and infrastructure of the utility.  However, depreciation may be part of the overall budget and depreciation is usually factored into the charges and fees for the utility.  The depreciation is the annual expense associated to using the assets and infrastructure in a given year or period.  If you are budgeting outstanding debt service, then depreciation is usually not included in the budget.  If you are paying cash from net-operating income for fixed assets and infrastructure, then you would include depreciation as a budgeted item for purposes of determining charges and fees.  If assets are being depreciated, at some point you need to have funds to reinvest in the utility.  As a result, depreciation could be budgeted.  Resources for asset investment are debt, cash, or other intergovernmental revenues such as CDBG grants for infrastructure upgrades.  You could either budget the debt service or budget depreciation for the asset.  You can't expense it twice (debt service and depreciation).\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-03-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Michael Cramer", 
  "id": 21752, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nAs I prepare for the upcoming budget process I have been asked by a council member Why we include depreciation as a budget item in our enterprise funds?   I did not have a good reason to give this councilmember.  Does anyone have a good answer on why you would include the estimated cost of depreciation as an expense item in your operating budget?\n\n", 
  "title": "Depreciation as a Budget Item", 
  "when": "12-03-2012"
}