{
  "answer_by": "18-06-2014", 
  "answers": [
    {
      "author": "Marla Fairley", 
      "score": "0", 
      "text": "\n\nWe use Local Government software to track businesses for business license purposes. You can use this same software to track businesses within your city limits and print a report. If you will be administering your business licenses yourself, you will want to use a software program such as this to track not only the businesses and information but their transactions from year to year.\n\n\nWe use Local Government software to track businesses for business license purposes. You can use this same software to track businesses within your city limits and print a report. If you will be administering your business licenses yourself, you will want to use a software program such as this to track not only the businesses and information but their transactions from year to year.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-06-2014"
    }, 
    {
      "author": "Barbara DeLeon", 
      "score": "0", 
      "text": "\n\nWe utilize our ERP system, Munis, to track business registrations.  During the annual renewal process we perform a clean-up so that we can catch any businesses that may have closed or moved in the prior year.  We work with Codes (which is part of our Police Department) to visit the businesses that have not responded to renewal letters and this helps to verify those that have closed.\n\n\nWe utilize our ERP system, Munis, to track business registrations.  During the annual renewal process we perform a clean-up so that we can catch any businesses that may have closed or moved in the prior year.  We work with Codes (which is part of our Police Department) to visit the businesses that have not responded to renewal letters and this helps to verify those that have closed.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-06-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "Unknown", 
  "id": 23176, 
  "score": "0", 
  "tags": [
    "Innovation", 
    "Economic Development", 
    "Process Improvement", 
    "Technology"
  ], 
  "text": "\n\nOur town is looking to develop and KEEP CURRENT a list of businesses within town limits. Does anyone engage in this now? How do you do it? Is there a streamlined software system you are aware of?\nWe are developing the list via our [soon to be null in NC] privilege license list, police records, and fire records, but still face two main issues of 1) keeping it current (particularly when businesses close), and 2) having a consistent system, or one in which police and fire records (and website self-entry, perhaps) can feed into the same database.\n\n", 
  "title": "Keeping an active list of businesses in town", 
  "when": "10-06-2014"
}