{
  "answer_by": null, 
  "answers": [
    {
      "author": "Patricia Biswanger", 
      "score": "0", 
      "text": "\n\nI'd like to know the answer to that question too.\n\n\nI'd like to know the answer to that question too.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-07-2010"
    }, 
    {
      "author": "Kirk Bednar", 
      "score": "0", 
      "text": "\n\nI may be late with this answer, but I understand from our HR folks that under the new law, plans can benefit from being grandfathered under certain provisions and one of the ways to lose the grandfathering status  is to make significant plan changes that would include increasing premiums for participants.  Again, I don't know all of the details and the grandfathering status may or may not be important to you.\n\n\nI may be late with this answer, but I understand from our HR folks that under the new law, plans can benefit from being grandfathered under certain provisions and one of the ways to lose the grandfathering status  is to make significant plan changes that would include increasing premiums for participants.  Again, I don't know all of the details and the grandfathering status may or may not be important to you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-08-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "John Garvison", 
  "id": 20249, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nHere is my question, my organization is on a fiscal year July 1- June 30th, and our health insurance is on a calendar year with our open enrollment period being in October 1-31. My board is requesting that I increase the employee contribution portion of the premium starting January 1st. I have just finished reading all 964 pages of the new Federal Health Care Reform Act, and I do not see anything in it thta prohibits our District from changing the amount of the employee's premium contribution amount as long as we include it during our open enrollment period.\nDoes anyone else have a different reading of the Health Care Reform Act? I know I have to comply with Flex 125 rules in changing the employee premiums because they are done pre-tax, but I do not see any other potential roadblocks. I am going to run this past the District's attorney's, but was just wondering if anyone has some pointers on something I may have missed prior to my recommendation to our attorney.\nThank you,\n\n", 
  "title": "Question about Employee Health Premium changes", 
  "when": "23-07-2010"
}