{
  "answer_by": null, 
  "answers": [
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nA great question and important topic. Below are a few examples I quickly found of officers dedicated to mental health work, usually in partnership with clinical staff --doctor, nurse, or social worker. They're west coast or Canadian examples. There should be an analysis process for the dedicated resource. How many serious mental health events are there, and how would the enhanced training improve the response? Given the high cost of hospitalization and incarceration, the dedicated resource might pay for itself in prevention with small number of interventions. The same decision making process used to justify SROs, animal control, and crime prevention officers --a significant need requiring distinctive skills and equipment --should be available here.\nCan anyone provide more specific details having used California PERT or a similar specialized team?\nEscondido, CA, and other cities in California using similar model. http://police.escondido.org/pert.aspx\nPortland, OR\nhttp://www.portlandoregon.gov/police/62135\nRide along video: http://www.mentalhealthportland.org/?tag=mobile-crisis-unit\nOttawa, ON\nhttp://www.ottawapolice.ca/en/servingottawa/SectionsAndUnits/MentalHealthUnit.aspx\nhttp://www.cbc.ca/news/canada/ottawa/police-psychiatrist-improve-response-to-mental-health-calls-1.1304220\nDurham, ON\nhttp://www.drps.ca/internet_explorer/our_organization/unit.asp?Scope=Unit&ID=78\nLos Angeles\nhttp://en.wikipedia.org/wiki/Los_Angeles_Police_Department_Mental_Evaluation_Unit\n\n\nA great question and important topic. Below are a few examples I quickly found of officers dedicated to mental health work, usually in partnership with clinical staff --doctor, nurse, or social worker. They're west coast or Canadian examples. There should be an analysis process for the dedicated resource. How many serious mental health events are there, and how would the enhanced training improve the response? Given the high cost of hospitalization and incarceration, the dedicated resource might pay for itself in prevention with small number of interventions. The same decision making process used to justify SROs, animal control, and crime prevention officers --a significant need requiring distinctive skills and equipment --should be available here.\n\nCan anyone provide more specific details having used California PERT or a similar specialized team?\n\nEscondido, CA, and other cities in California using similar model. http://police.escondido.org/pert.aspx\n\nPortland, OR\nhttp://www.portlandoregon.gov/police/62135\nRide along video: http://www.mentalhealthportland.org/?tag=mobile-crisis-unit\n\nOttawa, ON\nhttp://www.ottawapolice.ca/en/servingottawa/SectionsAndUnits/MentalHealthUnit.aspx\nhttp://www.cbc.ca/news/canada/ottawa/police-psychiatrist-improve-response-to-mental-health-calls-1.1304220\n\nDurham, ON\nhttp://www.drps.ca/internet_explorer/our_organization/unit.asp?Scope=Unit&ID=78\n\nLos Angeles\nhttp://en.wikipedia.org/wiki/Los_Angeles_Police_Department_Mental_Evaluation_Unit\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-03-2014"
    }, 
    {
      "author": "Greg Davis", 
      "score": "0", 
      "text": "\n\nI appreciate the links. Very useful information. We responded to over 500 mental health calls last year alone. I would venture to guess over 30 are either high risk or repeat calls for service. It is my hope that full time Crisis officers could conduct follow ups with mental health consumers after they are released from a voluntary committal or an involuntary committal situation. A lot of our calls are repeat calls for service which is straining the patrol officers. By having officers partner with mental health clinicians would produce better outcomes by providing resources and information to consumers and their family. Conducting follow up visits would show support as well and not the typical law enforcement encounter. Thanks again for the info.\n\n\nI appreciate the links. Very useful information. We responded to over 500 mental health calls last year alone. I would venture to guess over 30 are either high risk or repeat calls for service. It is my hope that full time Crisis officers could conduct follow ups with mental health consumers after they are released from a voluntary committal or an involuntary committal situation. A lot of our calls are repeat calls for service which is straining the patrol officers. By having officers partner with mental health clinicians would produce better outcomes by providing resources and information to consumers and their family. Conducting follow up visits would show support as well and not the typical law enforcement encounter. Thanks again for the info.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-03-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "Greg Davis", 
  "id": 23011, 
  "score": "0", 
  "tags": [
    "Police", 
    "Public Safety"
  ], 
  "text": "\n\nWith the growing mental health crisis in America,  is it time to fund officers solely devoted to the task of interacting with mental health consumers? I am a instructor for CIT(Crisis Intervention Team) in our agency. Bias granted.  Many of our officers are trained in CIT that can effectively interact with those in a crisis. However, as we have experienced ourselves, the limited amount of time that they interact with the consumers in a crisis is not sufficient. As is the case with a lot of mental health consumers,  there will be repeat calls for service. The approach that I think would be appropriate would be to have a proactive approach in effectively intervening before a crisis begins or becomes acute. These specialty positions would some times team up with the local Community Service Board and visit with the reoccurring consumers offering community resources, counseling and identifying other family members to aid in the situation. I believe these full time positions would be as necessary as School Resource officers and Crime Prevention officers are now. The growing crisis of those suffering from some form of mental illness is not going away.  There are many returning veterans that have sacrificed so much for our country that are dealing with horrific images and battles that result in PTSD and TBI.  It is the right thing to do to be prepared to offer hope to them and everyone who suffers from mental illness. The stigma of mental illness is prevalent in our society. Those that suffer from illness related to physical health illness are looked at differently.  We respond to them with empathy and concern. As the age of community policing continues this is an area that needs to be addressed. The safety of the consumer, the officer and society must be paramount.\n\n", 
  "title": "Full time Crisis Intervention Police Officers", 
  "when": "05-03-2014"
}