{
  "answer_by": null, 
  "answers": [
    {
      "author": "Leonard Matarese", 
      "score": "0", 
      "text": "\n\nThere are numerous issues to consider regarding take-home plans for police vehicles. The first question you have to answer is why are we doing this? Are we attempting to extend the life of the vehicles by restricting their use to an individual officer? Are we attempting to increase patrol visibility by allowing officers to utilize the vehicles off duty? Is this an approach to provide a benefit to officers in lieu of a pay raise? Do we have numerous callbacks for emergencies where an officer having a vehicle to respond in provides for a better response? Each of these issues has merit but need to be identified before establishing a take-home car policy. Some departments provide take-home vehicles only to command staff members which are unmarked units – others such as the Miami – Dade Police Department provide take-home vehicles to all officers most of which are marked units. \nExtend vehicle life: many departments that have established take-home vehicle policies have reported that the life of the vehicles are extended considerably beyond that which would be expected if the vehicles were in a rotation pool. Officers tend to take better care of the vehicles, keep them cleaner and ensure regular maintenance when they are held responsible for doing so. Although the initial cost of establishing such a program are considerable since many more vehicles are required, departments which have successfully implemented such a program often report that when the costs are amortized over the life the vehicle considerable savings can occur. Thus if this is a primary motivator for the program the more vehicles that are personally assigned, the greater the potential savings can be. \nIncrease patrol visibility: if the goal is to have a higher number of vehicles on city streets then allowing officers to utilize the vehicles off duty helps to accomplish that goal. Cities that have implemented a program to increase visibility allow officers to utilize the vehicle to conduct personal business. Typically the rules governing this use requires the officer to have a police radio on and report that he or she is available to respond to an emergency; be armed; have with them police identifiable clothing (such as a raid jacket) and have their police credentials. The issue here becomes what limitations are there on permitting civilians to ride in the vehicle. Obviously, particularly in a marked unit, there is an inherent danger in riding in a police vehicle. (that's why in citizen ride along programs we get releases). And, if an officer is expected to respond to emergencies while riding in the vehicle this would expose the civilians to additional danger. Another aspect of the visibility issue is to have officers' vehicles particularly marked units, parked at their residences in what some believe provides deterrence to criminal activities in the area. However when officers live outside of the city in another community the visibility issue becomes valuable not to the agency that the officer works for but rather to the community where they live. Again, in South Florida is not unusual to see Miami – Dade police vehicles parked at residences several counties away from the officers jurisdiction. \n(These agencies have policies that provide that officers reimburse the Department for all mileage incurred from the city or County line to and from the officers residents.) \nBenefits in lieu of pay increase: under IRS regulations police officers are exempt from paying taxes on the use of a vehicle off duty if they meet certain regulations (typically those described above). Thus a take-home vehicle can be a significant benefit for an officer particularly if it eliminates the need to own a second vehicle in the family to drive to and from work in. Since cities buy vehicles at fleet cost and purchase fuel and other supplies at reduced cost and tax exempt the issuance of take-home vehicles can be a significant potential “win-win\" situation for the city and the officer. \nOff-duty callbacks: some cities rely heavily on calling officers in off-duty as needed rather than hiring additional personnel. Officers assigned take-home vehicles can respond directly from their home to the patrol zone or to an emergency. Take-home vehicles are typically fully equipped with rifles or shotguns, AED's, flares, and other emergency equipment. This eliminates the need for an officer to respond from their home to the station, transfer gear to the unit, and then respond to the scene. This can be particularly valuable for specialized units such as crime scene, or public safety officers. \nThe assignment of take-home vehicles can be a powerful tool to increase agency performance, reduce cost, improve morale and create a greater public presence. Cities engaging in such a program need to clearly think through the various options before committing to implementation. An integral part of that analysis must include a thorough public discussion of why the city is engaging in the program and what the benefits to the public can be. Needless to say there will be citizens who object to such a program and see this as another government handout to public employees. Successful take-home vehicle programs address those questions up front with a thoughtful analysis and public engagement.\n\n\nThere are numerous issues to consider regarding take-home plans for police vehicles. The first question you have to answer is why are we doing this? Are we attempting to extend the life of the vehicles by restricting their use to an individual officer? Are we attempting to increase patrol visibility by allowing officers to utilize the vehicles off duty? Is this an approach to provide a benefit to officers in lieu of a pay raise? Do we have numerous callbacks for emergencies where an officer having a vehicle to respond in provides for a better response? Each of these issues has merit but need to be identified before establishing a take-home car policy. Some departments provide take-home vehicles only to command staff members which are unmarked units – others such as the Miami – Dade Police Department provide take-home vehicles to all officers most of which are marked units. \n\nExtend vehicle life: many departments that have established take-home vehicle policies have reported that the life of the vehicles are extended considerably beyond that which would be expected if the vehicles were in a rotation pool. Officers tend to take better care of the vehicles, keep them cleaner and ensure regular maintenance when they are held responsible for doing so. Although the initial cost of establishing such a program are considerable since many more vehicles are required, departments which have successfully implemented such a program often report that when the costs are amortized over the life the vehicle considerable savings can occur. Thus if this is a primary motivator for the program the more vehicles that are personally assigned, the greater the potential savings can be. \n\nIncrease patrol visibility: if the goal is to have a higher number of vehicles on city streets then allowing officers to utilize the vehicles off duty helps to accomplish that goal. Cities that have implemented a program to increase visibility allow officers to utilize the vehicle to conduct personal business. Typically the rules governing this use requires the officer to have a police radio on and report that he or she is available to respond to an emergency; be armed; have with them police identifiable clothing (such as a raid jacket) and have their police credentials. The issue here becomes what limitations are there on permitting civilians to ride in the vehicle. Obviously, particularly in a marked unit, there is an inherent danger in riding in a police vehicle. (that's why in citizen ride along programs we get releases). And, if an officer is expected to respond to emergencies while riding in the vehicle this would expose the civilians to additional danger. Another aspect of the visibility issue is to have officers' vehicles particularly marked units, parked at their residences in what some believe provides deterrence to criminal activities in the area. However when officers live outside of the city in another community the visibility issue becomes valuable not to the agency that the officer works for but rather to the community where they live. Again, in South Florida is not unusual to see Miami – Dade police vehicles parked at residences several counties away from the officers jurisdiction. \n(These agencies have policies that provide that officers reimburse the Department for all mileage incurred from the city or County line to and from the officers residents.) \n\nBenefits in lieu of pay increase: under IRS regulations police officers are exempt from paying taxes on the use of a vehicle off duty if they meet certain regulations (typically those described above). Thus a take-home vehicle can be a significant benefit for an officer particularly if it eliminates the need to own a second vehicle in the family to drive to and from work in. Since cities buy vehicles at fleet cost and purchase fuel and other supplies at reduced cost and tax exempt the issuance of take-home vehicles can be a significant potential “win-win\" situation for the city and the officer. \n\nOff-duty callbacks: some cities rely heavily on calling officers in off-duty as needed rather than hiring additional personnel. Officers assigned take-home vehicles can respond directly from their home to the patrol zone or to an emergency. Take-home vehicles are typically fully equipped with rifles or shotguns, AED's, flares, and other emergency equipment. This eliminates the need for an officer to respond from their home to the station, transfer gear to the unit, and then respond to the scene. This can be particularly valuable for specialized units such as crime scene, or public safety officers. \n\nThe assignment of take-home vehicles can be a powerful tool to increase agency performance, reduce cost, improve morale and create a greater public presence. Cities engaging in such a program need to clearly think through the various options before committing to implementation. An integral part of that analysis must include a thorough public discussion of why the city is engaging in the program and what the benefits to the public can be. Needless to say there will be citizens who object to such a program and see this as another government handout to public employees. Successful take-home vehicle programs address those questions up front with a thoughtful analysis and public engagement.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "22-02-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "David Dillner", 
  "id": 22985, 
  "score": "0", 
  "tags": [
    "Employee-Employer Relations", 
    "Fleets", 
    "Police", 
    "Personnel Matters"
  ], 
  "text": "\n\nThis question is for those of you that allow police officers to take their vehicles home. What restrictions do you place on officers for use of public vehicles for personal use? \nWe assign each officer with their own vehicle and one officer drops his children off at school each morning in the it. Would this be allowed or not in your community? \nThe officer is a command position that doesn't work shifts.\nThe City's current policy on personal use of vehicles is as follows:  \"Absent approval from the City Manager, employees may not drive vehicles home if they live more than five miles from the City limits. City vehicles that are driven home by employees may not be used for personal use and may be subject to the IRS regulations governing taxes and benefits.\"\nThoughts? \nThanks for your comments.\n\n", 
  "title": "Personal Use of Police Vehicles", 
  "when": "21-02-2014"
}