{
  "answer_by": null, 
  "answers": [], 
  "answers_count": 0, 
  "author": "Chris Fabian", 
  "id": 22129, 
  "score": "0", 
  "tags": [
    "Innovation", 
    "Leadership", 
    "Lean Government", 
    "Management", 
    "Shared Services", 
    "Strategic Planning", 
    "Finance and Budgeting", 
    "Citizen Engagement"
  ], 
  "text": "\n\n“If I had asked people what they wanted, they would have said faster horses.”\n- Henry Ford\nIn these challenging economic times, we are sometimes under such pressure to find answers, that we don’t have enough time to get the questions right. The invention of the automobile, of course, was the answer to a great question that Ford took the time to understand (and that others never asked).\nBut what are the applications of Ford’s wisdom for today’s local government leaders? How do we get the questions right? And what exactly are the right questions for our time?\nAs this is Priority Based Budgeting Week, we wanted to share with you some of the questions that have driven our mission in the work. And we also want to open the floor to your questions (by way of this blog), so we can help you try and understand exactly what Priority Based Budgeting is all about.\nIn our work, we’ve been entirely engrossed with questions like these:\n▪   What is the role of local government within a community?\n▪   What is local government uniquely qualified to provide, for the maximum benefit to citizens, for the tax dollars they contribute?\n▪   How does local government position itself among all of a community’s service providers, all of a community’s “resources” (public and private sectors, non-profits and volunteers), to achieve “success” in a community (where “success” is the unique definition of that community)?\n▪   How does local government go about allocating scarce resources to achieve the community’s highest priorities? And how, in this challenging era of economic uncertainty, can this be accomplished in a way that is most re can agree on?\nWhat about you, and your community - do you share these questions? What are the most pertinent questions you’re trying to answer?\nWhat questions would you like to see answered through the use of Priority Based Budgeting?\nWhat are your \"if only…\" questions about Priority Based Budgeting (i.e. \"PBB sounds great, if only it would help keep our well-intentioned elected officials out of the weeds\" or \"if only it wouldn't take long to implement\" or \"if only we had performance measures in place already\" - what are your \"if only\" questions?).\nJump in and join the conversation! Please contribute your questions in the comments section of this post, and/or send them directly to Cheryl Hilvert, Director of the Center for Management Strategies at chilvert@icma.org\nWe will be compiling your questions and comments and responding to you on the CMS blog and the CMS Group discussion.\n\n", 
  "title": "Q&A; Forum: Priority Based Budgeting - Do you share these questions?", 
  "when": "05-09-2012"
}