{
  "answer_by": null, 
  "answers": [
    {
      "author": "Israel Murguia", 
      "score": "0", 
      "text": "\n\nHi Marshall,\nWhile I am not with any municipal organization to answer most of your questions, in researching your inquiry, I came across the following website that had some information regarding write-offs and use of collection agencies. In addition there are general practice information along with sample documents. The links is the following: http://www.mrsc.org/subjects/pubworks/utilbill/collect.aspx\nI hope this helps a bit at the very least.\n\n\nHi Marshall,\nWhile I am not with any municipal organization to answer most of your questions, in researching your inquiry, I came across the following website that had some information regarding write-offs and use of collection agencies. In addition there are general practice information along with sample documents. The links is the following: http://www.mrsc.org/subjects/pubworks/utilbill/collect.aspx\nI hope this helps a bit at the very least.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-03-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Marshall Lewis", 
  "id": 20873, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nChesterfield County, Virginia is reviewing the many Accounts Receivable policies used by departments within our organization in order to create a new County-wide policy. Our goal is to improve consistency in collections practices for our customers, as well as ourselves, and increase funds collected. We are not looking for responses related to taxes. We appreciate you taking the time to answer the following questions about receivables and collections in your organization. Thank You!\n\nAre your collection efforts centralized? \nIf so, who is responsible for collection?\nDo you use a third party collection vendor? \nIf so, what vendor do you use? At what point do you turn receivables over to the third party? Who pays the third party fee?\nDo you handle collections differently based on the amount you are owed?\nIf so, what thresholds do you use?\nDo you have any collection techniques/tips that have increased the amount of money collected or made payment more timely?\nDo you have Accounts Receivable policies? \nIf so, can you share them? \nDo you litigate? \nIf so, for what types of receivables?\nHow do you determine your write-offs?\nMay we contact you for additional information? If so, please provide your contact information.\n\nCourtney Farrell\nAccounting Department\nChesterfield, VA 23832\n(804) 748-1233 phone\nfarrellc@chesterfield.gov\n\n", 
  "title": "Accounts Receivable and Debt Collection Practices", 
  "when": "14-03-2011"
}