{
  "answer_by": "25-03-2014", 
  "answers": [
    {
      "author": "Rodney Proffitt", 
      "score": "0", 
      "text": "\n\nAudree; all the items you mention are related to fiscal and physical concerns. I would suggest you consider the comprehensive plAn's map of future land uses as your first and most important factor in considering a zoning change, second would be the various limitations you mention, and the final factor is neighborhood input and most especially neighbors in close proximity that would be particularly impacted by the change.\n\n\nAudree; all the items you mention are related to fiscal and physical concerns. I would suggest you consider the comprehensive plAn's map of future land uses as your first and most important factor in considering a zoning change, second would be the various limitations you mention, and the final factor is neighborhood input and most especially neighbors in close proximity that would be particularly impacted by the change.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-03-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Audree Juhlin", 
  "id": 23020, 
  "score": "0", 
  "tags": [
    "Human Resources", 
    "Housing & Community Development", 
    "Planning", 
    "Process Improvement"
  ], 
  "text": "\n\nThe City of Sedona is currently evaluating its Planning & Zoning process when considering discretionary land use applications such as a zone change request.   \nHistorically the City evaluates discretionary applications in context with community benefits offered with the proposal such as undergrounding utility lines, constructing sidewalks, roadways, parks, trailheads, trails, etc.  As we evaluate this process we are looking at how other communities review discretionary application proposals and if community benefits are part of the approval consideration, and, if so, how this is accomplished - do you have a policy, guidelines, regulations, etc.?\nYour help is greatly appreciated!\nAudree Juhlin, Interim Director\nCommunity & Economic Development\nCity of Sedona\n(928) 204-7107\najuhlin@sedonaaz.gov\n\n", 
  "title": "Zoning Requests & Community Benefits", 
  "when": "11-03-2014"
}