{
  "answer_by": null, 
  "answers": [
    {
      "author": "Caitlyn Mitchell", 
      "score": "0", 
      "text": "\n\nThe best match that fits your description that I could find is a computer lab in Villa Parke, CA. The lab is minimally staffed, but provides access to all users with either a library card or a valid photo I.D. for out of town visitors. The lab is located across the street from the main library, and runs the same hours and restrictions, but since it has its own staff, the library staff is free to continue their normal duties. Computer time is limited to two, 30-minute blocks, and is run on a first come, first serve basis. The computer lab is part of the community center, so I would imagine that it is costs are deducted from the community center's budget, but the website does not specifically state where its funding comes from. For more information please check out :\nhttp://ww2.cityofpasadena.net/library/VillaparkeLab.asp\nHope it helps!\n\n\nThe best match that fits your description that I could find is a computer lab in Villa Parke, CA. The lab is minimally staffed, but provides access to all users with either a library card or a valid photo I.D. for out of town visitors. The lab is located across the street from the main library, and runs the same hours and restrictions, but since it has its own staff, the library staff is free to continue their normal duties. Computer time is limited to two, 30-minute blocks, and is run on a first come, first serve basis. The computer lab is part of the community center, so I would imagine that it is costs are deducted from the community center's budget, but the website does not specifically state where its funding comes from. For more information please check out :\nhttp://ww2.cityofpasadena.net/library/VillaparkeLab.asp\n\nHope it helps!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-03-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Deborah Hoffman", 
  "id": 20834, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nOur Library has increasing demand for computer use by travellers, by those without internet access at home and by those needing to apply on-line for jobs.  To free time of Library staff, has any other government chosen to use public kiosks in or outside the Library building? If so, what is the cost, who maintains the kiosks? Does the Library still provide computers for longer term use such as 30 to 60 minutes for study or projects? Has it helped Library staff to remove responsibility for computer needs?\n\n", 
  "title": "Public Kiosks at the Library", 
  "when": "28-02-2011"
}