{
  "answer_by": null, 
  "answers": [], 
  "answers_count": 0, 
  "author": "Pamela Muse", 
  "id": 22464, 
  "score": "0", 
  "tags": [
    "Public Schools", 
    "Public Safety"
  ], 
  "text": "\n\nThe Alliance for Innovation & iXP Corp California Workshop:\nWhat is Intelligent Video Surveillance (IVS)?  It's the utilization of state-of-the-industry behavioral recognition functionality that proactively monitors real-time video feeds from multiple cameras on a 24/7/365 basis.  The behavioral actions are considered by the intelligence functionality regarding human(s) and/or object(s) and their movement(s), or non-movement(s), under specific circumstances and advise designated personnel when the IVS system detects suspicious activity.  After a video alert review by public safety and/or security personnel, a decision is made by them whether or not to dispatch public safety resources to the scene\nWhen considering an IVS solution within local government, contemplate the positive primary results already experienced by others.  They include:\nCrime Reduction\nReputation Enhancement - A byproduct of Crime Reduction\nForce Multiplier For Patrol - Many more \"eyes\" looking for potential problems via \"virtual policing\"\nCost Effective with No Long-term Unfunded Overhang\nCan be implemented in phases as funds allow\n911 Center Consolidation/Managed Services\nThis portion of the workshop will focus upon 911 centers and the potential opportunities for service improvement while realizing cost savings for local government.  We will explore 911 center physical co-location, virtual co-location, consolidation and 911 center operations as a managed service.\nThursday, April 4, 2013\n2pm - 4pm\nMunicipal Gallery\nCity Hall, 2nd Floor\n455 N. Rexford Drive\nBeverly Hills, CA 90210\nFREE Registration\nTo Register: contact Pamela Muse, Alliance Western Regional Director at 888-468-6450 or pmuse@transformgov.org.\n\n", 
  "title": "Intelligent Video Surveillance Workshop", 
  "when": "08-03-2013"
}