{
  "answer_by": null, 
  "answers": [
    {
      "author": "Mark Abeles-Allison", 
      "score": "0", 
      "text": "\n\nRelocation assistance can be a component of employment agreements when negotiating a new contract.  Depending on distance of travel the amount will vary significantly in each situation.  It may be easier on a case by case basis.\n\n\nRelocation assistance can be a component of employment agreements when negotiating a new contract.  Depending on distance of travel the amount will vary significantly in each situation.  It may be easier on a case by case basis.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-05-2012"
    }, 
    {
      "author": "J. Sellers", 
      "score": "0", 
      "text": "\n\nI believe this question has more to do with relocation companies that buy/sell homes for members.  I have felt for awhile that this would be a great benefit for all ICMA members, as I am also paying a second mortgage on a house that I have not been able to sell for over a year.\n\n\nI believe this question has more to do with relocation companies that buy/sell homes for members.  I have felt for awhile that this would be a great benefit for all ICMA members, as I am also paying a second mortgage on a house that I have not been able to sell for over a year.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-05-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "[Anonymous]", 
  "id": 21878, 
  "score": "0", 
  "tags": [
    "Human Resources", 
    "Housing & Community Development", 
    "Career Resources"
  ], 
  "text": "\n\nDoes/can ICMA offer relocation assistance for its members?  With an average tenure of around five years, we are constantly moving around the country and buying/selling homes.  Now that the housing market is virtually non-existent, many of us have been left holding an unbelievable amount of mortgage debt not being able to sell our homes.  Many of our counterparts in the private sector are offered relocation assistance through their employers.  I would like ICMA to offer this service, and to have my city pay for this as part of my contract.  Is this possible?  What are your thoughts?\n\n", 
  "title": "City Manager Relocation Assistance", 
  "when": "07-05-2012"
}