{
  "answer_by": null, 
  "answers": [
    {
      "author": "Barbara DeLeon", 
      "score": "0", 
      "text": "\n\nOur most recent 5-year strategic plan development was structured so that we kicked off with a review of the previous plan results, then evaluated our mission and guiding principles, followed with an organizational SWOT analysis and then drafted the broad, policy-level goals which would govern the plan.  The mayor, council, and upper management participated in the planning retreat where the SWOT was completed.  From the SWOT analysis we came up with four main themes for the plan:  fiscal responsibility, service delivery excellence, infrastructure development and quality of life.  The mayor/council then developed 25 policy level goals for the four themes which the departments then took and drafted 119 next level objectives and finally 426 tasks/projects.  So, the plan cascaded nicely from the initial SWOT analysis.  The attached overview shows the framework for our strategic plan, and if you like I can send more information.  The entire process took about six months.\n\n\nOur most recent 5-year strategic plan development was structured so that we kicked off with a review of the previous plan results, then evaluated our mission and guiding principles, followed with an organizational SWOT analysis and then drafted the broad, policy-level goals which would govern the plan.  The mayor, council, and upper management participated in the planning retreat where the SWOT was completed.  From the SWOT analysis we came up with four main themes for the plan:  fiscal responsibility, service delivery excellence, infrastructure development and quality of life.  The mayor/council then developed 25 policy level goals for the four themes which the departments then took and drafted 119 next level objectives and finally 426 tasks/projects.  So, the plan cascaded nicely from the initial SWOT analysis.  The attached overview shows the framework for our strategic plan, and if you like I can send more information.  The entire process took about six months.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "25-08-2014"
    }, 
    {
      "author": "Laura Karpaviciute", 
      "score": "0", 
      "text": "\n\nBarbara, thank you for sharing your experience!\n\n\nBarbara, thank you for sharing your experience!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "03-09-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "Laura Karpaviciute", 
  "id": 23290, 
  "score": "0", 
  "tags": [
    "Performance Management and Analytics", 
    "Strategic Planning", 
    "Process Improvement", 
    "Environment", 
    "Organizational Development"
  ], 
  "text": "\n\nAs part of our annual strategic planning process, our departments conduct a comprehensive environmental scan.  This scan information is then used by staff in all departments to identify strengths, weaknesses, opportunities and threats (SWOTs) for each of our five strategic goals.  \nWe’d like to learn how you employ SWOT analysis in your strategic planning.  Specifically, do you conduct SWOT for each strategic goal or for the organization as a whole and how well does it work for your organization?  What are the advantages and disadvantages of such approach?  Also, do you have any easy-to-use tools that could help staff at any level of the organization with “translating” the environmental scan information into SWOTs?\n\n", 
  "title": "SWOT analysis", 
  "when": "22-08-2014"
}