{
  "answer_by": "24-08-2014", 
  "answers": [
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nI'm not a veteran, but I've worked with and helped to recruit many.\nVirginia has an excellent resource in its Virginia Values Veterans (V3) program, helping employers to focus on these questions. The staff there could be very helpful for you. City of Norfolk is a state leaders in veterans employment, so you might look there. http://www.dvsv3.com/\nIn recruiting, I've seen a few specific issues. Credentials may not transfer easily, so a vet with skills driving a truck or working water treatment equipment may be delaying by testing. I have also seen a few resumes that did not describe the relevant skills learned in the military. Interviewing skills of the \"Yes, sir\" variety may also be inadequate.  A little coaching goes a long way with both of those.\nCultural fit can be a general problem in some organizations, but it varies widely. I've seen it vary at the department or division level. Some supervisors understand the issues better or are veterans themselves.\nGreat project. Good luck!\n\n\nI'm not a veteran, but I've worked with and helped to recruit many.\n\nVirginia has an excellent resource in its Virginia Values Veterans (V3) program, helping employers to focus on these questions. The staff there could be very helpful for you. City of Norfolk is a state leaders in veterans employment, so you might look there. http://www.dvsv3.com/\n\nIn recruiting, I've seen a few specific issues. Credentials may not transfer easily, so a vet with skills driving a truck or working water treatment equipment may be delaying by testing. I have also seen a few resumes that did not describe the relevant skills learned in the military. Interviewing skills of the \"Yes, sir\" variety may also be inadequate.  A little coaching goes a long way with both of those.\n\nCultural fit can be a general problem in some organizations, but it varies widely. I've seen it vary at the department or division level. Some supervisors understand the issues better or are veterans themselves.\n\nGreat project. Good luck!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-08-2014"
    }, 
    {
      "author": "Erik Thompson", 
      "score": "0", 
      "text": "\n\nWilliam,\nI am also a veteran of Iraq, as well as Afghanistan.  I served as an Infantryman with 10th Mountain Division.  I am working on a similar project for my Capstone this Fall as well.  If you are interested in sharing ideas, research, statistics, etc. please feel free to contact me via email ethomp7@live.spcollege.edu.\nI think that Mr. Reges brought up a very good point in that certifications do not always transfer over.  I also think this leads into a lack of understanding of military experience and occupational specialties by civilian human resource personnel and a lacking by veterans on how to fully explain what we did to those individuals.  \nThank you for your time.  Please feel free to contact me.\nErik\n\n\nWilliam,\n\nI am also a veteran of Iraq, as well as Afghanistan.  I served as an Infantryman with 10th Mountain Division.  I am working on a similar project for my Capstone this Fall as well.  If you are interested in sharing ideas, research, statistics, etc. please feel free to contact me via email ethomp7@live.spcollege.edu.\n\nI think that Mr. Reges brought up a very good point in that certifications do not always transfer over.  I also think this leads into a lack of understanding of military experience and occupational specialties by civilian human resource personnel and a lacking by veterans on how to fully explain what we did to those individuals.  \n\nThank you for your time.  Please feel free to contact me.\n\nErik\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "24-08-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "William Doerfer", 
  "id": 23254, 
  "score": "0", 
  "tags": [
    "Strategic Planning", 
    "Management", 
    "Form of Government", 
    "Next Generation of Managers", 
    "Organizational Development"
  ], 
  "text": "\n\nDear fellow veterans.  I am an Iraq War veteran with the 82nd Airborne Division. I will be graduating with my MPA from Appalachian State University in December. As many of you know, MPA programs require a Capstone independent research project. Part of my Capstone project is to determine what is being done to assist veterans find jobs in local government. Obviously, ICMA has taken up the cause to employ veterans in local government administration, and I will incorporate an analysis of this website into my research. What I would like from you all is to help me identify veteran specific issues that may be impeding employment in the local government setting. If you could, please identify any issues you have seen or encountered in transitioning from military service to local government administration. Any and all assistance will be appreciated. Hopefully my research will benefit many veterans and future local government administrators.\n\n", 
  "title": "Veteran Specific Issues", 
  "when": "04-08-2014"
}