{
  "answer_by": null, 
  "answers": [
    {
      "author": "Robert Carty", 
      "score": "1", 
      "text": "\n\nThat's a great question, and as the world gets more global we're going to see more people crossing borders. I know that it can be easy to move around some of the Commonwealth countries (for example the UK, Canada, Australia and New Zealand). We had a Polish national get a Fellowship (icma.org/lgmf) in California, but he earned his degree in a U.S. program so the visa was a non-issue. He didn't stay there when his Fellowship ended, but I believe he did try. The foreign national issue could have been a problem.\nIn economic conditions where many U.S. local governments are at best not hiring at all, and still laying off employees at worst, I can say that it will be a rough road. But that isn't to say you shouldn't try. A work visa would likely be the first hurdle, or finding someone to sponsor a visa. An academic fellowship, internship or exchange program would probably be the easier route.\n\n\nThat's a great question, and as the world gets more global we're going to see more people crossing borders. I know that it can be easy to move around some of the Commonwealth countries (for example the UK, Canada, Australia and New Zealand). We had a Polish national get a Fellowship (icma.org/lgmf) in California, but he earned his degree in a U.S. program so the visa was a non-issue. He didn't stay there when his Fellowship ended, but I believe he did try. The foreign national issue could have been a problem.\n\nIn economic conditions where many U.S. local governments are at best not hiring at all, and still laying off employees at worst, I can say that it will be a rough road. But that isn't to say you shouldn't try. A work visa would likely be the first hurdle, or finding someone to sponsor a visa. An academic fellowship, internship or exchange program would probably be the easier route.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "02-04-2012"
    }, 
    {
      "author": "Rafal Hejne", 
      "score": "0", 
      "text": "\n\nStefano, it is pretty much the way Rob has described it. I know it well as I am the person he was referring to. I don’t think it would be easy for you to find a job if you required a sponsorship, even if you did MPA in the US you would most likely find it challenging. But if you have a legal right to work in the US (a pre-arranged employee sponsorship or you are married to a US citizen) it shouldn’t be a problem at all. I would agree with you some general knowledge could be transferred between countries. Things you don’t know you would quickly pick up (especially if you did MPA). In addition, you will offer to a local authority an interesting perspective of an outsider which I believe is very valuable. \nI hope this helps. Let me know if you have any other questions.\n\n\nStefano, it is pretty much the way Rob has described it. I know it well as I am the person he was referring to. I don’t think it would be easy for you to find a job if you required a sponsorship, even if you did MPA in the US you would most likely find it challenging. But if you have a legal right to work in the US (a pre-arranged employee sponsorship or you are married to a US citizen) it shouldn’t be a problem at all. I would agree with you some general knowledge could be transferred between countries. Things you don’t know you would quickly pick up (especially if you did MPA). In addition, you will offer to a local authority an interesting perspective of an outsider which I believe is very valuable. \nI hope this helps. Let me know if you have any other questions.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-04-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Stefano Tripi", 
  "id": 21791, 
  "score": "0", 
  "tags": [
    "Career Resources"
  ], 
  "text": "\n\nI am an Italian ICMA member, working through progressive administrative and management responsibilities in Italian local government, and researching (in a Ph.D. course) on international local management topics after relevant Public Policy, Public Management and Accounting studies. I acquired significant experience in strategic budgeting and planning; management of  public projects in different policy areas; human, financial, ICT resource management; and, most important, I consider myself a great team player, with a strong interest in new experiences and different environments.\nWhat I would like to ask is: do you think it is possible for foreign local government officers/managers to begin a career in USA local government? I think that, apart from country-specific issues, management skills and requirements are the same in all countries. Do you know of any specific case? What would you suggest for a young professional thinking about this idea (i.e. attending another MPA in the States)?\nThanks in advance for your time. \nKindest regards, \nStefano\n\n", 
  "title": "USA local government careers for foreign local government officers?", 
  "when": "30-03-2012"
}