{
  "answer_by": null, 
  "answers": [
    {
      "author": "Lawrence Di Re", 
      "score": "0", 
      "text": "\n\nJim,\nThe ICMA publication Managing Local Government Services: A Practical Guide has a very good treatment of public works in chapter 9.  That chapter's author is named Cathy R. Lazarus.  She may be able to assist you more directly.  Pages 419-420 are an extensive list of web sources and ICMA publications that should be helpful.  I have to admit that is a pretty specialized course for MPA students, let alone undergrads.  If you have the ability to design the course curriculum you might also consider capital projects planning and budgeting, facilities management and even parks and rec to broaden the scope some and provide a larger context.  I address some of this in my State and Local Government class and Principles and Practices of Urban Planning class at Elmhurst College.  Please feel free to email me at direl@net.elmhurst.edu for more specifics.  Hope this helps.\n\n\nJim,\nThe ICMA publication Managing Local Government Services: A Practical Guide has a very good treatment of public works in chapter 9.  That chapter's author is named Cathy R. Lazarus.  She may be able to assist you more directly.  Pages 419-420 are an extensive list of web sources and ICMA publications that should be helpful.  I have to admit that is a pretty specialized course for MPA students, let alone undergrads.  If you have the ability to design the course curriculum you might also consider capital projects planning and budgeting, facilities management and even parks and rec to broaden the scope some and provide a larger context.  I address some of this in my State and Local Government class and Principles and Practices of Urban Planning class at Elmhurst College.  Please feel free to email me at direl@net.elmhurst.edu for more specifics.  Hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-10-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "James Hough", 
  "id": 21402, 
  "score": "0", 
  "tags": [
    "Public Works", 
    "Town and Gown"
  ], 
  "text": "\n\nI am a City Manager who is also an Adjunct Prof. who has taught Public Budgeting for a few years, but am now being shifted (at my request) to create a course that has been in the catalog for a number of years but not taught.  The Course is PA515 Public Works Administration and the caltlog entry reads \"A general overview of administrative practices in public works, including an evaluation of organizational practices, project management, and relationships to political processes. The course will consider actual problems in the administration of public works.\"\nIs there anyone who has taught this or a similar Public Works class who could send me a syllabus and a recommended textbook?  I was told that APWA has a good text but I cannot find it in the APWA bookstore.  Any assistance or advice would be gratly appreciated.\nJim Hough, ICMA-CM, City Manager / Public Works Director\n\n", 
  "title": "Adjunct Prof. needs Public Works Administration Course Syllabus and Textbook Advice", 
  "when": "06-10-2011"
}