{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nSEO is not yet mature enough within the economic development and site selection fields to be worth buying or paying to use.  Using Google or similar search as one p[art of a multi-part economic development marketing strategy is OK but it should not be the primary tool.  Site selectors as a profession have become very adept at incorporating web based resources but they still ultimately make decisions on face to face conversations and visits.  What can be a very good use of search engines such as Google is for you to do a search of the community as if you are a site selector to see what pops up because in current ever advancing world of technology in many cases site selectors will know more about the community than those who live and work there.  Such a search serves both to have you prepared by knowing ahead of time what the site selectors know so that you do not say or present anthing that they have found online and also will allow you to be prepared to address any misinformation that may be online.  I hope this helps.\n\n\nSEO is not yet mature enough within the economic development and site selection fields to be worth buying or paying to use.  Using Google or similar search as one p[art of a multi-part economic development marketing strategy is OK but it should not be the primary tool.  Site selectors as a profession have become very adept at incorporating web based resources but they still ultimately make decisions on face to face conversations and visits.  What can be a very good use of search engines such as Google is for you to do a search of the community as if you are a site selector to see what pops up because in current ever advancing world of technology in many cases site selectors will know more about the community than those who live and work there.  Such a search serves both to have you prepared by knowing ahead of time what the site selectors know so that you do not say or present anthing that they have found online and also will allow you to be prepared to address any misinformation that may be online.  I hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "05-10-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Tony Mazzucco", 
  "id": 22197, 
  "score": "0", 
  "tags": [
    "Technology", 
    "Economic Development"
  ], 
  "text": "\n\nGood Morning,\nWe are looking into utilizing a Google ad word campaign for marketing economic development opportunities in our town after an upcoming launch of a newly designed website as well as doing search engine optimization for the same.\n\nHas anyone done a Google ad word campaign and if so what did you spend/budget?\nAny impressions on the effectiveness of utilizing Google ad campaign for economic development (site selection in particular, but development in general)\nHas any community paid (rough amount) for any kind of SEO (search engine optimization) Services and what has the result been?\n\nYou can reply on the KN or email me at tmazzucco@town.milton.vt.us\nThanks!\n\n", 
  "title": "Using Google ad search for economic development/Search Engine Optimization", 
  "when": "03-10-2012"
}