{
  "answer_by": null, 
  "answers": [
    {
      "author": "Eric Johnson", 
      "score": "0", 
      "text": "\n\nI have served on the State and Local Advisory Council to the Streamlined Sales Tax Project as a representative of GFOA. First, the best local government contact for someone whose state has adopted the conforming legislation involved in the SSTP is Mike Bailey of Redmond, Washington. Mike sits on the SLAC Steering Committee. He can be reached at MEBAILEY@redmond.gov\nStates actually drove the SSTP, not locals. Locals are involved to ensure that states don't ignore the concept of home rule and negotiate away our local option taxes. The states have facilitated local representation by four groups -- the Government Finance Officers Association, NACO, NLC, and the US Conference of Mayors each receive three votes on the State and Local Advisory Council. States participate on the SLAC whether they have adopted the conforming legislation necessary to join the SSTP or not.\nInformation on the Project is available at their web site: http://www.streamlinedsalestax.org/\nAn act of Congress has been in the works without success but has become complicated by attempts to include streamlining of telecom taxation. That, of course, is of great concern to local governments. Business interests want telecom included to gain their support in Congress.\nAlternately, since U.S. Supreme Court rulings started this prohibition on the collection of our taxes by out-of-state vendors, and technology has made it feasible to facilitate such collection, a Court case could remedy the issue -- at least for those states that implement the streamlining necessary to facilitate collection.\nStates in compliance with the SSTP are collecting revenue through voluntary compliance by vendors interested in tax amnesty, but the last time I checked, the dollar amount was quite small in comparison with what isn't being collected.\nSome states have taken into their own hands alternate approaches and there have been several attempts to go after Amazon.com. \nThe estimates of the impact of lost collections comes from William Fox at the University of Tennessee. Here is a link for information on uncollected taxes: http://cber.utk.edu/ecomm.htm\n\n\nI have served on the State and Local Advisory Council to the Streamlined Sales Tax Project as a representative of GFOA. First, the best local government contact for someone whose state has adopted the conforming legislation involved in the SSTP is Mike Bailey of Redmond, Washington. Mike sits on the SLAC Steering Committee. He can be reached at MEBAILEY@redmond.gov\n\nStates actually drove the SSTP, not locals. Locals are involved to ensure that states don't ignore the concept of home rule and negotiate away our local option taxes. The states have facilitated local representation by four groups -- the Government Finance Officers Association, NACO, NLC, and the US Conference of Mayors each receive three votes on the State and Local Advisory Council. States participate on the SLAC whether they have adopted the conforming legislation necessary to join the SSTP or not.\n\nInformation on the Project is available at their web site: http://www.streamlinedsalestax.org/\n\nAn act of Congress has been in the works without success but has become complicated by attempts to include streamlining of telecom taxation. That, of course, is of great concern to local governments. Business interests want telecom included to gain their support in Congress.\n\nAlternately, since U.S. Supreme Court rulings started this prohibition on the collection of our taxes by out-of-state vendors, and technology has made it feasible to facilitate such collection, a Court case could remedy the issue -- at least for those states that implement the streamlining necessary to facilitate collection.\n\nStates in compliance with the SSTP are collecting revenue through voluntary compliance by vendors interested in tax amnesty, but the last time I checked, the dollar amount was quite small in comparison with what isn't being collected.\n\nSome states have taken into their own hands alternate approaches and there have been several attempts to go after Amazon.com. \n\nThe estimates of the impact of lost collections comes from William Fox at the University of Tennessee. Here is a link for information on uncollected taxes: http://cber.utk.edu/ecomm.htm\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-07-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Pamela Muse", 
  "id": 21185, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting"
  ], 
  "text": "\n\nAn AZ member is interested in learning more about states that have adopted the streamlined sales tax and use agreement. This is geared toward simplifying tax codes and making it easier for online retailers to collect taxes. Through the adoption of this agreement some states have apparently been able to get some online retailers to voluntarily agree to pay sales taxes, however it is our understanding that it would take an act of Congress to actually mandate the collection of these taxes.   \nHas your state adopted the streamlined sales tax and use agreement?  If so, do you know how it impacted cities and towns, who were the drivers behind the push to adopt the agreement, and what political and logistical issues were a part of the decision to move forward and what have the implementation challenges been.\nAny help you can provide is appreciated!\nPamela Muse\nWestern Regional Director\nAlliance for Innovation\n888-468-6450 Voice\n480-231-3538 Text\npmuse@transformgov.org\n\n", 
  "title": "Streamlined Sale Tax & Use Agreement", 
  "when": "05-07-2011"
}