{
  "answer_by": null, 
  "answers": [
    {
      "author": "Pam Broviak", 
      "score": "0", 
      "text": "\n\nLast time I checked into the capabilities of FB, there was no easy method of archiving the page for open records purposes. There are also some other challenges with using FB as a city agency. So I believe some cities do not set up official pages.  The two \"city\" pages I am involved with are not official pages although they may appear to be. Instead we use community volunteers to establish and manage the page. So I am wondering if some you are viewing are sites set up for a city, yet not officially \"owned\" by the city.\nFor those interested in having an official site, it would be nice to have some guidance document on suggested policies for the use of FB by local govt. Particularly one that covers the issues you mention. Then the other questions regarding the archiving and legal concerns could also be addressed.\n\n\nLast time I checked into the capabilities of FB, there was no easy method of archiving the page for open records purposes. There are also some other challenges with using FB as a city agency. So I believe some cities do not set up official pages.  The two \"city\" pages I am involved with are not official pages although they may appear to be. Instead we use community volunteers to establish and manage the page. So I am wondering if some you are viewing are sites set up for a city, yet not officially \"owned\" by the city.\n\nFor those interested in having an official site, it would be nice to have some guidance document on suggested policies for the use of FB by local govt. Particularly one that covers the issues you mention. Then the other questions regarding the archiving and legal concerns could also be addressed.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "23-06-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Toni Messina", 
  "id": 21139, 
  "score": "0", 
  "tags": [
    "Social Media"
  ], 
  "text": "\n\nAm I out of touch here?  As I browse city agency Facebook pages, I don't see consistent use of the city logo, or a note saying that an agency is a City of (whatever) agency, or consistent links back to the city websites...or consistent \"likes\" among related city agencies and, more surprising, very few disclaimers about open records status or that offensive material will be deleted.  Unfortunately, this happens here, too.  Are we all trying to catch up with this type of policy, or are folks just choosing not to be concerned?  Thanks for any thoughts.\n\n", 
  "title": "Facebook disclaimers and identification", 
  "when": "20-06-2011"
}