{
  "answer_by": null, 
  "answers": [
    {
      "author": "Stephen Driscoll", 
      "score": "3", 
      "text": "\n\nThe Brownfields topics is complex, highly technical, and expansive. A discussion on a \"starter kit\" to begin the conversation between a local government entity and a private enterprise with brownfields issues would be helpful.\nExample: How to engage a national railway system to work with a city on rehabilitating a section of land for future economic development.\n\n\nThe Brownfields topics is complex, highly technical, and expansive. A discussion on a \"starter kit\" to begin the conversation between a local government entity and a private enterprise with brownfields issues would be helpful.\n\nExample: How to engage a national railway system to work with a city on rehabilitating a section of land for future economic development.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-07-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Grant Sparks", 
  "id": 22037, 
  "score": "0", 
  "tags": [
    "Emergencies & Disasters", 
    "Infrastructure Planning", 
    "Housing & Community Development", 
    "Healthy Living", 
    "Water & Sanitation", 
    "Climate Change", 
    "Solar Energy", 
    "Legal Issues", 
    "Career Resources", 
    "Citizen Engagement", 
    "Economic Development", 
    "Brownfields", 
    "Public Works", 
    "Risk Management", 
    "Sustainability", 
    "Utilities", 
    "Planning", 
    "Railroads, Ports, Airports", 
    "GIS", 
    "Military Base Reuse"
  ], 
  "text": "\n\nThe technical program of the ICMA and U.S. EPA cosponsored National Brownfields Conference is the premier forum for learning about and sharing experiences for effectively assessing, cleaning up and redeveloping properties that are abandoned, underutilized or contaminated (also known as brownfields). In today's economy local governments are forced to do more with less, yet many public officials fail to see the economic potential of turning these liabilities into community assets.\nOver the years the National Brownfields Conference has grown to a 5,000+ attendee event that focuses more broadly on creating sustainable communities. On May 15-17, 2013 the 2013 National Brownfields Conference will convene in Atlanta, Georgia and I was wondering what session topics you would like to see presented? Here's a short list of what's been covered in years past:\n\nCommunity Engagement\nEconomic Development\nGreen Building\nSmart Growth\nCommunity Planning\nEnvironmental Justice\nLaw and Liability Issues\nInsurance Issues\nPublic Health\nGreen Technology and Emerging Solutions\n\nIf you have a session proposal of your own, please feel free to submit an idea via the conference website -- www.brownfieldsconference.org. Or, if you have any questions, please feel free to contact me, Grant Sparks, at gsparks@icma.org\n\n", 
  "title": "What session topics would attract you to the ICMA cosponsored 2013 National Brownfields Conference?", 
  "when": "18-07-2012"
}