{
  "answer_by": null, 
  "answers": [
    {
      "author": "John Duffy", 
      "score": "0", 
      "text": "\n\nThe need to build resilience and adaptive capacity within our communities and urban centers as a means of responding to the challenges of climate change are very important concepts to share.  As climate change progresses, we need to mitigate the negative impacts as well as develop new approaches that incorporate climate change thinking into our planning, capital investments, and building codes/zoning. There are many examples of communities in the US that have made great progress in these areas.  The American Planning Association’s recent Sustaining Places report provides an excellent summary of urban centers that have made such progress though better community planning.  Also, the article: “Climate change and environmental planning: Working to build community resilience and adaptive capacity in Washington State, USA” by Saavedra  and Budd in Habitat International (2009) provides a good description of King County’s efforts.\n\n\nThe need to build resilience and adaptive capacity within our communities and urban centers as a means of responding to the challenges of climate change are very important concepts to share.  As climate change progresses, we need to mitigate the negative impacts as well as develop new approaches that incorporate climate change thinking into our planning, capital investments, and building codes/zoning. There are many examples of communities in the US that have made great progress in these areas.  The American Planning Association’s recent Sustaining Places report provides an excellent summary of urban centers that have made such progress though better community planning.  Also, the article: “Climate change and environmental planning: Working to build community resilience and adaptive capacity in Washington State, USA” by Saavedra  and Budd in Habitat International (2009) provides a good description of King County’s efforts.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "09-05-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Laura Hagg", 
  "id": 21879, 
  "score": "0", 
  "tags": [
    "Water & Sanitation", 
    "Food Security", 
    "Climate Change", 
    "International Development", 
    "Sustainability"
  ], 
  "text": "\n\nI wanted to reference a great blog posted on Notes from CityLinks (icma.org/CityLinksblog) from our CityLinks (icma.org/citylinks) partner, the Institute for Sustainable Communities.  At a CityLinks meeting earlier this year, we were discussing climate efforts in the U.S. compared to other countries and one person asked “What insights on urban sustainability from U.S. cities are applicable to those in the developing world?”  One part of ISC's answer was the new job of Sustainability Director, which many U.S. cities have created to avoid planning silos and address holistically the issue of urban sustainability.  It would be great to hear from other ICMA members and KN users – what other insights can the U.S. share with others on urban sustainability?\n\n", 
  "title": "Urban Sustainability lessons from the US", 
  "when": "07-05-2012"
}