{
  "answer_by": null, 
  "answers": [
    {
      "author": "Richard Hoon", 
      "score": "0", 
      "text": "\n\nHow many people are you talking about?  If you are talking about a couple (which I doubt), this would be fairly simple.  If you have a small army, communications is always difficult.  \nOur PW Department has early morning huddle before heading out into the field.  At that meeting, which is generally short, the supervisor puts out this information, provides printouts if necessary, and covers other information, like scheduling, etc. \nI'm sure in a department such as yours, you must communicate things often - at least I hope so.  Use those methods to get the word out.\n\n\nHow many people are you talking about?  If you are talking about a couple (which I doubt), this would be fairly simple.  If you have a small army, communications is always difficult.  \n\nOur PW Department has early morning huddle before heading out into the field.  At that meeting, which is generally short, the supervisor puts out this information, provides printouts if necessary, and covers other information, like scheduling, etc. \n\nI'm sure in a department such as yours, you must communicate things often - at least I hope so.  Use those methods to get the word out.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-09-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Unknown", 
  "id": 20422, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI work for the Solid Waste Department in Durham, NC.  I'm trying to develop a better way of sharing  generic City information information with our field crews;  the type of stuff that typically comes in through \"all-user emails\".  I do print all emails and place them on a bulletin board where I suspect they are usually ignored.  Critical emails, such as those relating to benfits, salaries, etc, I make sure to actually point out to employees.\nDoes anyone ask their field employees for a personal email address and forward this type of information to them that way?\n\n", 
  "title": "Email communications with field staff", 
  "when": "20-09-2010"
}