{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jesse Himes", 
      "score": "1", 
      "text": "\n\nHi Peni,\nThat’s a great question. I was able to find a couple of items in the Knowledge Network that may be helpful to you.\nThis article details what North Port, Florida is doing for their small business loan funds.\nhttp://icma.org/en/Article/100636/North_Port_FL_Launches_Small_Business_Revolving_Loan_Guarantee_Fund\nAlso this document describes what the Town of Yucca Valley does for their businesses.\nicma.org/Documents/Document/Document/11960\nI hope this was useful!\nJesse Himes, Knowledge Network Intern, jhimes@icma.org\n\n\nHi Peni,\nThat’s a great question. I was able to find a couple of items in the Knowledge Network that may be helpful to you.\nThis article details what North Port, Florida is doing for their small business loan funds.\nhttp://icma.org/en/Article/100636/North_Port_FL_Launches_Small_Business_Revolving_Loan_Guarantee_Fund\nAlso this document describes what the Town of Yucca Valley does for their businesses.\nicma.org/Documents/Document/Document/11960\n\nI hope this was useful!\nJesse Himes, Knowledge Network Intern, jhimes@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-09-2014"
    }, 
    {
      "author": "Jacob Foos", 
      "score": "0", 
      "text": "\n\nOur Town does not provide a business loan program but it's not an unheard of practice.  The cases I have seen were provided through an Economic Development Authority which acts as a separate entity from the municipality.  The EDA operates a revolving loan fund and also reviews other options for business incentives such as tax credits, temporary office space, etc.\n\n\nOur Town does not provide a business loan program but it's not an unheard of practice.  The cases I have seen were provided through an Economic Development Authority which acts as a separate entity from the municipality.  The EDA operates a revolving loan fund and also reviews other options for business incentives such as tax credits, temporary office space, etc.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-09-2014"
    }
  ], 
  "answers_count": 2, 
  "author": "Peni Basalusalu", 
  "id": 23306, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nGood day.  We've encountered some unique experience as of late where a couple of businesses in our City have requested to a loan from the City.  For instance, a laundry businesses that deals specifically with commercial clients through the San Francisco area and much of Northern CA was out growing its current operating space/building.  They have purchased and secured a new location within the City limits and came before the City Council to ask for a loan (around $120K) from the City as part of their moving expenses.  Additionally, the Chamber of Commerce were given a new office space by to hold their operations from and they too came before the Council to and asked for $30K loan to renovated their new space. \nOf course the City has not provided anything to the requests, but as this has came about, we wonder if anyone out there has experienced such a request or even have a policy that caters to such requests.  We certainly are grateful for the businesses, for they do provide employment opportunities and add to the economic growth of the City.  We do not want to loose them, but want to assist them in proper ways that would not hinder the City's finances.  Any tips or recommendations is appreciated deeply. \nPeni\n\n", 
  "title": "Businesses asking for a loan from the City", 
  "when": "11-09-2014"
}