{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Laura, \nHere is a previously asked question that discusses different software and online options used by local governments to track employee training and learning hours and sign ups. The features vary by service but you can see what options other local governments are using and what they recommend. http://icma.org/en/icma/knowledge_network/questions/kn/Question/21948/Does_your_organization_use_a_software_to_track_employee_training_hours\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nHi Laura, \n\nHere is a previously asked question that discusses different software and online options used by local governments to track employee training and learning hours and sign ups. The features vary by service but you can see what options other local governments are using and what they recommend. http://icma.org/en/icma/knowledge_network/questions/kn/Question/21948/Does_your_organization_use_a_software_to_track_employee_training_hours\n\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "12-06-2014"
    }
  ], 
  "answers_count": 1, 
  "author": "Laura Graetz", 
  "id": 23174, 
  "score": "0", 
  "tags": [
    "Career Resources"
  ], 
  "text": "\n\nWe are seeking a new LMS vendor to support our Learning & Development efforts. At a minimum, we are seeking a solution that will help our employees register for training online and help us administer our training programs (registration, pre-work reminders, evaluations, post-work communication, transcripts and reporting, etc.) We would also like this solution to serve as a platform for our increasing e-learning offerings.  Ideally, we would like this solution to have the capability to foster informal, online learning communities that will allow our employees to connect and collaborate with one another about the concepts they've learned and how to best apply them to their performance on the job.  And, if money were no object, we'd like the solution to tie to a larger talent management solution in the future.\nI am curious to know what LMS solutions the Alliance community may be using and how well do you like them, approximate cost, etc.  Thank you in advance for any help you can provide!\n\n", 
  "title": "Learning Management System (LMS) Recommendations", 
  "when": "10-06-2014"
}