{
  "answer_by": null, 
  "answers": [
    {
      "author": "Matthew Reges", 
      "score": "0", 
      "text": "\n\nI think your decibel-level ordinance is actually the fairest and simplest tool. You're not distinguishing between amplified rock, an unamplified big band, or any content types (conditional-use permits have this danger). A nuisance is a noise above the threshold, whatever the cause. The police can patrol or respond to complaints with a $100 sound meter and enforce easily enough.\nIf the community wants less noise, the ordinance is relatively easy to tinker: amend to measure 80, 70, or however few dB at the door. With that regulation in place, businesses that want to host louder events can invest in insulation or basement club areas. \nBut the noise dissipates inverse-square, diminished by living just a block or two away from the hotspot. So part of the solution might be to expand walkability features for several blocks farther out.  Some people will want to live right next to the best local music venue, and others will choose a building a bit farther away. That's fine, and the tenant sorting will happen on its own with over-regulation of the arts.\n\n\nI think your decibel-level ordinance is actually the fairest and simplest tool. You're not distinguishing between amplified rock, an unamplified big band, or any content types (conditional-use permits have this danger). A nuisance is a noise above the threshold, whatever the cause. The police can patrol or respond to complaints with a $100 sound meter and enforce easily enough.\n\nIf the community wants less noise, the ordinance is relatively easy to tinker: amend to measure 80, 70, or however few dB at the door. With that regulation in place, businesses that want to host louder events can invest in insulation or basement club areas. \n\nBut the noise dissipates inverse-square, diminished by living just a block or two away from the hotspot. So part of the solution might be to expand walkability features for several blocks farther out.  Some people will want to live right next to the best local music venue, and others will choose a building a bit farther away. That's fine, and the tenant sorting will happen on its own with over-regulation of the arts.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "18-06-2012"
    }, 
    {
      "author": "John Zakian", 
      "score": "0", 
      "text": "\n\nDecibel level ordinances generally do not work and my experience is that police departments frown upon having to enforce such rules.  West Palm Beach is one city that is continually grappling with the dueling needs to promote small business growth especially night clubs and restaurants and nurturing increasing downtown residents through new condo and apartment rental construction.  Part of the solution is working with the housing interests to assure there is full disclosure in seeking to attract residents about the dynamic nature of the downtown.  Other measures that are periodically reviewed are hours of operation limitation, restricting \"sidewalk cafe\" versus inside buildings, encouraging commercial development in only certain areas, etc.\n\n\nDecibel level ordinances generally do not work and my experience is that police departments frown upon having to enforce such rules.  West Palm Beach is one city that is continually grappling with the dueling needs to promote small business growth especially night clubs and restaurants and nurturing increasing downtown residents through new condo and apartment rental construction.  Part of the solution is working with the housing interests to assure there is full disclosure in seeking to attract residents about the dynamic nature of the downtown.  Other measures that are periodically reviewed are hours of operation limitation, restricting \"sidewalk cafe\" versus inside buildings, encouraging commercial development in only certain areas, etc.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-06-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "William Ferguson", 
  "id": 21969, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Housing & Community Development", 
    "Planning", 
    "Police", 
    "Economic Development"
  ], 
  "text": "\n\nOur city is blessed to have a thriving historic downtown.  As a community that is an attractive destination for retirees and second homeowners, we've seen an uptick in high-end residential uses downtown. Second floor spaces in many older buildings have been rehabbed into upscale condos or apartments. A variety of commercial uses surround these spaces, and mostly they all complement each other well. \nRecently we've encountered a problem where a restaurant that frequently hosts live music shares a party wall with a building that has several nice apartments.  The apartment tenants are complaining about the loud noise from the live music, but our noise ordinance which allows a certain decibel level does not give us a tool to address the problem (the noise from the restaurant is just below our violation threshold.)  Efforts to mediate the situation have not proven effective.\nCouncil wants a solution that allows for and encourages vibrant businesses, but that doesn't scare off residential uses.  I suspect in younger and larger cities, this problem is less prominent because downtown residents expect and tolerate a certain level of noise.  But our downtown residents are largely older and more affluent.  Add in that all this is going on in 100+ years old buildings with virtually no sound proofing, and it starts to add up to a problem.\nWe're looking to see if there are any creative solutions out there. We've thought about making live music a conditional use through our zoning ordinance, and placing restrictions on its proximity to residential, or require soundproofing to achieve a certain decibel level.  Maybe limiting live music to the ground floors of buildings, etc... Does anyone have a any good ideas for us?\n\n", 
  "title": "Noise conflicts in a mixed-use downtown", 
  "when": "18-06-2012"
}