{
  "answer_by": null, 
  "answers": [
    {
      "author": "Roderick Wood", 
      "score": "1", 
      "text": "\n\nI believe your concerns are right completely valid.  A business relationship impacts the CM relationship with CC or employees.  Your easy out is to inform them that the ICMA Code of Ethics does not allow you to engage in a business relationship with the CC or employees.\n\n\nI believe your concerns are right completely valid.  A business relationship impacts the CM relationship with CC or employees.  Your easy out is to inform them that the ICMA Code of Ethics does not allow you to engage in a business relationship with the CC or employees.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-01-2014"
    }, 
    {
      "author": "Nathan Henne", 
      "score": "0", 
      "text": "\n\nI was lucky on my first CM gig in Colorado.  Council helped find me an apartment to rent which was owned by a former councilwoman.  However, I did have one department head who was in a long term relationship with the mayor, lived with him, and paid him rent.  Another department head rented an apartment from another councilmember.  The way I decided to handle it was when it came time to vote on any monetary change to these to particular employees (i.e. COLA increases) that particular councilmember would excuse themselves so as to not vote and not participate in the conversation.  It was a small town (400) and that type of thing cropped up quite a bit.  It's just important to err on the side of extreme caution bordering on paranoia in order to make sure everyone knows of the potential conflict and how you are ethically handling the situation.  In your particular circumstance however I would agree with Mr. Wood.  Unless said councilmember wants to let you live there for free!  nyuk nyuk...\n\n\nI was lucky on my first CM gig in Colorado.  Council helped find me an apartment to rent which was owned by a former councilwoman.  However, I did have one department head who was in a long term relationship with the mayor, lived with him, and paid him rent.  Another department head rented an apartment from another councilmember.  The way I decided to handle it was when it came time to vote on any monetary change to these to particular employees (i.e. COLA increases) that particular councilmember would excuse themselves so as to not vote and not participate in the conversation.  It was a small town (400) and that type of thing cropped up quite a bit.  It's just important to err on the side of extreme caution bordering on paranoia in order to make sure everyone knows of the potential conflict and how you are ethically handling the situation.  In your particular circumstance however I would agree with Mr. Wood.  Unless said councilmember wants to let you live there for free!  nyuk nyuk...\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-01-2014"
    }, 
    {
      "author": "Robert Kiely", 
      "score": "0", 
      "text": "\n\nYour concerns are not unfounded. Follow your gut and only entertain these offers if there are no other options.\n\n\nYour concerns are not unfounded. Follow your gut and only entertain these offers if there are no other options.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "20-01-2014"
    }, 
    {
      "author": "Benjamin DeClue", 
      "score": "0", 
      "text": "\n\nI would be uncomfortable renting from a subordinate employee or a council member.  That said there are some very small towns out there that still require residency.  If they don't have much in the way of available real estate I can see where they wouldnt think that arrangement is so odd.\nThat being said, what they think and the optics/reality of the situation are two different things...\n\n\nI would be uncomfortable renting from a subordinate employee or a council member.  That said there are some very small towns out there that still require residency.  If they don't have much in the way of available real estate I can see where they wouldnt think that arrangement is so odd.\n\nThat being said, what they think and the optics/reality of the situation are two different things...\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-01-2014"
    }
  ], 
  "answers_count": 4, 
  "author": "[Anonymous]", 
  "id": 22929, 
  "score": "0", 
  "tags": [
    "Elected Officials", 
    "Ethics"
  ], 
  "text": "\n\nI have accepted a position as administrator in a new community and the new council knows that I will be looking for housing. I've received calls from a council member in the new community indicating that one of the employees (who would be under my supervision) has bought a house (income property) and I could rent from the employee.  The council member also indicated that he had property, and that I could rent from him.\nI am vary ill at ease with either option, as it could be appear that it would curry favor toward the employee in any future village related matters ( ie. discipline, wage adjustment, promotion etc.); with the same concern for the offer from the council member (who voted for my appointment).\nAre my concerns off-base?\nAny suggestions as to how to convey this to the council member?\n\n", 
  "title": "Renting housing from employees  or council members", 
  "when": "17-01-2014"
}