{
  "answer_by": null, 
  "answers": [
    {
      "author": "Leslie Beauregard", 
      "score": "0", 
      "text": "\n\nNickie:  We have our Council adopt Budget Guidelines each November/December, which is kind of late in the process at that point - but they are pretty broad in nature anyway.  At that same time, we provide long term revenue and expenditure forecasts and start the budget dicussion with issues we know will be coming forward in the next year.  We have done a combination of Council meetings and Budget Worksessions.  This year, we did a Budget Worksession in January and then they held a retreat just last week which did focus some on the budget but more on their specific priority areas.  Go to http://www.charlottesville.org/Index.aspx?page=3131 and you can get information on our FY 2013 Budget Development Process.  Good luck and I look forward to seeing how others respond!\n\n\nNickie:  We have our Council adopt Budget Guidelines each November/December, which is kind of late in the process at that point - but they are pretty broad in nature anyway.  At that same time, we provide long term revenue and expenditure forecasts and start the budget dicussion with issues we know will be coming forward in the next year.  We have done a combination of Council meetings and Budget Worksessions.  This year, we did a Budget Worksession in January and then they held a retreat just last week which did focus some on the budget but more on their specific priority areas.  Go to http://www.charlottesville.org/Index.aspx?page=3131 and you can get information on our FY 2013 Budget Development Process.  Good luck and I look forward to seeing how others respond!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-02-2012"
    }, 
    {
      "author": "Lawrence Pollack", 
      "score": "0", 
      "text": "\n\nHello. At the City of Fort Collins we use a budget process called Budgeting for Outcomes (BFO). That process has some key touchpoints with our City Council prior to submitting the City Manager's Recommended Budget to them in September. First, they kick-off the BFO process in February by determining and defining the key Outcomes for our community and the citizens they represent. Teams of staff and citizens are then put together to create guiding documents for each outcome (called a Request for Results) and a causal map that visually represents the primary and secondary factors that impact each Outome. The second touchpoint with Council is when we spend an entire Council Work Session in April where each team presents their documents to Council to get their feedback, input and guidance. Those documents are then updated before the organization starts creating budget requests. The 3rd direct Council interaction occurs when we give them a \"budget preview\" at a Council Work Session in the summer to give them a heads-up as to what is being included in the City Manager's Recommended Budget. It also gives staff an opportunity to see where Council may have questions or concerns. Cheers.\n\n\nHello. At the City of Fort Collins we use a budget process called Budgeting for Outcomes (BFO). That process has some key touchpoints with our City Council prior to submitting the City Manager's Recommended Budget to them in September. First, they kick-off the BFO process in February by determining and defining the key Outcomes for our community and the citizens they represent. Teams of staff and citizens are then put together to create guiding documents for each outcome (called a Request for Results) and a causal map that visually represents the primary and secondary factors that impact each Outome. The second touchpoint with Council is when we spend an entire Council Work Session in April where each team presents their documents to Council to get their feedback, input and guidance. Those documents are then updated before the organization starts creating budget requests. The 3rd direct Council interaction occurs when we give them a \"budget preview\" at a Council Work Session in the summer to give them a heads-up as to what is being included in the City Manager's Recommended Budget. It also gives staff an opportunity to see where Council may have questions or concerns. Cheers.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "08-02-2012"
    }
  ], 
  "answers_count": 2, 
  "author": "Nickie Lee", 
  "id": 21666, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting", 
    "Elected Officials"
  ], 
  "text": "\n\nWe are looking for new ways to involve our Council in the early stages of the budget development. In the past, staff has compiled Council Budget Guiding Principles based on citizen surveys, council prioritization activities, and general City Council priorities. This year we would like to lead a discussion or send a survey with them earlier in the process to ask them to provide us with budget guiding principles or specific budget objectives. Do any of you use a process like this? If so, what is the format (online, during a Council meeting, during a retreat, special session, etc.) and what kinds of questions do you ask the Council to guide the discussion? Thank you for your feedback!\n\n", 
  "title": "Council Budget Philosophy Development Suggestions", 
  "when": "08-02-2012"
}