{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jay Gsell", 
      "score": "0", 
      "text": "\n\nBingo - so stereotypical but plays to the perception of many citizens of what doesnt motivate or concern public employees. having actually worked in Trenton NJ( my wife worked also in the mayor's Office), the City malingerer was classic and represented the union mentality of 30 yrs ago. THankfully current administration has cleaned up and mostly corrected ingrained mindset and sense of entitlement in the alleged State Capitol of NJ. In NYS we have County DMV offices which can actually generate enough Rev to support employees costs and operate efficiently and csutomer service and courtesy are always prime objectives. However it only takes one bad apple or less than positive citizen experinece to skew the Depts' reputation and fall into the pit portrayed on the SNL skit. TQM/ Lean government doesnt have to mean overworked , underappreciated public workers and we have to engage and instill a culture of excellence to dispell the SNL video \"myth\" otherwise as POGO said, \"we have met the nemy and they is us\".\n\n\nBingo - so stereotypical but plays to the perception of many citizens of what doesnt motivate or concern public employees. having actually worked in Trenton NJ( my wife worked also in the mayor's Office), the City malingerer was classic and represented the union mentality of 30 yrs ago. THankfully current administration has cleaned up and mostly corrected ingrained mindset and sense of entitlement in the alleged State Capitol of NJ. In NYS we have County DMV offices which can actually generate enough Rev to support employees costs and operate efficiently and csutomer service and courtesy are always prime objectives. However it only takes one bad apple or less than positive citizen experinece to skew the Depts' reputation and fall into the pit portrayed on the SNL skit. TQM/ Lean government doesnt have to mean overworked , underappreciated public workers and we have to engage and instill a culture of excellence to dispell the SNL video \"myth\" otherwise as POGO said, \"we have met the nemy and they is us\".\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "11-06-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Municipal Meerkat", 
  "id": 20092, 
  "score": "2", 
  "tags": [], 
  "text": "\n\nYou may have seen a recent Saturday Night Live skit which portrayed government employees (on the state and local level) as lazy, unskilled, and unhelpful. We at ICMA know that this is far from true, and we would like your help spreading the message that local government employees are hard working professionals who have their community's best interests in mind.\nBut we don't want you just to tell us! We want you to show us!\nWe're asking you to help spread the message that you're committed to local government excellence through a video response to the sketch below:\nhttp://www.hulu.com/watch/144719/saturday-night-live-public-employee-of-the-year\nThis is ICMA's third annual video contest. The top three winners will receive complimentary registration to ICMA's 96th Annual Conference in San Jose and a travel stipend. Find out more here: http://icma.org/en/Page/100142/2010_ICMA_Video_Contest\nUse this Knowledge Network question to post idea and share thoughts!\n\n", 
  "title": "How hard do local government employees work?", 
  "when": "10-06-2010"
}