{
  "answer_by": null, 
  "answers": [
    {
      "author": "Daniel Ortiz-Hernandez", 
      "score": "0", 
      "text": "\n\nI would ask yourself what you seek to accomplish professionally and personally in transitioning into a career in local government. You've had a wonderful career career as a nurse, but knowing what you want out of your second career in local government will help you narrow your job search and better explain your transition. If you are seeking to remain associated with the health care field, then county governments may be the way to go since they offer more positions associated with health care and social services that more closely relate to your nursing background. You may find it difficult to land a management position without having significant experience in government. You may want to seek out a management support role such as an analyst. Such positions are great in getting you foot in the door. As a registered nurse I imagine you interacted greatly with all sorts of people, so I would guess that you have pretty good people skills. Highlight this. Lastly, be cautious about how politically active you are. You mentioned you ran for office. The ICMA Code of Ethics recommends refraining from political activity. While you may have good intentions, in this profession it is better to avoid political activity so as to avoid any insinuation of impropriety and maintain a high degree of professionalism. I would recommend you seek out mentors who are active in this profession. ICMA has senior advisors, retired city managers, and Range Riders in every state that are very good sources of information. Seek one out in your state.  Hope this helps.\n\n\nI would ask yourself what you seek to accomplish professionally and personally in transitioning into a career in local government. You've had a wonderful career career as a nurse, but knowing what you want out of your second career in local government will help you narrow your job search and better explain your transition. If you are seeking to remain associated with the health care field, then county governments may be the way to go since they offer more positions associated with health care and social services that more closely relate to your nursing background. You may find it difficult to land a management position without having significant experience in government. You may want to seek out a management support role such as an analyst. Such positions are great in getting you foot in the door. As a registered nurse I imagine you interacted greatly with all sorts of people, so I would guess that you have pretty good people skills. Highlight this. Lastly, be cautious about how politically active you are. You mentioned you ran for office. The ICMA Code of Ethics recommends refraining from political activity. While you may have good intentions, in this profession it is better to avoid political activity so as to avoid any insinuation of impropriety and maintain a high degree of professionalism. I would recommend you seek out mentors who are active in this profession. ICMA has senior advisors, retired city managers, and Range Riders in every state that are very good sources of information. Seek one out in your state.  Hope this helps.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-12-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Patricia Terry", 
  "id": 21542, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI have had a long and successful career as a Registered Nurse, but over time my interests shifted to the public policy arena.  I went back to school for an MPA, ran for public office, and served for a year as the appointed County Clerk when an early retirement created a vacancy.  My question is whether my background in healthcare hurts or helps me now that I want to focus on a career in county or city management and/or public policy.  My healthcare background is heavy with experience with government funded entities, performance measurement/process improvement, and management so I hesitate to leave it out.   I am concerned that the word \"nurse\" conjures up stereotypical images and ideas that will be counter-productive to my job search.  Please advise.\n\n", 
  "title": "Resume Advice", 
  "when": "10-12-2011"
}