{
  "answer_by": null, 
  "answers": [
    {
      "author": "Thomas Wieczorek", 
      "score": "0", 
      "text": "\n\nThis is a common problem that Consulting Services sees throughout the United States -- both in police as well as fire. \nWhen negotiating labor contracts, care should be taken to define the number of hours for both sick and vacation. ICMA-CS often sees the term \"days\" instead of specified hours.  If an employees is working a 24 hour \"day\" (for instance in many fire departments) but then is promoted to a management position with higher base wage, the number of hours can quickly deplete funded sick and vacation pay banks. Likewise, if 8 hour employees have been accumulating time by the \"day\", when they are changed to a 12 hour or 24 hour shift the time multiplies by 50 percent or 300%. \nICMA-CS has seen a movement towards short and long term disability with a minimum of hours granted each year to cover the periods necessary to qualify for the benefit. That type of system minimizes the banked time that is frequently cashed in at retirement (and often paid at 100%) which can also multiply the retirement amounts paid.\n\n\nThis is a common problem that Consulting Services sees throughout the United States -- both in police as well as fire. \n\nWhen negotiating labor contracts, care should be taken to define the number of hours for both sick and vacation. ICMA-CS often sees the term \"days\" instead of specified hours.  If an employees is working a 24 hour \"day\" (for instance in many fire departments) but then is promoted to a management position with higher base wage, the number of hours can quickly deplete funded sick and vacation pay banks. Likewise, if 8 hour employees have been accumulating time by the \"day\", when they are changed to a 12 hour or 24 hour shift the time multiplies by 50 percent or 300%. \n\nICMA-CS has seen a movement towards short and long term disability with a minimum of hours granted each year to cover the periods necessary to qualify for the benefit. That type of system minimizes the banked time that is frequently cashed in at retirement (and often paid at 100%) which can also multiply the retirement amounts paid.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "10-08-2010"
    }
  ], 
  "answers_count": 1, 
  "author": "Alex Deshuk", 
  "id": 20303, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nHow does your organization handle vacation and sick time accrual when firefighters move back and forth between 40 and 56 hour shifts?\nFor example, do accrual rates adjust according to the shift changes, do any accrued balances changes?  Are discretionary shift changes made only to coincide with payroll periods?  \nAre these rules part of MOU’s with your firefighter agencies, or are they part of general organization’s payroll/personnel rules?\nAny insight as to the options would be appreciated.\n\n", 
  "title": "56 - 40 Hour Fire Fighter Pay", 
  "when": "09-08-2010"
}