{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "0", 
      "text": "\n\nHi Robert, \nThanks for your timely question. In May, ICMA launched the Life, Well Run campaign, a national initiative to raise awareness of and appreciation for the contributions that professional local government managers make to cities, counties, and towns across the United States. \nThe Life, Well Run campaign will focus attention of what makes people proud of their communities, encourage them to express that pride, and most importantly, draw the dotted line between the local government services people receive and the critical role their city, county, or town manager plays in delivering those services effectively, efficiently, and ethically.  In essence, the campaign aims to provide a civics lesson that educates citizens, business leaders, community leaders, elected officials, the media, the next generation of managers, and others about the value of professional local government management and the day-to-day/nuts-and-bolts role the manager plays in delivering services. \nThe campaign kicked off last month in the pilot cities of San Antonio and Seguin, TX, where videos where filmed that begin to tell the story of the value of professional local government management. You can watch the first two videos at www.youtube.com/lifewellrun. More to come! \nThe campaign is also collecting stories from communities all across the country that highlight examples of successful community projects and how professional managers make our communities places in which we're proud to call home. Please share yours at yourstory@lifewellrun.org.  \nFor more updates from the campaign, visit  http://icma.org/en/icma/priorities/life_well_run \nPlease also visit the campaign's official homepage at LifeWellRun.org. You can also follow the campaign on Facebook and Twitter. \nThanks, \nKeith\n\n\nHi Robert, \n\nThanks for your timely question. In May, ICMA launched the Life, Well Run campaign, a national initiative to raise awareness of and appreciation for the contributions that professional local government managers make to cities, counties, and towns across the United States. \n\nThe Life, Well Run campaign will focus attention of what makes people proud of their communities, encourage them to express that pride, and most importantly, draw the dotted line between the local government services people receive and the critical role their city, county, or town manager plays in delivering those services effectively, efficiently, and ethically.  In essence, the campaign aims to provide a civics lesson that educates citizens, business leaders, community leaders, elected officials, the media, the next generation of managers, and others about the value of professional local government management and the day-to-day/nuts-and-bolts role the manager plays in delivering services. \n\nThe campaign kicked off last month in the pilot cities of San Antonio and Seguin, TX, where videos where filmed that begin to tell the story of the value of professional local government management. You can watch the first two videos at www.youtube.com/lifewellrun. More to come! \n\nThe campaign is also collecting stories from communities all across the country that highlight examples of successful community projects and how professional managers make our communities places in which we're proud to call home. Please share yours at yourstory@lifewellrun.org.  \n\nFor more updates from the campaign, visit  http://icma.org/en/icma/priorities/life_well_run  \n\nPlease also visit the campaign's official homepage at LifeWellRun.org. You can also follow the campaign on Facebook and Twitter. \n\nThanks, \nKeith\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-06-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "Robert Beezat", 
  "id": 21984, 
  "score": "1", 
  "tags": [
    "Citizen Education"
  ], 
  "text": "\n\nFor the last 30 years, govenrment has been under attack.  Starting with President Reagan who declared that government was the problem and not the solution, government has repeatedly been portrayed as inept and not effective.  On the other hand, private business is touted as the answer to solve all of our economic, community, and societal problems.  \nI think we need to tell the many positive stories and accomplishments of government, including at the city and county level. \nMy question is:  Does ICMA have any program which collects information on and promotes the successes of local governments?  \nAs a former/retired city manager, I think government does many wonderful things everyday.  People are saved by EMTs.  Citizens are protected and communities are kept safe by public safety personnel.  The water works in the morning when I get up to make a cup of coffee.  When I flush a toilet at home or at work, the sewage gets treated effectively and efficiently.  When it snows, my street and the streets all over the city are plowed.  Traffic lights are working so I don't have to worry about someone breezing through an intersection and causing a crash.  This morning I ran along the lakeshore of Lake Michigan along paths and breakwaters built and maintained by the city.  The list can go on and on.  There are few things I do everyday which are not somehow enabled by local government.\n\n", 
  "title": "Government Works Well", 
  "when": "24-06-2012"
}