{
  "answer_by": null, 
  "answers": [
    {
      "author": "Martha Perego", 
      "score": "0", 
      "text": "\n\nThe city attorney is right to stress the importance of following all laws with regard to hiring practices. Certainly you don't want any hiring body to discriminate against an individual based on sex, race, etc.  That said, when hiring a city or county manager, the council does have some latitude here to include candidates who might not meet all the minimum requirements. They may be the candidate who has a set of experiences or demonstrated success in an area required by the local government.  Other candidates might look great on paper but don't demonstrate the interpersonal skills required to lead an organization.  As long as the council is making decisions based on the individual's credentials and experience in managing a local government,  they are on pretty solid ground. It's important for the council to decide in advance of posting the position what they are looking for in a manager. The level of education, experience, expertise are all things that should be considered in advance. And of course, that also relates to the ability of the oganization to pay for that skill set.\n\n\nThe city attorney is right to stress the importance of following all laws with regard to hiring practices. Certainly you don't want any hiring body to discriminate against an individual based on sex, race, etc.  That said, when hiring a city or county manager, the council does have some latitude here to include candidates who might not meet all the minimum requirements. They may be the candidate who has a set of experiences or demonstrated success in an area required by the local government.  Other candidates might look great on paper but don't demonstrate the interpersonal skills required to lead an organization.  As long as the council is making decisions based on the individual's credentials and experience in managing a local government,  they are on pretty solid ground. It's important for the council to decide in advance of posting the position what they are looking for in a manager. The level of education, experience, expertise are all things that should be considered in advance. And of course, that also relates to the ability of the oganization to pay for that skill set.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-02-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "[Anonymous]", 
  "id": 21670, 
  "score": "0", 
  "tags": [
    "Legal Issues"
  ], 
  "text": "\n\nOur legal counsel is strongly suggesting we interview and hire a city manager that fits or exceeds the minimum requirements we posted in the advertisement but how many times have council members found that there are a few candidates that don't quite fit the minimum but should still be a contender?  Have any cities run into this problem?  Have any cities encountred litigation because of hiring under the minimum requirements?  Some of our council members think legal counsel has taken too hard of a stance but we'd like to hear from others.  Certainly we could re-advertise with lesser requirements but why waste the time and money if we don't have to.\n\n", 
  "title": "Hiring City Manager", 
  "when": "09-02-2012"
}