{
  "answer_by": "16-05-2013", 
  "answers": [
    {
      "author": "Michael Huggins", 
      "score": "0", 
      "text": "\n\nThe City of Eau Claire (Wisconsin), Eau Claire County, and the Eau Claire Area School District formed a 9 member Joint Commission on Shared Services several years ago. Three elected officials from each jurisdiction serve on the Commission, which acts in an advisory capacity to the full governing bodies. The chief administrators of each organization attend and support the work of the Commission which meets monthly to discuss opportunities for shared funding and shared delivery of services.\n\n\nThe City of Eau Claire (Wisconsin), Eau Claire County, and the Eau Claire Area School District formed a 9 member Joint Commission on Shared Services several years ago. Three elected officials from each jurisdiction serve on the Commission, which acts in an advisory capacity to the full governing bodies. The chief administrators of each organization attend and support the work of the Commission which meets monthly to discuss opportunities for shared funding and shared delivery of services.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-05-2013"
    }
  ], 
  "answers_count": 1, 
  "author": "Leslie Beauregard", 
  "id": 22537, 
  "score": "0", 
  "tags": [
    "Finance and Budgeting", 
    "Management", 
    "Citizen Engagement", 
    "Strategic Planning"
  ], 
  "text": "\n\nHas anyone created and been involved in a joint commission or task force that looked at funding issues and long term strategies on funding the funding relationship between the locality and school system?  Charlottesville will have such a group working this summer on these very issues  (the City funds a significant porition of the City's school system with the rest funded by the State and a small amout of federal funding and this is not unusual in Virginia).  Am wondering if there are other examples or models out there that we can learn from before this starts - looking at process, information provided, goals, who participated, etc. \nThanks!\n\n", 
  "title": "Joint Commissions - School and City", 
  "when": "29-04-2013"
}