{
  "answer_by": "31-08-2010", 
  "answers": [
    {
      "author": "April Jaeger", 
      "score": "1", 
      "text": "\n\nRemind them that they hired you because they value your experience, expertise, and judgement.  But, give them choices; ultimatums often backfire. Show you are flexible and pragmatic, but that your ethics require your action (see if they have better recommendations and read the ICMA ethics to them). Remind them that ultimately, you are the whistle blower on this guy...  you just didn't take it to court...  \nGood Luck.\n\n\nRemind them that they hired you because they value your experience, expertise, and judgement.  But, give them choices; ultimatums often backfire. Show you are flexible and pragmatic, but that your ethics require your action (see if they have better recommendations and read the ICMA ethics to them). Remind them that ultimately, you are the whistle blower on this guy...  you just didn't take it to court...  \n\nGood Luck.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "14-08-2010"
    }, 
    {
      "author": "Martha Perego", 
      "score": "0", 
      "text": "\n\nWhile the city council would have ultimate authority to approve a legal settlement, it's important to remind them that the authority you exercised to remove a non-performing employee is granted to you by city charter or some other law.  The council needs to uphold the law.  You will also want to advise council of the risk of bringing this employee back in an effort to settle the matter before legal counsel has weighed in. To do so places you at risk with your insurance carrier.\n\n\nWhile the city council would have ultimate authority to approve a legal settlement, it's important to remind them that the authority you exercised to remove a non-performing employee is granted to you by city charter or some other law.  The council needs to uphold the law.  You will also want to advise council of the risk of bringing this employee back in an effort to settle the matter before legal counsel has weighed in. To do so places you at risk with your insurance carrier.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "17-08-2010"
    }
  ], 
  "answers_count": 2, 
  "author": "Bobbye Rose", 
  "id": 20316, 
  "score": "1", 
  "tags": [], 
  "text": "\n\nI had a 23 year employee -finance director- who was not doing his job.  Numerous qualified opinions over the past 7 years, counselling did not work, demoted and then found he had forged a letter.  I terminated employment. He has filed  a whistleblower case against me that I can easily defend.  This issue has turned rational and three of the five commissioners want to negotiate the lawsuite prior to legal advice to bring the employee back.  I have stated he will not come back under my administration unless court ordered.\nAny advice on how to keep my job without sweeping issues under the rug (which has been the norm)?  Any advice will be greatly appreciated.\n\n", 
  "title": "personnel decision and commission intervention", 
  "when": "13-08-2010"
}