{
  "answer_by": null, 
  "answers": [
    {
      "author": "Robert Carty", 
      "score": "1", 
      "text": "\n\nSounds like you have a lot of passion, experience and interest in local government! At the undergraduate level I'd recommend programs like the City Hall Fellows (with programs in San Fransisco, Houston, and Baton Rouge), New York's Urban Fellows Program, or City Year to name just a few.  \nJobs listed in the ICMA JobCenter tend to be for candidates with graduate degrees and many years of experience.  Those jobs listed for early careerists are traditionally for MPA/MPP graduates, mostly because local governments go directly to their local colleges and universities rather than posting a national recruitment for undergraduate/entry-level candidates.  And those jobs will most likely be function-specific (Community Coordinator or Economic Analyst I, for example).\nDarwin's advice about looking into state associations is sound, as they will have connections with managers who know of other internships or entry level positions available.  Feel free to give me a call (my number is on my profile page) and we can discuss some other directions you might explore.\n\n\nSounds like you have a lot of passion, experience and interest in local government! At the undergraduate level I'd recommend programs like the City Hall Fellows (with programs in San Fransisco, Houston, and Baton Rouge), New York's Urban Fellows Program, or City Year to name just a few.  \n\nJobs listed in the ICMA JobCenter tend to be for candidates with graduate degrees and many years of experience.  Those jobs listed for early careerists are traditionally for MPA/MPP graduates, mostly because local governments go directly to their local colleges and universities rather than posting a national recruitment for undergraduate/entry-level candidates.  And those jobs will most likely be function-specific (Community Coordinator or Economic Analyst I, for example).\n\nDarwin's advice about looking into state associations is sound, as they will have connections with managers who know of other internships or entry level positions available.  Feel free to give me a call (my number is on my profile page) and we can discuss some other directions you might explore.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "26-10-2010"
    }, 
    {
      "author": "Dan Laroche", 
      "score": "0", 
      "text": "\n\nGo to grad school! The economy is \"not so good\" right now for entry level people.\n\n\nGo to grad school! The economy is \"not so good\" right now for entry level people.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "01-02-2011"
    }, 
    {
      "author": "Scott Bowles", 
      "score": "0", 
      "text": "\n\nAlan:\nI was in a very similar circumstance to you and I ended up going to graduate school at Arizona State University to pursue a MPA since the public sector is quite lean for entry-level employees.  I volunteered for nearly two years (full-time) while going to school with different municipalities so I could have the experience to back up my education.  Ever since I've graduated with my MPA, I have never had a problem finding employment due to my combination of experience and education.\nHowever, I want to commend you on your drive.  It is evident that you have a passion for serving the public and that is exactly what the public sector needs at this time!  If you can't find employment and you are juggling whether graduate school is the right decision for you at this time, I suggest you keep that flame of service alive within you, no matter the cost.  Your small sacrifices today will yield unimaginable benefits in the future.  Good luck to you!\n\n\nAlan:\n\nI was in a very similar circumstance to you and I ended up going to graduate school at Arizona State University to pursue a MPA since the public sector is quite lean for entry-level employees.  I volunteered for nearly two years (full-time) while going to school with different municipalities so I could have the experience to back up my education.  Ever since I've graduated with my MPA, I have never had a problem finding employment due to my combination of experience and education.\n\nHowever, I want to commend you on your drive.  It is evident that you have a passion for serving the public and that is exactly what the public sector needs at this time!  If you can't find employment and you are juggling whether graduate school is the right decision for you at this time, I suggest you keep that flame of service alive within you, no matter the cost.  Your small sacrifices today will yield unimaginable benefits in the future.  Good luck to you!\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-02-2011"
    }
  ], 
  "answers_count": 3, 
  "author": "Alan Raisman", 
  "id": 20536, 
  "score": "0", 
  "tags": [
    "Career Resources"
  ], 
  "text": "\n\nI am hoping to talk with someone about possible job opportunities in local\ngovernment.  I recently graduated with a Bachelor of Arts degree from\nLafayette College, majoring in Government and Law as well as\nInternational Affairs.  Throughout my college career I have been\nintensely involved in the city of Easton, Pennsylvania and its\ncommunity.\nWhile at Lafayette College, I helped establish a group to create greater\ntown-gown relations between Lafayette College and the community in\nEaston, PA.  In the fall of my sophomore year, I started a research\nproject called One Word - One City; I asked the people of Easton to\ndescribe their home in one word in an attempt to understand the\ncommunity and those who lived there.  I was asked to present my research\nat Easton City Council, Easton's chapter of the Pennsylvania Weed and\nSeed, and the Arts Community of Easton.  My understanding of the\ncommunity and the people of Easton grew quickly, and I continued to\nattend Easton City Council meetings for the following two years as well\nas sitting on both the Community Restoration Committee and the Safety\nCommittee of Easton's Weed and Seed.\nIn order to create a more personal relationship with the people of\nEaston, I became the first Lafayette College student volunteer with\nEaston's Main Street program and the first student member of the Easton\nEnvironmental Advisory Council.  I also served as the secretary of the\nCollege Hill Neighborhood Association for one year, the first Lafayette\nCollege student to sit on their Executive Committee.  My committee roles\noffered me the opportunity to engage with the Departments of Public\nWorks, Economic Development, and Planning for the city of Easton, PA.\nBefore I graduated Lafayette College last May, I was presented with the\nService Above Self Award from Lafayette College as well as a Certificate\nof Recognition from Easton's City Council.  The month following my\ngraduation, I traveled to Lancaster to speak about the town-gown\nrelationship at the Pennsylvania Downtown Center's Townie Awards;\nEaston's Main Street program received the Townie Award for Excellence in\nCommunity Partnerships for the new relationship between Lafayette\nCollege and the community of Easton.\nIf you could guide me in a direction to find possible job opportunities\nand gain some career experience, I would greatly appreciate it.\nThank you,\nAlan Raisman\nRaismana@lafayette.edu\n\n", 
  "title": "Local Government Jobs", 
  "when": "23-10-2010"
}