{
  "answer_by": null, 
  "answers": [
    {
      "author": "Paul Rosen", 
      "score": "0", 
      "text": "\n\nGreat question. I was seeking an asnwer to this recently as well. Unfortunately, I didn't come across anything. Maybe in the future ICMA's CPM might come up with a good way to measure and compare this across governments and include it in their report (hint, hint).\nIt might take a lot of doing, but my best suggestion would be to get a copy of the cost allocation plan for a number of governments you usually compare yourself with and see if you can't pull some numbers from those.\n\n\nGreat question. I was seeking an asnwer to this recently as well. Unfortunately, I didn't come across anything. Maybe in the future ICMA's CPM might come up with a good way to measure and compare this across governments and include it in their report (hint, hint).\nIt might take a lot of doing, but my best suggestion would be to get a copy of the cost allocation plan for a number of governments you usually compare yourself with and see if you can't pull some numbers from those.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-05-2012"
    }
  ], 
  "answers_count": 1, 
  "author": "K Drummond", 
  "id": 21853, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nI am trying to find actual data or a best practice recommendation for the % spent by city governments on administrative costs (HR, IT, Finance, Legal, Executive, Council, etc.) \nPercentage of operating budgets (not just General Fund all Funds including enterprise funds) \nIt could be percentage of something else (Revenue, etc.)\nIf there is some stratification of by City size (budget, population, etc.) that would be helpful.\nCity of Bellingham has a population of 80,000 and budget of $180,000,000.\nAlso need to know what is included and not included in 'administration'.\nThanks.\nK. Drummond\nCity of Bellingham, WA\nkdrummond@cob.org\n(360) 778-8031\n\n", 
  "title": "% of municipal budget (operating?) used for administation cost?", 
  "when": "24-04-2012"
}