{
  "answer_by": null, 
  "answers": [
    {
      "author": "Laura Hagg", 
      "score": "0", 
      "text": "\n\nMegan - Have you considered Voluntourism - Volunteer Tourism?  I know Philadelphia CVB and others organize volunteer opportunities while people are visiting the area.  You could develop unique opportunities in Chesterfield County to visit it but also to find ways for people to give back.  If you would like to hear more - please email me at lhagg@icma.org.  I worked on Voluntourism initiatives overseas but have done some research for volunteer tourism here in the US.\n\n\nMegan - Have you considered Voluntourism - Volunteer Tourism?  I know Philadelphia CVB and others organize volunteer opportunities while people are visiting the area.  You could develop unique opportunities in Chesterfield County to visit it but also to find ways for people to give back.  If you would like to hear more - please email me at lhagg@icma.org.  I worked on Voluntourism initiatives overseas but have done some research for volunteer tourism here in the US.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "13-05-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "James Stegmaier", 
  "id": 21020, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Economic Development"
  ], 
  "text": "\n\nChesterfield County is located outside of Richmond, Virginia, and is in the initial stages of exploring new ways to leverage the strength of the Richmond tourism industry and expand it a little south to our neck of the woods. We currently pay into a Richmond-area convention and visitors bureau (CVB) but are interested in alternatives and potentially bringing some marketing in-house to be more County-centric.\nHave any border suburban communities engaged in a process of attracking its own tourism v. attracting typical \"spillover\" tourism? Do you have a relationship with a metropolitan CVB or have you had to/chosen to go it alone? Has a community-wide branding campaign played a role?\nAny insight and/or case studies would be welcome!\nMegan Bourke\nBudget & Management Analyst\nbourkem@chesterfield.gov\n\n", 
  "title": "How to Attract more than \"Spillover\" Tourism", 
  "when": "11-05-2011"
}