{
  "answer_by": null, 
  "answers": [
    {
      "author": "Brent Eichelberger", 
      "score": "0", 
      "text": "\n\nAs a manager you will always need a firm grasp of financial issues from all aspects. The smaller the city the more intimately you will have to be involved in budgeting and finance issues. Larger communities typically have larger staff, including individuals with budget and finance expertise and narrowed focus and breadth of responsibility. If the community has a full-time professional Finance Director with appropriate education and experience, that is allowed to do their job, then the manager’s role in that area should be more in line with what you seem to be seeking. The same concept holds true for Public Works, Community Development, etc. If you don’t have good people heading up all of the various departments, the manager will have to focus more in the deficient department. You also have identified a good area for self-analysis. Do you really want the diversity that comes with the manager’s role or will you be happier and more successful with a narrower career path focused on one or more of the areas you listed? The good news is you don't have to determine that now. Get as much exposure to the different facets of local government as you can while you are young and build a career that fits you.\n\n\nAs a manager you will always need a firm grasp of financial issues from all aspects. The smaller the city the more intimately you will have to be involved in budgeting and finance issues. Larger communities typically have larger staff, including individuals with budget and finance expertise and narrowed focus and breadth of responsibility. If the community has a full-time professional Finance Director with appropriate education and experience, that is allowed to do their job, then the manager’s role in that area should be more in line with what you seem to be seeking. The same concept holds true for Public Works, Community Development, etc. If you don’t have good people heading up all of the various departments, the manager will have to focus more in the deficient department. You also have identified a good area for self-analysis. Do you really want the diversity that comes with the manager’s role or will you be happier and more successful with a narrower career path focused on one or more of the areas you listed? The good news is you don't have to determine that now. Get as much exposure to the different facets of local government as you can while you are young and build a career that fits you.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "16-11-2011"
    }, 
    {
      "author": "William Gilmore", 
      "score": "0", 
      "text": "\n\nInteresting, I went through the same self analysis when I got my urban planning masters and found that I had no management training to run a planning office. So I went for an MPA degree.  My first exposure to government was in a finance and budget role and, in my own opinion, the training and understanding you develop of the various departments you are assigned to assess, evaluate, question, analyze and suggest changes in their operational strategies, job responsibilities, management structure and reporting is invaluable.  As a result, when you get into a management role, what you have learned allows you to assess how those departments are performing, and to question dept heads effectively since you've been there.  It also gives you a better sense of the big picture and why some decisions that tend to take longer than necessary to get made, could be streamlined based on your understanding of their operations.  When I was a manager, I wanted to be as conversant as the Finance Director.  I also agree with Brent to get as much exposure as possible.  Good luck.\n\n\nInteresting, I went through the same self analysis when I got my urban planning masters and found that I had no management training to run a planning office. So I went for an MPA degree.  My first exposure to government was in a finance and budget role and, in my own opinion, the training and understanding you develop of the various departments you are assigned to assess, evaluate, question, analyze and suggest changes in their operational strategies, job responsibilities, management structure and reporting is invaluable.  As a result, when you get into a management role, what you have learned allows you to assess how those departments are performing, and to question dept heads effectively since you've been there.  It also gives you a better sense of the big picture and why some decisions that tend to take longer than necessary to get made, could be streamlined based on your understanding of their operations.  When I was a manager, I wanted to be as conversant as the Finance Director.  I also agree with Brent to get as much exposure as possible.  Good luck.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "07-12-2011"
    }, 
    {
      "author": "Robert Carty", 
      "score": "0", 
      "text": "\n\nIf being a manager is your eventual goal, then having a broad skill-set that includes financial acumen is critical. Finance doesn't get me up in the morning either, but you have to know enough to do the work if you needed to, and supervise those that do. In your career path towards the manager's office (or seat) you'll want to accumulate those needed skills with each advancement. \nYou'll definitely need financial skills if you become a manager in a smaller community, and they'll be indispensable anywhere else. I started in the PIO/community outreach area and found that while there was enough of the day-to-day that I didn't like long term, the exposure, mindset and skills I learned continue to benefit me today.\nI don't think you need to be a finance geek to be the manager, but as others have said you need a firm grounding in the science of finance and budgeting.\n\n\nIf being a manager is your eventual goal, then having a broad skill-set that includes financial acumen is critical. Finance doesn't get me up in the morning either, but you have to know enough to do the work if you needed to, and supervise those that do. In your career path towards the manager's office (or seat) you'll want to accumulate those needed skills with each advancement. \nYou'll definitely need financial skills if you become a manager in a smaller community, and they'll be indispensable anywhere else. I started in the PIO/community outreach area and found that while there was enough of the day-to-day that I didn't like long term, the exposure, mindset and skills I learned continue to benefit me today.\nI don't think you need to be a finance geek to be the manager, but as others have said you need a firm grounding in the science of finance and budgeting.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "21-12-2011"
    }
  ], 
  "answers_count": 3, 
  "author": "[Anonymous]", 
  "id": 21489, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nDo you have to love budgeting and finance in order to become a successful city manager?\nI'm finding in my first couple years of municipal employment in various city manager's offices that I'm willing to learn this material and can become competent in it, but it's not exactly what gets me up in the morning. Rather, I much more enjoy things like recruitment, community partnership building, organizational analysis, etc. At the same time, I really value the diversity of the city management field and I'm not necessarily looking to launch into HR or PR even though it may sound like that's where some of my natural interests lie. \nI watch my city manager (mid-size city) and I see that even financial and legal discussions/ problems are very interesting at that executive level, but I suppose the thing is that I need to put in my time at the entry-level, when it's not so interesting. \nIs this simply a case of youthful impatient ambition, or are there more grave career changing issues that I need to contemplate? I realize that small town city management may not be my best fit if my preference is to work with finances at a less than intimate level.\nAny positive reinforcement or blunt truths that I need to hear?\n\n", 
  "title": "Discovering Career Interests (and finding that they aren't budgeting or finance)", 
  "when": "08-11-2011"
}