{
  "answer_by": null, 
  "answers": [
    {
      "author": "Lawrence Di Re", 
      "score": "0", 
      "text": "\n\nDiane,  The fact that you found this discussion board would indicate that you know www.icma.org.  The site is full of useful, current information about the local government management profession; granted it is not the easiest site to navigate your first time.  You might want to start here to give your group a common starting point to discuss with the elected folks.  http://icma.org/en/icma/about/overview/hiring_manager\nAlso, be mindful of some very recent and well publicized cases of extreme salary and benefit abuses of municipal managers in some locations around the country.  They are rare, but likely to be used as a bludgeon by opponents and\\or \"small government\" types.  Professional managers abide by a code of ethics and literally risk sanction and expulsion from ICMA if found guilty of ethics code violations.  I teach state and local government at Elmhurst College so feel free to contact me for a more developed resource list, like the one I assign to my students.\n\n\nDiane,  The fact that you found this discussion board would indicate that you know www.icma.org.  The site is full of useful, current information about the local government management profession; granted it is not the easiest site to navigate your first time.  You might want to start here to give your group a common starting point to discuss with the elected folks.  http://icma.org/en/icma/about/overview/hiring_manager\n\nAlso, be mindful of some very recent and well publicized cases of extreme salary and benefit abuses of municipal managers in some locations around the country.  They are rare, but likely to be used as a bludgeon by opponents and\\or \"small government\" types.  Professional managers abide by a code of ethics and literally risk sanction and expulsion from ICMA if found guilty of ethics code violations.  I teach state and local government at Elmhurst College so feel free to contact me for a more developed resource list, like the one I assign to my students.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "06-06-2011"
    }
  ], 
  "answers_count": 1, 
  "author": "Diane Verratti", 
  "id": 21089, 
  "score": "0", 
  "tags": [
    "Citizen Education"
  ], 
  "text": "\n\nA small group of citizens is beginning a grass-roots campaign to change the structure of our city government to one run by a city manager. Is there a way to determine what other Illinois communities have this form of government? We hope to be more successful than a similar effort two decades ago, which lost in a referendum, by persuading our aldermen to make this change themselves. We have no money, just a bunch of people who sincerely believe that we can make a difference and help our community to be all that it can be. We need to educate ourselves first, however, in order to educate our elected officials. Perhaps there is a website (haven't yet found one) that would list communities and contact information. Thank you for this awesome organization and website!\n\n", 
  "title": "resident of Waukegan Illinois", 
  "when": "03-06-2011"
}