{
  "answer_by": null, 
  "answers": [
    {
      "author": "Jared Cobb", 
      "score": "0", 
      "text": "\n\nAlex, we place the responsibility on the property owner. If they don't want service they are required to sign a refuse affidavit stating the property is vacant. This information is entered our system and takes the refuse charges off of their bill. To resume service they are required to call or visit the utility window at city hall.\n\n\nAlex, we place the responsibility on the property owner. If they don't want service they are required to sign a refuse affidavit stating the property is vacant. This information is entered our system and takes the refuse charges off of their bill. To resume service they are required to call or visit the utility window at city hall.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-02-2013"
    }, 
    {
      "author": "Alexander McElroy", 
      "score": "0", 
      "text": "\n\nThat's an idea. Thank you Jared.\n\n\nThat's an idea. Thank you Jared.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "04-02-2013"
    }
  ], 
  "answers_count": 2, 
  "author": "Alexander McElroy", 
  "id": 22406, 
  "score": "0", 
  "tags": [], 
  "text": "\n\nDoes anyone make special accommodations for owners of a vacant property when it comes to the amount that they are charged for trash collection service and water service? My City receives these type of requests from individuals who own summer houses in City limits and/or inherited a home they do not plan to occupy.\nOur typical response is that it is too administratively burdensome for the City to know who is currently occupying a home and/or who is taking an extended vacation where they will not need these services for several months. We also cite that there are service fees associated with the costs and it is not solely based on usage (i.e. the ability to have running water even if it is not currently being used). \nI understand our staff's hesitance in providing such accommodations. I was just wondering if any Cities have provided another option for residents other than citing these reasons.\n\n", 
  "title": "Special Accommodations for Vacant Homes", 
  "when": "04-02-2013"
}