{
  "answer_by": null, 
  "answers": [
    {
      "author": "[Unknown]", 
      "score": "1", 
      "text": "\n\nHi Amanda,\nThank you for your interesting question on community foundations. Unfortunately we do not have any specific information on the Knowledge Network about Santa Fe’s Community Foundation at this point although we have many other insightful documents and articles about community foundations in general. You could try contacting Santa Fe’s Community Foundation directly (http://www.santafecf.org/) as well as checking out what other community foundations are doing. Here are some links to get you started and good luck in your research!\n•   Dubuque 2.0:How the Community Foundation of Greater Dubuque Used Environmental Information to Spark Citizen Action is a great case study about the influence a community foundation can have in a community. http://icma.org/en/icma/knowledge_network/documents/kn/Document/304684/Dubuque_20_How_the_Community_Foundation_of_Greater_Dubuque_Used_Environmental_Information_to_Spark_C\n•   Deepening Community Engagement: What Community Foundations Can Do is a comprehensive document covering all aspects of community foundations and what they can do for their communities. http://icma.org/en/icma/knowledge_network/documents/kn/Document/305218/Deepening_Community_Engagement_What_Community_Foundations_Can_Do\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nHi Amanda,\nThank you for your interesting question on community foundations. Unfortunately we do not have any specific information on the Knowledge Network about Santa Fe’s Community Foundation at this point although we have many other insightful documents and articles about community foundations in general. You could try contacting Santa Fe’s Community Foundation directly (http://www.santafecf.org/) as well as checking out what other community foundations are doing. Here are some links to get you started and good luck in your research!\n•   Dubuque 2.0:How the Community Foundation of Greater Dubuque Used Environmental Information to Spark Citizen Action is a great case study about the influence a community foundation can have in a community. http://icma.org/en/icma/knowledge_network/documents/kn/Document/304684/Dubuque_20_How_the_Community_Foundation_of_Greater_Dubuque_Used_Environmental_Information_to_Spark_C\n•   Deepening Community Engagement: What Community Foundations Can Do is a comprehensive document covering all aspects of community foundations and what they can do for their communities. http://icma.org/en/icma/knowledge_network/documents/kn/Document/305218/Deepening_Community_Engagement_What_Community_Foundations_Can_Do\nBest, \nRobin Saywitz \nICMA Knowledge Network Intern \nrsaywitz@icma.org\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-10-2013"
    }, 
    {
      "author": "Cory Fleming", 
      "score": "0", 
      "text": "\n\nHi Amanda - \nHave you also reached out to the Council on Foundations (www.cof.org)?   They work with community foundations throughout the U.S., and might know of other examples that fit your criteria.  \nCory\n\n\nHi Amanda - \n\nHave you also reached out to the Council on Foundations (www.cof.org)?   They work with community foundations throughout the U.S., and might know of other examples that fit your criteria.  \n\nCory\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-10-2013"
    }, 
    {
      "author": "Robert Carty", 
      "score": "0", 
      "text": "\n\nI have a friend in the profession in New Mexico - I'll email you directly if he has connections there.\n\n\nI have a friend in the profession in New Mexico - I'll email you directly if he has connections there.\n\n\nSave Changes\nCancel\n\n\n\n", 
      "when": "28-10-2013"
    }
  ], 
  "answers_count": 3, 
  "author": "Amanda Worrell", 
  "id": 22801, 
  "score": "0", 
  "tags": [
    "Local Culture", 
    "Housing & Community Development", 
    "Finance and Budgeting", 
    "Citizen Engagement", 
    "Next Generation of Managers", 
    "Partnerships", 
    "Economic Development"
  ], 
  "text": "\n\nCurrently I am student working towards my master's degree in Public Affairs.  I attend the Truman School of Public Affairs at the University of Missouri and took on a research project for the City of Columbia to increase my professional development.\nFor the project I am seeking to obtain information on whether or not Santa Fe (someone at the Community Foundation or another outlet) has something similar to the city of Columbia's New Community Fund (NCF).  And if the city also uses a Community Fund how the two interact (i.e. how do they divide responsibility, how are there boards selected, what challenges does shared discretion between a non-profit and Community Foundation face, etc.).  It would be much appreciated if you could provide me with any information or direct me to who could help me discover this information in the City of Santa Fe.\nThe NCF is a 501(c)(3) non-profit established for the purpose of soliciting gifts, grants, property, and monies for the betterment of the City of Columbia by providing for the beautification of the city, the use of natural land, better transportation facilities for residents, the encouragement of the arts, recreation, historical preservation, the facilitation of public health, etc. in order to lessen the cost and burdens on the municipal government.  \nThe NCF acts as a fiscal agent on behalf of the City of Columbia so that donations of money for a particular purpose can be given without first passing through the city's general revenue fund.  There is not a fee for holding funds with the NCF as there is with the Community Foundation.   \nThank you for your time and support.  I look forward to hearing from you so that I can make a recommendation to the City of Columbia's NCF.  With your help I hope to determine if the NCF if a valuable asset to the Columbia community and how they can improve their activity in creative ways.\n\n", 
  "title": "Interest in similar programs for research project", 
  "when": "27-10-2013"
}